[
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "Is this always text on the home list?",
        "ts": "1421438915.000003"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "<@U02F9CXTL>: ^^^ (I mean will this always be two lines of _any_ text or are there other visualizations that may come into play?)",
        "ts": "1421440761.000004"
    },
    {
        "type": "message",
        "user": "U02F9CXTL",
        "text": "Right now, its only the text. Im not 100% sure if the copy will stay when the user returns to the home screen. They might have new copy, or no copy at all. TBD.",
        "ts": "1421442197.000005"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "ok, not a big deal regarding content\/copy, just looking to structure the view properly",
        "ts": "1421442221.000006"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "oh hay, UX chiming in here",
        "ts": "1421443071.000007"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "that intro text should be in a card, and that card should be dismissable",
        "ts": "1421443096.000008"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "all content needs to live on material",
        "ts": "1421443197.000010"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "<@U026PHQ3J> \/ <@U02F9CXTL> ^^^",
        "ts": "1421443389.000011"
    },
    {
        "type": "message",
        "user": "U02F9CXTL",
        "text": "<@U0260V1BX>: Couple things have changed. Client wanted a more step by step intro they guides the user to set up wallpapers and NFC. To keep the messaging consistent in the new flow, we are pulling the \"instruction\" copy out of the cards.",
        "ts": "1421445287.000012"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "I'm just talking Google Material rules\/practices... which we should follow if this is a google app",
        "ts": "1421445418.000013"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "Thanks, Melissa! Jason is correct, that the client has directed the design to this place. I suspect it's one of those situations where the rule-setters are the worst rule-breakers....but we'll make sure they realize it's against their own guidelines. Thanks!",
        "ts": "1421458756.000014"
    }
]