[
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "hey guys, since i'll miss standup today, here's my update: made a change to the initial state of the livewallpaper engine with regard to location and time so that we don't fold the earth into quarters and make Mountain View exist in GMT-4",
        "edited": {
            "user": "U026PHQ3J",
            "ts": "1427212207.000000"
        },
        "ts": "1427212198.000002"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "<@U02688JHZ> I'm planning on going back thru Adam's emails from last week to sort out the NFC stuff so I'll populate the trello board for it at some point today",
        "ts": "1427212242.000004"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Here’s my standup: \n\nYesterday I was able to get 1.5 widgets done before I got called in to sit through jury selection questioning for 3 or 4 hours. I got that feedback from Mary on timing\/color discrepancies, I’ll be waiting to hear more from Christian on what he wants it to end up like. I plan to jam on widgets today with whatever time I get sitting in the waiting room. I’ll check in more toward EOD to share what I’ve got.",
        "ts": "1427212975.000005"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "HEX # for the green is 3BED65",
        "ts": "1427214540.000006"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "I'm working from home today, so please look for me on slack and email.",
        "ts": "1427214567.000007"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "The demo yesterday went well. I had a call with PlusQA and am getting them briefed on the project. If we can get animations completed this week, I'd like to hand it over to PlusQA next week in prep for a second round of dogfood.  On Workshop\/Androidify, I'm still finishing the scope\/SOW (working from home should help with that). We have a few more Androidify animation check-in meetings this week.",
        "ts": "1427214761.000008"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "Magenta = #E20AE2",
        "ts": "1427215060.000009"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Cool. So I checked the hex value for the green art. So far it all appears to be the same value: #3BED65. I haven't looked at every single file but I haven't changed anything from what they gave us. So I think we're good on that front.",
        "ts": "1427215103.000010"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "Also, just scheduled a check-in tomorrow to chat about UX for goldmember\/androidify - hope that time is okay, it's a pretty packed day.",
        "ts": "1427215117.000011"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "Awesome! Thanks, Trent!",
        "ts": "1427215123.000012"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "I was assuming it was all\/most variations in screen display, but glad we can confirm.",
        "ts": "1427215153.000013"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Yeah. It isn't on the asset end.",
        "ts": "1427215185.000014"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "<@U026E0ZNR>: it could be that he was just referring to the text. I'll update that today.",
        "ts": "1427215334.000015"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Ok cool. I just checked and looks like some of the magenta text was off in my comps. So nice catch (even though I think you were referring to your own end).",
        "ts": "1427215524.000016"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "I was. I don't have the email to reference, but I think he just called out the green.",
        "ts": "1427215560.000017"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Yeah. I just caught an inconsistency of my own.",
        "ts": "1427215627.000018"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Just a heads up <@U02688JHZ>. I'm free and I'm in the building. JD got let out early today.",
        "ts": "1427218669.000019"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "Thanks, Trent! I'm working from home, but please find me on slack or email if you have any questions. Just let me know when you'll have video comps that you want to send to the client for review.",
        "ts": "1427218758.000020"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Done for the day <@U02688JHZ>. Here's a clip of all 5 day widgets in a demo reel for the client.",
        "ts": "1427247937.000021"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "<https:\/\/www.dropbox.com\/s\/pvyvqc02ncqwew3\/Day%20Widget%20-%20Full%20Demo%20Reel_02.mp4?dl=0>",
        "ts": "1427247939.000022"
    }
]