[
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "<@U026E0ZNR> this morning, could you do the magic position\/export for the sky elements in Cloudy and Snow?",
        "ts": "1428588917.000002"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "That reduction in opacity actually looks really good Kat. I know at this point any tweaks are just going to be personal preference on the part of Christian. I like how it looks now though.",
        "ts": "1428600893.000002"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "I thought it looked good too, Trent!",
        "ts": "1428600991.000003"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "And <@U026PHQ3J> that new AE file is perfect. Has everything we were missing. Excited to sift through it more.",
        "ts": "1428601092.000004"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "<@U02688JHZ> should the Shortcut Button card actually read Launch Skrillex Website or Launch Skrillex’s Website? (notes from Christian say Skrillex)",
        "ts": "1428602608.000005"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "Let's go with Skrillex's",
        "ts": "1428603270.000006"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "<!channel>: Does anyone have any ideas for additional shortcut button actions? The team is looking to increase usability of the button, and trying to think of additional actions - hopefully those that are a little harder to get to directly from the homescreen.",
        "ts": "1428603396.000007"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "Would love any and all ideas that anyone might have. Particularly if they have a Skrillex connection, but we might be reaching there....",
        "ts": "1428603423.000008"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Hey <@U02688JHZ>, got your email forward with the spinning girl sequence but I needed to request permission for access. Not sure how long it will take them to approve it but wanted to let you know that I'll be waiting on that. Thanks!",
        "ts": "1428607379.000009"
    }
]