[
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "Hey all! I'm WFH today, so will post my standup notes here. Feel free to standup without me, and\/or post any relevant notes here. Thank you!",
        "ts": "1433523321.000002"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "Updated Workshop build was delivered yesterday, and I let the client know we were researching google drive but needed a few more days on that. Nick is working on the onboarding flow, and hopes to send something over today. The CMS update seems to have gone well. I don't see any issues and haven't heard anything. Oh! One question on the CMS updates, <@U02613K0X> Is there any way for us to tell when the UFO pictures will show up? I know we put them in there randomly, and they can place them specifically when they want to, but from a social media standpoint, they wondered if they could know when to expect them.",
        "ts": "1433523448.000003"
    },
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "Yep, I can see where they're at in the sequence of 79 images we have and figure out from that what day they'll show up.",
        "ts": "1433523557.000004"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "Cool. And as I was asking you the question, Adam was responding to Aubrey saying \"let's just place them ourselves when we want them to show up\" so their number in the sequence would be great, but not an urgent request. Since they have the power right in own CMS. :simple_smile:",
        "ts": "1433523840.000005"
    },
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "Oh okay. They still want them to show up automatically at some random days thought right?",
        "ts": "1433523930.000006"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "yeah, they just reminded themselves that they can set them as needed. They should still be left in the sequence as you placed them, and it would be great to give them that info",
        "ts": "1433524233.000007"
    },
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "Cool, I'll figure it out",
        "ts": "1433524305.000008"
    },
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "<@U02688JHZ> just sent you an email with the dates the UFO images will appear for the first time",
        "ts": "1433526360.000009"
    }
]