[
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "<http:\/\/media.fb.com\/2015\/11\/12\/updates-to-360-video\/>",
        "attachments": [
            {
                "service_name": "Facebook Media",
                "service_url": "http:\/\/media.fb.com",
                "title": "Updates to 360 Video",
                "title_link": "http:\/\/media.fb.com\/2015\/11\/12\/updates-to-360-video\/",
                "author_name": "mrdjenovich",
                "author_link": "https:\/\/media.fb.com\/author\/mrdjenovich\/",
                "thumb_url": "https:\/\/i1.wp.com\/fbookmedia.files.wordpress.com\/2015\/11\/blog_image_full.jpg?fit=200%2C150",
                "thumb_width": 200,
                "thumb_height": 107,
                "text": "In September we launched the ability to share and view 360 video in News Feed, and since then we’ve seen thousands of unique and exciting 360 videos on Facebook, from all kinds of publishers.\nToday a number of publishers are sharing new 360 videos on Facebook — including ABC News, Apple Daily (Taiwan), BuzzFeed, FOX’s Scream Queens, Frontline, GoPro, LeBron James &amp; Uninterrupted, New Orleans Saints, and Nickelodeon — and we’re announcing a few updates.\n\n360 video in more places\n360 videos can now be viewed on iOS devices, in addition to Android devices and the web. For publishers, this means that people can watch your 360 videos in more places. Additionally, people using a Samsung Gear VR and supported Samsung smartphone can easily play 360 videos from News Feed in their Gear VR, enabling a more immersive viewing experience.\n\nResources for 360 video creators \nTo support the growing ecosystem of 360 video creators, we’re launching a new 360 video microsite dedicated to providing relevant resources and information. The site includes upload guidelines, common questions, and a set of best practices authored by Chris Milk and Aaron Koplin of Vrse, a leading virtual reality studio. Examples of unique 360 experiences are featured on the site as well.\nWe’re also introducing an optional video control setting for Pages uploading 360 video on Facebook. Page owners will now have the ability to edit the initial camera position and vertical field of view before uploading their 360 videos, allowing for greater control in post-production.\n\nSharing 360 videos from consumer cameras\nWe also want to make it easier to upload 360 videos taken from consumer cameras. We’re working with several camera makers, like Theta, Giroptic, IC Real Tech, and 360fly which are providing in-app “publish to Facebook” options. Videos taken with these cameras will be shareable directly from the native mobile apps, making it easier to share your 360 moments with friends and family.\n360 videos from brands\nFinally, we’re starting to test 360 video as an advertising format as well. AT&amp;T, Corona (AB InBev), Nescafe (Nestle), Ritz (Mondelez), Samsung, and Walt Disney World (Walt Disney Parks and Resorts) are all running 360 video ads, and we’ll continue to test this format with additional advertisers. 360 video represents an exciting creative opportunity for marketers that allows them to tell immersive stories, optimized for mobile devices.",
                "fallback": "Facebook Media Link: Updates to 360 Video",
                "from_url": "http:\/\/media.fb.com\/2015\/11\/12\/updates-to-360-video\/",
                "id": 1
            }
        ],
        "ts": "1447358346.000002"
    }
]