[
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "Damn I've done about half of those, good article!",
        "ts": "1476290028.000328"
    },
    {
        "type": "message",
        "user": "U051P3FPY",
        "text": "Yeah, I really liked it. Every once and I while I come across articles or stories that I think should be required curriculum for all humans. If only there was a way to enforce it.",
        "ts": "1476290122.000329"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Agreed, I enjoyed that article. It was a really helpful perspective to read. And coming from a man that is always well-intentioned but admittedly oblivious more often than I wish I was, the distinction between men that don’t care and men that just don’t know is really important to me. I think I sometimes sense issues but don’t always get what they really are, and the not knowing makes me question if that makes me a part of the problem… when ultimately I just don’t know enough outside my own experiences to know what to do or have the right response.\n\nIt doesn’t always register right away that when my female friends ask me to walk an extra 3 blocks to their car at night when it’s clearly out of my way it’s not just because they want to hang out for an extra 5 minutes. If I’m not thinking, it takes them filling in the blanks for me to realize. So I depend on this type of info\/feedback to be better informed.",
        "ts": "1476292549.000330",
        "reactions": [
            {
                "name": "raised_hands::skin-tone-4",
                "users": [
                    "U0J6TE0CA"
                ],
                "count": 1
            },
            {
                "name": "simple_smile",
                "users": [
                    "U027PV4AP"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "i would include myself in the camp of oblivious more often than not",
        "ts": "1476293422.000331"
    },
    {
        "type": "message",
        "user": "U1172PRDX",
        "text": "not sure if anyone in this <!channel> was able to make it out to ladies’ night last night, but if you did and took some photo booth pics, you can find them here: <http:\/\/thinkbonfire.tumblr.com\/>",
        "attachments": [
            {
                "title": "Bonfire Marketing",
                "title_link": "http:\/\/thinkbonfire.tumblr.com\/",
                "text": "thinkbonfire",
                "fallback": "Bonfire Marketing",
                "thumb_url": "http:\/\/65.media.tumblr.com\/avatar_66ee954160e0_128.png",
                "from_url": "http:\/\/thinkbonfire.tumblr.com\/",
                "thumb_width": 128,
                "thumb_height": 128,
                "service_icon": "http:\/\/65.media.tumblr.com\/avatar_66ee954160e0_128.png",
                "service_name": "thinkbonfire.tumblr.com",
                "id": 1
            }
        ],
        "ts": "1476311677.000332"
    },
    {
        "type": "message",
        "user": "U051P3FPY",
        "text": "Oh shoot! I completely forgot about ladies night! Last time a million people posted about it!",
        "ts": "1476311970.000334"
    },
    {
        "type": "message",
        "user": "U1172PRDX",
        "text": "sign up for the email list! they hardly ever send emails so you won’t be getting spammed",
        "ts": "1476312051.000335"
    }
]