[
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<https:\/\/goodblacknews.org\/2016\/07\/14\/editorial-what-i-said-when-my-white-friend-asked-for-my-black-opinion-on-white-privilege\/>",
        "attachments": [
            {
                "service_name": "GOOD BLACK NEWS",
                "service_url": "http:\/\/goodblacknews.org",
                "title": "EDITORIAL: What I Said When My White Friend Asked for My Black Opinion on White Privilege",
                "title_link": "https:\/\/goodblacknews.org\/2016\/07\/14\/editorial-what-i-said-when-my-white-friend-asked-for-my-black-opinion-on-white-privilege\/",
                "author_name": "goodblacknews",
                "author_link": "https:\/\/goodblacknews.org\/author\/goodblacknews\/",
                "thumb_url": "https:\/\/i1.wp.com\/goodblacknews.files.wordpress.com\/2016\/07\/gbn-got-privilege.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 199,
                "thumb_height": 94,
                "text": "by Lori Lakin Hutcherson, GBN Editor-in-Chief\nYesterday&amp;nbsp;I was tagged in a post by an old high school friend, asking me and a few others a very public, direct question about white privilege and racism.&amp;nbsp; I feel&amp;nbsp;compelled not only to publish his query but also my response&amp;nbsp;to it, as&amp;nbsp;it may be a helpful discourse for more than just a handful of folks on Facebook.\nHere&amp;rsquo;s his post:\n&amp;ldquo;To all of my Black or mixed race FB friends, I must profess a blissful ignorance of this &amp;ldquo;White Privilege&amp;rdquo; of which I&amp;rsquo;m apparently guilty of possessing. By not being able to fully put myself in the shoes of someone from a background\/race\/religion\/gender\/ nationality\/body type that differs from my own makes me part of the problem, according to what I&amp;rsquo;m now hearing. Despite my treating everyone with respect and humor my entire life (as far as I know), I&amp;rsquo;m somehow complicit in the misfortune of others. I&amp;rsquo;m not saying I&amp;rsquo;m colorblind, but whatever racism\/sexism\/other -ism my life experience has instilled in me stays within me, and is not manifested in the way I treat others (which is not the case with far too many, I know).\nSo that I may be enlightened, can you please share with me some examples of institutional racism that have made an indelible mark upon you? If I am to understand this, I need people I know personally to show me how I&amp;rsquo;m missing what&amp;rsquo;s going on. Personal examples only. I&amp;rsquo;m not trying to be insensitive, I only want to understand (but not from the media). I apologize if this comes off as crass or offends anyone.&amp;rdquo;\nHere&amp;rsquo;s my response:\nHi, Jason.&amp;nbsp; First off, I hope you don&amp;rsquo;t mind that I&amp;rsquo;ve quoted your post and made it part of mine.&amp;nbsp; I think the heart of what you&amp;rsquo;ve asked of your friends of color is extremely important and I think my response needs much more space than as a reply on your feed.&amp;nbsp; I truly thank you for wanting to understand what you are having a hard time understanding.&amp;nbsp; Coincidentally, over the last few days I have been thinking about sharing some of the incidents of prejudice\/racism I&amp;rsquo;ve experienced in my lifetime &amp;ndash; in fact I just spoke with my sister Lesa about how to best do this yesterday &amp;ndash; because I realized many of my friends &amp;ndash; especially the white ones &amp;ndash; have no idea what I&amp;rsquo;ve experienced\/dealt with unless they were present (and aware) when it happened.&amp;nbsp; There are two reasons for this : 1) because not only as a human being do I suppress the painful and uncomfortable in an effort to make it go away, I was also taught within my community (I was raised in the &amp;lsquo;70s &amp;amp; &amp;lsquo;80s &amp;ndash; it&amp;rsquo;s shifted somewhat now) and by society at large NOT to make a fuss, speak out, or rock the boat. To just &amp;ldquo;deal with it,&amp;rdquo; lest more trouble follow (which sadly, it often does). &amp;nbsp;2) Fear of being questioned or dismissed with &amp;ldquo;Are you sure that&amp;rsquo;s what you heard?&amp;rdquo; or &amp;ldquo;Are you sure that&amp;rsquo;s what they meant?&amp;rdquo; and being angered and upset all over again by well-meaning-but-hurtful and essentially&amp;nbsp;unsupportive responses.\nSo, again, I&amp;rsquo;m glad you asked, because I really want to answer. But as I do, please know a few things first: 1) This is not even close to the whole list. I&amp;rsquo;m cherrypicking because none of us have all day.&amp;nbsp; 2) I&amp;rsquo;ve been really lucky. Most of what I share below is mild compared to what others in my family and community have endured. 3) I&amp;rsquo;m going to go in chronological order so you might begin to glimpse the tonnage and why what many white folks might feel is a &amp;ldquo;Where did all of this come from?&amp;rdquo; moment in society has been festering individually and collectively for the LIFETIME of pretty much every black or brown person living in America today regardless of wealth or opportunity. 4)Some of what I share covers sexism, too &amp;ndash; intersectionality is another term I&amp;rsquo;m sure you&amp;rsquo;ve heard and want to put quotes around, but it&amp;rsquo;s a real thing, too, just like white privilege.&amp;nbsp; But you&amp;rsquo;ve requested a focus on personal experiences with racism, so here it goes:\n1. When I was 3, my family moved into an upper-middle class, all-white neighborhood. We had a big backyard, so my parents built a pool. Not the only pool on the block, but the only one neighborhood boys started throwing rocks into. White boys. One day my mom ID&amp;rsquo;d one as the boy from across the street, went to his house, told his mother and fortunately, his mother believed mine.&amp;nbsp; My mom not only got an apology, but also had that boy jump in our&amp;nbsp;pool and retrieve every single rock. No more rocks after that. Then Mom even invited him to come over to swim sometime if he asked permission. Everyone became friends. This one has a happy ending because my mom was and is badass about matters like these, but I hope you can see that the white privilege in this situation is being able to move into a &amp;ldquo;nice&amp;rdquo; neighborhood and be accepted not harassed, made to feel unwelcome, or prone to acts of vandalism and hostility.\n2. When my older sister was 5, a white boy named Mark called her a &amp;ldquo;nigger&amp;rdquo; after she beat him in a race at school. She didn&amp;rsquo;t know what it meant but in her gut, she knew it was bad. This was the first time I&amp;rsquo;d seen my father the kind of angry that has nowhere to go.&amp;nbsp; I somehow understood it was because not only had some boy verbally assaulted his daughter and had gotten away with it, it had way too early introduced her (and me) to that term and the reality of what it meant &amp;ndash; that some white people would be cruel and careless with black people&amp;rsquo;s feelings just because of our skin color. Or our achievement.&amp;nbsp; If it&amp;rsquo;s unclear in any way, the point here is if you&amp;rsquo;ve NEVER had a defining moment in your childhood or your life, where you realize your skin color alone makes other people hate you, you have white privilege.\n3. Sophomore year of high school. I had Mr. Melrose for Algebra 2. Some time within the first few weeks of class, he points out that I&amp;rsquo;m &amp;ldquo;the only spook&amp;rdquo; in the class.&amp;nbsp; This was meant to be funny.&amp;nbsp; It wasn&amp;rsquo;t.&amp;nbsp; So, I doubt it will surprise you I was relieved when he took&amp;nbsp;medical leave after suffering&amp;nbsp;a heart attack and was replaced by a sub for the rest of the semester. &amp;nbsp;The point here is if you&amp;rsquo;ve never been &amp;lsquo;the only one&amp;rsquo; of your race in a class, at a party, on a job, etc. and\/or it&amp;rsquo;s been pointed out in a &amp;ldquo;playful&amp;rdquo; fashion by the authority figure in said situation &amp;ndash; you have white privilege.\n4. When we started getting our college acceptances senior year, I remember some white male classmates pissed that another black classmate had gotten into UCLA while they didn&amp;rsquo;t. They said that affirmative action had given him &amp;ldquo;their spot&amp;rdquo; and it wasn&amp;rsquo;t fair.&amp;nbsp; An actual friend of theirs. Who&amp;rsquo;d worked his ass off.&amp;nbsp; The point here is&amp;nbsp;if you&amp;rsquo;ve never been on the receiving end of the assumption that when you&amp;rsquo;ve achieved something it&amp;rsquo;s only because it was taken away from a white person who &amp;ldquo;deserved it&amp;rdquo; &amp;ndash; that is white privilege.\n5. When I got accepted to Harvard (as a fellow AP student you were witness to what an academic beast I was in high school, yes?), three separate times I encountered white strangers as I prepped for …",
                "fallback": "GOOD BLACK NEWS Link: EDITORIAL: What I Said When My White Friend Asked for My Black Opinion on White&nbsp;Privilege",
                "from_url": "https:\/\/goodblacknews.org\/2016\/07\/14\/editorial-what-i-said-when-my-white-friend-asked-for-my-black-opinion-on-white-privilege\/",
                "service_icon": "https:\/\/secure.gravatar.com\/blavatar\/2f29e63401f550edbb177c6aad6497d2?s=114",
                "id": 1
            }
        ],
        "ts": "1469162874.000027"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "Reading this, I was struck by the vulnerability and hurt she must willingly confront every time she chooses to engage in a discussion about her experiences with prejudice. I will continually remind myself of this every time I find myself in these discussions: I am learning, but you are re-living. That makes the gift of understanding even more precious.",
        "ts": "1469163276.000029",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U0HP6TFNX"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0HS41J3Y",
        "text": "^thats a really good point Joel",
        "ts": "1469165655.000030"
    }
]