[
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Forgot to say that I’m really bummed I didn’t make it over to that workshop. Looks like you all made some really great discoveries. It’s so important for us to even acknowledge those blind spots. I come from an extremely religious\/politically conservative background. As much as I’ve adapted to the PNW way of living, and regardless of the extent it influences my life today, that stuff is always going to be a part of my identity. And going on some of John’s comments, even revealing that information almost feels a bit risky to me based on prior experiences and casual comments overheard throughout my time in the university system and professional field. \n\nI think I shared a while back that the thing I’m most excited about with our committee is getting into areas of D&amp;I that are least popular and most difficult to engage with. It’s because I think when you confront the most challenging biases that you’re actually able to approach Inclusion from a holistic place of fairness and open mindedness. That type of perspective will make you better all around and create safe spaces for everyone.",
        "ts": "1478549269.000501"
    },
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "+1",
        "ts": "1478549374.000502"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "And like always, these aren’t just more social topics to toss egg shells down for. It’s fuel for more intentional conversations to reveal personal biases and expose misconceptions of “the other”.",
        "ts": "1478549382.000503"
    },
    {
        "type": "message",
        "user": "U027PV4AP",
        "text": "<!channel> Come Join me! <https:\/\/impactflow.com\/event\/techtown-portland-change-agent-series-4-1007>",
        "attachments": [
            {
                "service_name": "ImpactFlow",
                "title": "TechTown Portland: Change Agent Series #4, Portland",
                "title_link": "https:\/\/impactflow.com\/event\/techtown-portland-change-agent-series-4-1007",
                "text": "Change Agent Session #4LOCATION CHANGE: This session will be held at Zapproved; 1414 NW Northrup Street; 7th floorWe've been on hiatus over the summer and this interactive 90 minute session will build on the initial Change Agent workshops. We've learned a lot from you on what worked best in those sessions and will use that to deliver an even more valuable session. Expect more cross company interaction and focusing on ways to address real obstacles with being a change agent. Two things you can do prior to the session. One, register; two, ensure your company has two to three other people registered. Thanks and see you soon!About the SeriesThe Change Agent Series is part of the TechTown Diversity Pledge. Feel free to contact Jared Wiener &lt;tel:(503-823-1034|(503-823-1034&gt; or email) if you have any questions.",
                "fallback": "ImpactFlow: TechTown Portland: Change Agent Series #4, Portland",
                "image_url": "https:\/\/res-4.cloudinary.com\/impactflow\/image\/upload\/v1477581783\/rh7siacjq1pnwhtqqscv.jpg",
                "from_url": "https:\/\/impactflow.com\/event\/techtown-portland-change-agent-series-4-1007",
                "image_width": 444,
                "image_height": 250,
                "image_bytes": 382627,
                "service_icon": "https:\/\/impactflow.com\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1478559810.000504"
    },
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "And me!",
        "ts": "1478560240.000506"
    }
]