[
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "<https:\/\/medium.com\/@anildash\/prince-transformed-eab793c75757#.r53fctovu>",
        "attachments": [
            {
                "service_name": "Medium",
                "title": "“I Am #Transformed”",
                "title_link": "https:\/\/medium.com\/@anildash\/prince-transformed-eab793c75757#.r53fctovu",
                "text": "At the EyeO Festival in Minneapolis, Minnesota, I celebrated what would have been Prince’s 58th birthday with a talk connecting immigration…",
                "fallback": "Medium: “I Am #Transformed”",
                "image_url": "https:\/\/cdn-images-1.medium.com\/max\/1200\/1*ouWhwZ9bGRQDDoGMWdfpeQ.gif",
                "fields": [
                    {
                        "title": "Reading time",
                        "value": "13 min read",
                        "short": true
                    }
                ],
                "ts": 1470370285,
                "from_url": "https:\/\/medium.com\/@anildash\/prince-transformed-eab793c75757#.r53fctovu",
                "image_width": 444,
                "image_height": 250,
                "image_bytes": 7042465,
                "service_icon": "https:\/\/cdn-static-1.medium.com\/_\/fp\/img\/apple-touch-icon-ipad-retina.Akq8aSfZqfW1fceMxKqBZA.png",
                "id": 1
            }
        ],
        "ts": "1470414740.000429"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "<http:\/\/www.dudeineedatruck.com\/who-we-are\/> :angry:",
        "ts": "1470420926.000431"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Honestly just curious, what exactly is the upsetting part?",
        "ts": "1470421286.000432"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Do they only employ men for their trucks?",
        "ts": "1470421330.000433"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "it’s one thing for the service to be called “Dude, I need a truck”, but another to also call all your drivers “dudes\"",
        "ts": "1470421348.000434"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "There's a moving co in Portland called Two Men and a Truck, but it's nowhere near as obnoxious",
        "ts": "1470421389.000435"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I guess my own perspective is limited (I may have a few “dude” friends), I’m hoping to gain a better understanding here: Is this something actively offensive to women or is it more obnoxious the way that “dudes\" can be?",
        "ts": "1470421600.000436"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "for me, being actively offensive is less the issue, more than sustaining a culture of “men do this and women do that\"",
        "ts": "1470421750.000437",
        "reactions": [
            {
                "name": "cry",
                "users": [
                    "U0J6TE0CA"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "i won’t speak to others’ offense taking tho!",
        "ts": "1470421764.000438"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "some languages do not assign gender to words to begin with. #thanksRomanceLanguages",
        "ts": "1470422891.000439"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I totally agree that “dude” culture in general can be douchy (that association is assumed much of the time). I guess I struggle to tell if this actual business is exclusionary or if it’s the framing of being about dudes that’s icky and lacking tact. I personally know a fair amount of people that see the world through a similar lens as this “Dude I Need a Truck” business—and it definitely seems insensitive—but from what I’ve experienced a lot of the time it comes from a place of ignorance rather than bad intentions (which does remind me of Daria’s shared insight on intentions). \n\nWhat I’m getting at is that in addition to exposing issues of exclusion\/lack of diversity, I would love so much to have discussions around how we, as the Uncorked Diversity Committee, can effectively address and find solutions for things like this with the intent to build our collective understanding for when we need to address insensitivities in settings that we actually have influence on. Because I don’t totally know. The things I learn from our pursuit of diversity carry over into my non-work life, I’m hoping to keep learning in that respect and find healthy ways to address these types of situations when I encounter them. \n\n(I hope this doesn’t come across as brash or uninformed in any way, I’m just genuinely excited for how this group ultimately ends up affecting change, be it internally or externally)",
        "ts": "1470426415.000440"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I also realize this might be a bit of a pot shot coming from someone who hasn’t had the time to be involved in much of the Diversity Committee yet :innocent:",
        "ts": "1470426563.000441"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "yeah!",
        "ts": "1470426670.000442"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Totally agree - and I think a lesson I’d take from the Dude With a Truck is that we should be aware of the inclusivity of our language",
        "ts": "1470426692.000443"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "when describing a sales team, don’t say salesman, for instance",
        "ts": "1470426701.000444"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "When writing job descriptions, don’t use a specific gender when referring to adjacent roles (regardless of the person holding the position)",
        "ts": "1470426749.000445"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "[and while bro culture can be douchey, i was really referring to the gendered language]",
        "ts": "1470426798.000446"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "these are good convos to have and it’s totally ok [and GREAT] to say we don’t know how to fix it and to try and work in whatever incremental ways we can",
        "ts": "1470426831.000447"
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "For me the branding is just super “bro” culture, very few images of women on the employment side, that sorta thing. More of an eye roll than something I am deeply offended by.",
        "ts": "1470426869.000448",
        "reactions": [
            {
                "name": "face_with_rolling_eyes",
                "users": [
                    "U06DFL7BP"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "<@U026E0ZNR> i like that you’re piping up and putting some direction on this channel and conversation. i love how the conversation has gotten more pointed, faster pace, and is literally bringing things I’d never see otherwise into my daily life. i feel and have heard others say that this channel is also now a bit intimidating (not surprising, it is a channel that has a lot of guidance on what not to do, so nobody wants to step their foot in it) as a result, and i think an upgraded place for the positive open forum that it is already is to have _purpose_ and _output_. even something tangible as simple as “what the heck should i be concluding from all this” kind of bookends on a topic is compelling and i am sure many people are already making small adaptations.",
        "ts": "1470427990.000449"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I think it's really helpful to talk about the lessons learned and how to apply them. Thanks for breaking that down Charles. And thanks for spelling that out so well John. \n\nIn that vein, if I'm being really transparent, I've been in work environments where there was so much emphasis on what's being done wrong that I was literally worried and anxious on a daily basis of accidentally saying something insensitive without knowing it. I'm hoping to not accidentally alienate anyone that might not know better. I don't believe that's where we are, but do want to highlight that we should maybe consider approaching exclusionary behaviors from a stance of trying to help others move toward inclusion. \n\nAnd I want to help!",
        "ts": "1470428475.000450"
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "<@U026E0ZNR>:  I don’t think it’s offensive to ask why. Should feel safe to ask! Glad you did!",
        "ts": "1470428537.000451"
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "There was an amazing part of Orange is the New Black, the mother’s day episode, where one of the women (Yael Stone) goes to the salon, run by the transgender woman on the show (Laverne Cox) &amp; she asks “So are you celebrating on mother’s day or father’s day?” and Laverne Cox’s character gets infuriated.",
        "ts": "1470428847.000452"
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "Yael is taken aback and goes “I don’t know, I am just asking so I can learn”. It was an interesting scene.",
        "ts": "1470428870.000453"
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "Laverne Cox softens and explains everything to her, and it was really touching. An open learning experience which was nice.",
        "ts": "1470428928.000454"
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "Tried to find the clip but couldn’t. Point is, nobody should be afraid to ask questions if they’re made in earnest. Hope this channel doesn’t inhibit an opportunity to learn.",
        "ts": "1470429000.000455"
    },
    {
        "type": "message",
        "user": "U13GPDA1F",
        "text": "<@U026E0ZNR>: :100: to being solutions-oriented",
        "ts": "1470429580.000456"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "That’s so interesting Emily, I love that. Been awhile since I’ve watched OITNB. I think that’s exactly what I’m hoping for, I really am craving deep conversations about this stuff to understand many perspectives, even if it’s a little bumpy at times. Because that’s when I learn. I think that’s when we all learn.",
        "ts": "1470430200.000457"
    },
    {
        "type": "message",
        "user": "U1172PRDX",
        "text": "An interesting article about ethnic food! <https:\/\/www.washingtonpost.com\/posteverything\/wp\/2015\/08\/31\/childhood-friends-called-my-food-chinese-grossness-how-did-it-become-americas-hottest-food-trend\/> As someone who grew up in a multiracial household the struggle between eating my family's kelaguen and wanting wonder bread sandwiches like my friends was real",
        "attachments": [
            {
                "service_name": "Washington Post",
                "title": "How it feels when white people shame your culture’s food — then make it trendy",
                "title_link": "https:\/\/www.washingtonpost.com\/posteverything\/wp\/2015\/08\/31\/childhood-friends-called-my-food-chinese-grossness-how-did-it-become-americas-hottest-food-trend\/",
                "text": "My family's food went from 'Chinese grossness' to America's 'hottest food trend.'",
                "fallback": "Washington Post: How it feels when white people shame your culture’s food — then make it trendy",
                "image_url": "https:\/\/images.washingtonpost.com\/?url=http:\/\/img.washingtonpost.com\/posteverything\/wp-content\/uploads\/2015\/08\/soup_horizontal.jpg&w=1484&op=resize&opt=1&filter=antialias",
                "from_url": "https:\/\/www.washingtonpost.com\/posteverything\/wp\/2015\/08\/31\/childhood-friends-called-my-food-chinese-grossness-how-did-it-become-americas-hottest-food-trend\/",
                "image_width": 419,
                "image_height": 250,
                "image_bytes": 121856,
                "service_icon": "https:\/\/www.washingtonpost.com\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1470432627.000458"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "pho was kinda foreign when i was in high school. i remember my friend telling me about his whole class going to a vietnamese restaurant and he and his teacher were the only ones willing to eat it",
        "edited": {
            "user": "U02AUNA0P",
            "ts": "1470495770.000000"
        },
        "ts": "1470441074.000460",
        "reactions": [
            {
                "name": "ramen",
                "users": [
                    "U0HP6TFNX",
                    "U1172PRDX"
                ],
                "count": 2
            }
        ]
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "<#C1N0WFD7W> ",
        "ts": "1470441166.000461"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "lol",
        "ts": "1470441188.000462"
    },
    {
        "user": "U0260V4K1",
        "text": "<@U0260V4K1|justin> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1470446124.000464"
    }
]