[
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "<http:\/\/redqueencoder.com\/balancing-act\/>",
        "ts": "1469992822.000175",
        "reactions": [
            {
                "name": "dog",
                "users": [
                    "U0K8ZSHN0"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U167FL70V",
        "text": "I’m not sure if this is the kind of thing we usually get involved in, but I thought I would share out and see where it lands. My roommate works for Public Annex, and they are hosting a fundraising event August 16th. Here’s a quick blurb:\n\n``` Public Annex is a non-profit organization that will provide accessible urban farming and arts programming focusing on inclusivity of artists and farmers with disabilities.\n\nOur mission is to break down systemic barriers that prohibit marginalized populations from inclusivity by building a community around accessible farming and art programming.\n\nWe will be utilizing the spaces of other arts and urban farming organizations around Portland, Oregon to provide our programming. We believe that in partnering with established organizations, we can further our mission of helping marginalized populations become included in communities and spaces that they have not historically been able to access.\n\nDue to major state and federal funding changes, many incredible programs that serve adults with disabilities are closing their doors. Public Annex will work to provide the much-needed programming that will be lost as a result of these closures. \n\nWe need your help in getting this important work started!\n\nDinner proceeds will go towards:\n• Rental of spaces for our programming \n• Renovation of spaces to increase accessibility\n• Paying art and farming educators and facilitators\n• Paying staff to run the programming\n• Bringing in lecturers\n• Putting on events that bring education and \nawareness to the community\n• Financial aid for people to attend our programming```",
        "ts": "1470017230.000176"
    },
    {
        "type": "message",
        "user": "U167FL70V",
        "text": "and the event: <http:\/\/accesspublicannex.bpt.me\/>",
        "attachments": [
            {
                "title": "Access: A Benefit Dinner for Public Annex",
                "title_link": "http:\/\/accesspublicannex.bpt.me\/",
                "text": "A fundraiser for Public Annex, a non-profit organization that will provide accessible urban farming and arts programming focusing on inclusivity of artists and farmers with disabilities.",
                "fallback": "Access: A Benefit Dinner for Public Annex",
                "from_url": "http:\/\/accesspublicannex.bpt.me\/",
                "thumb_url": "http:\/\/accesspublicannex.bpt.me\/g\/6\/BPT_logo_drop_small.png",
                "thumb_width": 192,
                "thumb_height": 50,
                "service_icon": "http:\/\/accesspublicannex.bpt.me\/favicon.ico",
                "service_name": "accesspublicannex.bpt.me",
                "id": 1
            }
        ],
        "ts": "1470017238.000177"
    }
]