[
    {
        "type": "message",
        "user": "U13GPDA1F",
        "text": "<https:\/\/www.aclu.org\/blog\/speak-freely\/if-donald-trump-implements-his-proposed-policies-well-see-him-court> planning to fight every step of the way",
        "attachments": [
            {
                "service_name": "American Civil Liberties Union",
                "title": "If Donald Trump Implements His Proposed Policies, We’ll See Him in Court",
                "title_link": "https:\/\/www.aclu.org\/blog\/speak-freely\/if-donald-trump-implements-his-proposed-policies-well-see-him-court",
                "text": "This morning, Donald J. Trump was elected the 45th president of the United States, and the ACLU has a message for him. President-elect Trump, as you assume the nation’s highest office, we urge you to reconsider and change course on certain campaign promises you have made. These include your plan to amass a deportation force to remove 11 million undocumented immigrants; ban the entry of Muslims into our country and aggressively surveil them; punish women for accessing abortion; reauthorize waterboarding and other forms of torture; and change our nation’s libel laws and restrict freedom of expression. These proposals are not simply un-American and wrong-headed, they are unlawful and unconstitutional. They violate the First, Fourth, Fifth, Eighth, and 14th Amendments. If you do not reverse course and instead endeavor to make these campaign promises a reality, you will have to contend with the full firepower of the ACLU at every step. Our staff of litigators and activists in every state, thousands of volunteers and millions of card-carrying members and supporters are ready to fight against any encroachment on our cherished freedoms and rights. One thing is certain: We will be eternally vigilant every single day of your presidency. And when you leave the Oval Office, we will do the same with your successor as we have done throughout our nearly 100 years of existence. The Constitution and the rule of law are stronger than any one person, and we will see to that. We will never waver.",
                "fallback": "American Civil Liberties Union: If Donald Trump Implements His Proposed Policies, We’ll See Him in Court",
                "image_url": "https:\/\/www.aclu.org\/sites\/default\/files\/field_image\/web16-trump-red-black-1160x610.jpg",
                "from_url": "https:\/\/www.aclu.org\/blog\/speak-freely\/if-donald-trump-implements-his-proposed-policies-well-see-him-court",
                "image_width": 475,
                "image_height": 250,
                "image_bytes": 238948,
                "service_icon": "https:\/\/www.aclu.org\/sites\/all\/themes\/custom\/aclu\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1478723368.000509"
    },
    {
        "type": "message",
        "user": "U13GPDA1F",
        "text": "(also some of the comments :broken_heart:)",
        "ts": "1478723400.000511"
    }
]