[
    {
        "type": "message",
        "user": "U027PV4AP",
        "text": "Today is the 2nd Anniversary Party for Women Who Code. New Relic and Instrument, two of the 23 companies that have signed the Techtown Diversity Pledge, are making this event possible. The event will be at Instrument, starts at 6pm and is free of charge. There will be drinks, apps, networking, and lightning talks from employees of Instrument and New Relic. It should be a lot of fun and the best news is there’s still time to register!",
        "edited": {
            "user": "U027PV4AP",
            "ts": "1465568289.000000"
        },
        "ts": "1465568274.000009"
    },
    {
        "type": "message",
        "user": "U13GPDA1F",
        "text": "heres a link to :point_up_2: in case anyone needs it: <https:\/\/www.eventbrite.com\/e\/networking-night-2nd-anniversary-party-tickets-25692211095?aff=efbnreg>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "Networking Night + 2nd Anniversary Party",
                "title_link": "https:\/\/www.eventbrite.com\/e\/networking-night-2nd-anniversary-party-tickets-25692211095?aff=efbnreg",
                "text": "Together, Instrument and New Relic are excited to host the 2-year anniversary celebration for Women Who Code Portland! Our June event is both a Networking Night and a party to celebrate 2 years since we started organizing events for the Portland community! During the first part of the program, six women from Instrument and New Relic will present lightning talks. Speakers will share anecdotes, inspiration or projects that celebrate the art of code and the feminine experience. This will be followed by a DJ and music to end the night! Don't miss this! Program  6:00-6:30 - Doors Open 6:30-6:45 - Intros from Women Who Code, Instrument, and New Relic   6:45-7:45 - Lightning Talks + Q&amp;A 7:45-9:00 - DJ  Speakers - EMCEE - Liz Abinante - Senior Software Engineer, New Relic - Tina Snow Le - Art Director, Instrument - Tina Snow Le is a first generation Vietnamese-American artist born and raised in Portland, Oregon. As an Art Director at Instrument, she creates digital experiences for Nike. As an artist, she develops projects that explore how design can impact society for the better. Her most recent endeavors include launching a mentorship program called Back to Back, which champions diversity in the Portland creative community, and designing wallpaper inspired by the powerful intuition of the Wild Woman. - Violet Peña - Web Developer, Instrument - Violet is a web developer living in Portland, OR. She likes forging connections, creating new spaces, and making the imaginary real. When she’s away from a screen she can be found climbing, hiking, or reading. She can’t keep succulents alive but is fine at growing normal plants. - Alexis Johnson - IT, Instrument - Alexis is a Technical Coordinator at Instrument with a background in information security and technical customer support. Compelled by new technology and passionate about people’s interactions with their devices, Alexis finds joy in improving others’ relationships with their digital experience. Alexis is also passionate about gardening, social justice, scripting, yoga, and technical writing. - April Leonard - Senior Software Engineer, New Relic - April is a Portland native and longtime Java engineer. She has experience building many enterprise applications including an adaptive test engine and a custom shopping cart servicing millions of customers. She delights in solving problems, finding efficiencies, and learning new things. Her current focus is learning new languages with an emphasis on functional programming. She enjoys laughing, running, cycling, yoga, gardening, and spending time with her family.  - Emily Bookstein - Software Engineer, New Relic - Although Emily studied environmental science, after building a climate-change web game she decided to pursue web development instead. She studied full stack web development with Hackbright Academy, the all-women's coding bootcamp in San Francisco (Fall 2014). Before coming to Portland, Emily was the resident nerd in an Oakland co-op. - Lindsey Austinson - Product Designer, New Relic - Lindsey has been making things on the internet for over ten years, doing everything from writing code to designing interfaces, and much of what comes in between. She loves to work with diverse groups of people on interesting projects which led to her current day job as a user experience designer. Lindsey's favorite projects involve simplifying complex systems, solving curious technical problems, and, most importantly, working with super awesome people.  Who Should Attend? Anyone is welcome to attend, as long as you support our mission and agree to follow our Code of Conduct. About Instrument Instrument is an independent digital creative agency in Portland, Oregon. They build brands, experiences and campaigns for every screen.  About New Relic New Relic is a software analytics company that makes sense of billions of metrics about millions of applications in real time. Their comprehensive SaaS-based solution provides a powerful interface for web and native mobile applications and consolidates the performance monitoring data for any chosen technology in your environment.",
                "fallback": "Eventbrite: Networking Night + 2nd Anniversary Party",
                "image_url": "https:\/\/img.evbuc.com\/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F21735986%2F164757992928%2F1%2Foriginal.jpg?w=1000&rect=12%2C7%2C1578%2C789&s=d6359f7c79f5adf3c47b0f0b15450fed",
                "fields": [
                    {
                        "title": "Where",
                        "value": "3529 North Williams Avenue, Portland, OR 97227",
                        "short": true
                    },
                    {
                        "title": "When",
                        "value": "Fri, Jun 10, 2016 at 6:00 PM",
                        "short": true
                    }
                ],
                "from_url": "https:\/\/www.eventbrite.com\/e\/networking-night-2nd-anniversary-party-tickets-25692211095?aff=efbnreg",
                "image_width": 500,
                "image_height": 250,
                "image_bytes": 66713,
                "service_icon": "https:\/\/cdn.evbstatic.com\/s3-build\/perm_001\/1aab42\/django\/images\/touch_icons\/apple-touch-icon-57x57.png",
                "id": 1
            }
        ],
        "ts": "1465576036.000011"
    }
]