[
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "<https:\/\/techcrunch.com\/2017\/07\/12\/xfactor-is-a-new-3m-pre-seedseed-fund-looking-to-invest-in-female-led-startups\/?ncid=mobilenavtrend>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "XFactor is a new $3M pre-seed\/seed fund looking to invest in female-led startups",
                "title_link": "https:\/\/techcrunch.com\/2017\/07\/12\/xfactor-is-a-new-3m-pre-seedseed-fund-looking-to-invest-in-female-led-startups\/?ncid=mobilenavtrend",
                "author_name": "Jordan Crook",
                "thumb_url": "https:\/\/i1.wp.com\/tctechcrunch2011.files.wordpress.com\/2017\/07\/xfactor_final_logos_all-01-copy.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 199,
                "thumb_height": 86,
                "text": "Part of the sexism problem in tech\/VC comes down to the fact that women are far outnumbered by men, especially at the top of the food chain.\nWomen represent seven percent of the partner positions within the tech VC community. This, in turn, leads to female founders receiving less funding simply because unconscious bias leads folks to invest in people who look like themselves and even approach those who are different more skeptically. In fact, a study of Disrupt footage from the Battlefield Q&amp;A shows female founders get asked very different questions by VCs than their male counterparts.\nThis leads us to XFactor Ventures.\nXFactor is a new pre-seed and seed-stage microfund that is looking to spread $3 million across 30 companies, all of which will have at least a single female founder.\nThe fund is the brainchild of Anna Palmer, cofounder and CEO of Wondermile and Fashion Project, along with Chip Hazard, Flybridge Capital general partner.\nFlybridge put up 20 percent of the initial capital, and LPs invested in the rest of the fund.\nThere are a few funds that are focused on investing in female-led companies &mdash; BBG Ventures and Female Founders Fund are two that come to mind &mdash; but XFactor is different in that all of the partners (with the exception of Chip Hazard and Flybridge partner Kate Castle, who is also joining the fund) are entrepreneurs.\nThese women come from a broad variety of sectors, and are looking to cut their teeth as VCs while also offering capital, advice, connections and mentorship.\nXFactor partners include Aubrie Pagano (Bow and Drape), Liz Whitman (Manicube), Kathryn Minshew (The Muse), Danielle Morrill (Mattermark), Erica Brescia (Bitnami), Jessica Mah (InDinero) and Ooshma Garg (Gobble).\n\n    \n\t\t            \n\t\t            annapalmer\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            aubriepagano\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            chiphazard\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            daniellemorrill\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            ericabrescia\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            jessicamah\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            katecastle\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            kathrynminshew\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            lizwhitman\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            Ooshma Garg\n\t\t            \n\t\t            \n\t\t        \n\t        &nbsp;View Slideshow\n\t    \n\t    \n\t        Previous\n\t        Next\n\t        Exit\n\t    \n\t\nHazard explained to TechCrunch that this isn&rsquo;t just about starting a fund that invests in female-led startups, but also giving these new partners the opportunity to have the same dual-pedigree as many male VCs who start out as founders and move into the investing realm.\nThe other piece is that the partners at XFactor have been out in the tech landscape and secured funding for their startups.\n&ldquo;Looking for funding for Bow &amp; Drape, I felt super under-represented,&rdquo; said Aubrie Pagano. &ldquo;There was no north star as to how to navigate the industry, and going from office to office in Menlo Park, the only other women in the office were executive assistants.&rdquo;\nPagano said she and fellow female founders created a community to help each other navigate the difficult task of fundraising, and XFactor has now allowed that community to take it a step further.\nGiven that Flybridge is already putting up 20 percent of the capital, I asked Hazard why he didn&rsquo;t just hire some of these women as partners at Flybridge and allocate a percentage of the existing Flybridge fund to female-led startups.\n&ldquo;Flybridge is a small team and when we add another partner, hopefully she&rsquo;ll be female,&rdquo; said Hazard.\nHe went on to explain that setting up XFactor as an independent fund not only gives these partners the opportunity to grow their own resumes as investors, but it stands as a data point in the industry, hopefully proving that diverse teams create better, stronger businesses.\nAnd there&rsquo;s data out there to back up this claim. FirstRound Capital&rsquo;s 10 Year Project found that startups with at least one female founder outperform their all-male counterparts by 63 percent, in terms of returns.\nHazard explained that by having partners from a variety of sectors, from traditionally female industries to deep tech, B2B, B2C, and enterprise, the fund can focus on backing the best companies with the best founders, the biggest opportunities with the best opportunities for investment returns.\n&ldquo;This is not an affirmative action effort,&rdquo; said Hazard. &ldquo;This is not an effort to lower the bar.&rdquo;\nXFactor&rsquo;s partners will be spread across New York, Boston and San Francisco, and the team says that it is already checking out companies, with investment announcements to come shortly.",
                "fallback": "TechCrunch Link: XFactor is a new $3M pre-seed\/seed fund looking to invest in female-led&nbsp;startups",
                "from_url": "https:\/\/techcrunch.com\/2017\/07\/12\/xfactor-is-a-new-3m-pre-seedseed-fund-looking-to-invest-in-female-led-startups\/?ncid=mobilenavtrend",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/techcrunch-2013\/assets\/images\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1499923095.277580"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "i worked with Danielle at a startup before moving to Portland.",
        "ts": "1499923166.290074",
        "reactions": [
            {
                "name": "100",
                "users": [
                    "U5PHRUDBM"
                ],
                "count": 1
            }
        ]
    }
]