[
    {
        "type": "message",
        "user": "U04JZANJF",
        "text": "<http:\/\/www.cnn.com\/2016\/04\/18\/us\/120th-boston-marathon\/>",
        "attachments": [
            {
                "service_name": "CNN",
                "title": "Ethiopian runners sweep Boston Marathon",
                "title_link": "http:\/\/www.cnn.com\/2016\/04\/18\/us\/120th-boston-marathon\/",
                "text": "Ethiopia's Lemi Berhanu Hayle won the elite men's division of the Boston Marathon in an unofficial time of 2:12:45 Monday, completing a sweep by runners from that country.",
                "fallback": "CNN: Ethiopian runners sweep Boston Marathon",
                "image_url": "http:\/\/i2.cdn.turner.com\/cnnnext\/dam\/assets\/160418123836-boston-marathon-winners-2016-split-large-169.jpg",
                "from_url": "http:\/\/www.cnn.com\/2016\/04\/18\/us\/120th-boston-marathon\/",
                "image_width": 444,
                "image_height": 250,
                "image_bytes": 40282,
                "id": 1
            }
        ],
        "ts": "1461000361.000002"
    },
    {
        "type": "message",
        "user": "U04JZANJF",
        "text": "average pace 5:03 and 5:41, respectively",
        "ts": "1461000443.000004"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "funny, tht was my pace before i ate three donuts for breakfast",
        "ts": "1461000800.000005"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "I honestly can’t even conceptualize a 5 minute mile",
        "ts": "1461001368.000006"
    },
    {
        "type": "message",
        "user": "U04JZANJF",
        "text": "i’ve been trying (on and off) to go sub 7 for the last year. a five minute mile is astounding.",
        "ts": "1461001530.000007"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "i unintentionally ran half the run for roses half yesterday cuz the route i chose overalapped.  beautiful morning for a run",
        "ts": "1461002529.000008"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "speaking of marathons: I don’t know if anyone here is familiar with Barkey’s Marathon",
        "ts": "1461003801.000009"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "it’s insane",
        "ts": "1461003811.000010"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "but - here’s some good lunch time reading from the only person to have finished this year: <https:\/\/door5.com\/2016\/04\/16\/barkley-2016-act-4-the-guide\/#more-2302>",
        "attachments": [
            {
                "service_name": "Jared Campbell&amp;#039;s Blog",
                "service_url": "http:\/\/door5.com",
                "title": "Barkley 2016 – Act 4 (the Guide)",
                "title_link": "https:\/\/door5.com\/2016\/04\/16\/barkley-2016-act-4-the-guide\/#more-2302",
                "author_name": "runuphill",
                "author_link": "https:\/\/door5.com\/author\/runuphill\/",
                "thumb_url": "https:\/\/i2.wp.com\/runuphill.files.wordpress.com\/2016\/04\/page-60.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 115,
                "thumb_height": 150,
                "text": "Photo Credit : Des Bosses et des bulles\nSynopsis\nI am honored and lucky to have been given another opportunity to participate in the one and only Barkley Marathons.&amp;nbsp; Past events have been quiet, introspective, and &amp;ldquo;dark&amp;rdquo; challenges for me in some ways.&amp;nbsp; In contrast, 2016 was a different experience as I traveled out with other people, had multiple close friends running, Mindy (my wife) came along, I had fantastic company for the first 4 loops, the skies were clear for nearly the entire race, and the temperatures were perfect.&amp;nbsp; Was this really Barkley?&amp;nbsp; I am thrilled to have finished in 59 hrs 33 minutes, forfeiting only 27 minutes and setting a new personal standard for how much adventure I can extract out of $1.60.\n\nInvested\n&amp;ldquo;If you belong here, you will figure out how to get here.&amp;rdquo; One of my favorite Laz quotes.&amp;nbsp; As a past race director and participant in many trail races both in the US and abroad, I am in awe (in a good way) with how Barkley is conducted, the people it draws, and the seriousness with which most people approach it.\nNo race director wants their participants to be harmed in their event.&amp;nbsp; Standard methods of achieving this goal are implementing mandatory qualifying races, having elaborate aid stations, medical check-ins, pacers, sweepers, required gear, GPS tracking devices, and extensive communication systems, to name a few.&amp;nbsp; Barkley has none of these things.\nBy creating a non-obvious application process, intentionally limiting course information, and letting participates decide for themselves what gear they should bring,the result appears to be participants who arrive well prepared, having done their homework, and equipped for all conditions.&amp;nbsp; A pretty distinct difference from the usual &amp;ldquo;just show up, put your head down, and follow the markers&amp;rdquo; mentality.&amp;nbsp; Essentially everyone is capable of self-extraction and they understand that it is the standard protocol.&amp;nbsp; Additionally, every participant knows how lucky they are to have a spot in the race and will thus gladly carry an extra jacket, gloves, hours of extra food, additional headlamp batteries etc. to prevent a preventable disaster.&amp;nbsp; The lack of course markings means participates have studied their map, understand the drainage systems, and have sharpened their orienteering skills. Participants have invested so much time and energy into just getting to the start-line that they realize how silly it would be for their efforts to come to an end for something that was easily within their control.&amp;nbsp; The result of this lack of infrastructure, interestingly, is exactly what events that have lots of infrastructure desire, knowing that every runner will be okay and give it everything they&amp;rsquo;ve got.\nOn Friday afternoon in the Big Cove Campground, I was surrounded by heros.&amp;nbsp; Erik Storheim and Ty Draney, my close friends who sit at the top of the pedestal of remarkable and well-rounded humans.&amp;nbsp; Jennilyn Eaton, Salt Lake City&amp;rsquo;s mountain phenom who came armed with an high level of determination and hunger for Barkley.\nMe, Ty, Erik\nI finally got to meet Andrew Thompson (AT) after years of reading of his exploits.&amp;nbsp; Frozen Ed, catalyst of the Barkley phase in my life, was&amp;nbsp;in camp, he wouldn&amp;rsquo;t miss his favorite weekend of the year!&amp;nbsp; And, John&amp;nbsp;Fegyveresi, hero of the Barkley documentary and all around fantastic person, had returned for another romp around Frozen Head.\nFrozen Ed, AT, me and John F.\nMichiel &amp;ldquo;Mig&amp;rdquo; Panhuysen, who&amp;rsquo;s infectious energy brings an instant smile.&amp;nbsp; Brad Bishop, who helped me out in 2014 and continually gives back to the ultra-running community&amp;nbsp;looked strong and focused.&amp;nbsp; Jason Poole, long-time Barker and friend from Hardrock was ready to rally.&amp;nbsp; Gary Robbins was amped and ready to go, riding the high of recent fatherhood (I was infected with this in 2014 when Phoebe was just 3.5 months old!).&amp;nbsp; Rhonda Avery was shocking the entire world by attempting Barkley with only 8% vision.&amp;nbsp; Leon Lutz was on-site and quietly crafting the right story about Barkley.&amp;nbsp; John Kelly, who burst onto the Barkley scene in 2015 was back, focused, energized, hungry.&amp;nbsp; Julian Jamison, all-around great guy and critical element of my 2014 success was there with his beautiful family&amp;nbsp;supporting John Kelly.&amp;nbsp; Heather &amp;ldquo;Anish&amp;rdquo; Anderson who quietly sets new records on epic-long trails such as the PCT and AT was back.&amp;nbsp; Niki Rehn, runner\/climber\/scrambler from Australia was in camp and beaming with excitement.&amp;nbsp; She &amp;ldquo;gets&amp;rdquo; Barkley.\n\nRhonda gave me a Braille lesson on Friday evening, thanks!\nAs I looked around at the 41 starters on Saturday morning I was proud to be toeing the&amp;nbsp;gate with such an incredible and invested group of people.\nStart Time\nIn addition to being a substantial physical challenge, Barkley is an exercise in stress management.&amp;nbsp; The unknown start-time is one of these classic elements.&amp;nbsp; When I heard a handful of people say &amp;ldquo;word on the street was that we&amp;rsquo;re not going to get much sleep tonight&amp;rdquo;(the night before the race), something inside of me suddenly felt confident that it meant the opposite.&amp;nbsp; As such, I slept far better than I had in the past.&amp;nbsp; Yes, it was intermittent, waking up periodically feeling as if I had missed the sound of the conch, but all things considered I slept pretty well.&amp;nbsp; The late start (10:42AM) worked well for me given that I was coming from two time-zones to the west.\nLoop 1 (day)\nFrom the start we had a sizeable group (myself, Gary Robbins, John Kelly, Andrew Thompson, Dominique Ecoiffier, Benoit Laval, and Adam Lint) a held solid pace up Bird Mountain, arriving at the top in just under 30 min.&amp;nbsp;&amp;nbsp;A virgin runner honed in on book 1 with surprising precision. &amp;nbsp;I was excited to follow John Kelly for his descent down to Phillips Creek per the ridge north of the steep side creek, as all prior years I had taken the ridge to the south.&amp;nbsp; John knew the route so we followed him to the &amp;ldquo;Flume of Doom&amp;rdquo;, which Frozen Ed had described the night before.\nAt the bottom of Check Mate, it was down to 6 of us as we started up the North Boundary trail en route to Jury Ridge.&amp;nbsp; John asked how confident I was in being able to find book 2, a notoriously tricky&amp;nbsp;section where the book&amp;nbsp;tucked between two rocks at a river confluence far below Jury Ridge.&amp;nbsp; I responded, &amp;ldquo;quite confident&amp;hellip;. probably 85%&amp;rdquo;, and followed up with, &amp;ldquo;&amp;hellip; and the reason I am confident is because I&amp;nbsp;spent 45 minutes thrashing around looking for this book in 2014.&amp;nbsp; In addition to eventually finding out where the book is, more importantly I&amp;nbsp;learned where the book is not.&amp;rdquo; When we started descending to book 2, I was shocked to see John take off down a ridge that didn&amp;rsquo;t look right to me, I figured he must know something I didn&amp;rsquo;t, a more direct route perhaps?&amp;nbsp; In Barkley, if often pays dividends to follow routes you are certain of, even if they are longer, so I stuck with what I knew.&amp;nbsp; When John took off, the remainder of the group followed me.&amp;nbsp; We ended up finding the book almost perfectly.&amp;nbsp; What happened to John?&amp;nbsp; (see his race report)&amp;nbsp;As I reached in between the two stones and pulled the book out I watched the faces of the three virgin runners, all had a looks of bewilderment as if it was right then they realizing how tricky it would be&amp;nbsp;to find this book on their own.&amp;nbsp; Dominique looked at me and said, &amp;ldquo;Merci! Merci!&amp;rdquo;.&amp;nbsp; It was at this moment that I realized my purpose at Barkley this year was&amp;nbsp;to be a guide.&amp;nbsp; It meant I would have a group of comrades for much of lap 1.&amp;nbsp; This would be fun!\nWe marched up Hillpocalypse being sure to climb the 4th class dirt en-route to the N. Boundary trail and mis-quoted Henry David Thoreau sign (&amp;ldquo;In wilderness is the preservation of the world&amp;rdquo;).&amp;nbsp; The next 3 books were in locations that were new to me, so it was fortuitous that we had a small team that could split up and scan terrain when necessary.&amp;nbsp; We all discussed the up-coming turn-off for the summit of Bald Knob.&amp;nbsp; AT was spot-on and we all marched directly to the top.&amp;nbsp; We quickly unearthed book 3 and made our way eastward down the steep hillside, following the boundary markers.&amp;nbsp; Back on the N. Boundary trail we purposefully and intentionally crossed directly over SOB ditch, despite the fact that the trail goes around it.&amp;nbsp; Anyone who has studied the images on Matt Mahoney&amp;rsquo;s website can envision the picture of SOB ditch, it would be a shame to miss it!&amp;nbsp; The group seemed happy to be working through the classic landmarks so efficiently.&amp;nbsp; It was as if we were taking a speed tour of the National Mall, visiting all the iconic sites.&amp;nbsp; Instead of the Lincoln Memorial, Washington Monument and the Reflecting Pool, however, we were visiting Hyrum&amp;rsquo;s Vertical Smile, SOB ditch, and the coal ponds.\nOn the climb up to Hyrum&amp;rsquo;s Day Spa we saw a family of wild pigs, and on the descent of Raw Dog ridge we ran into a large pile of black snakes, which looked like a big medusa head.&amp;nbsp; I paused and thought what this would do to my mind on lap 4 or 5 at night.&amp;nbsp; We then plunged into the fresh briars guarding the lower ridge to Raw Dog Falls.&amp;nbsp; Nasty.\nGrinding up Upper Rat Jaw.&amp;nbsp; Me, Gary, AT\nThe remainder of loop 1 went well.&amp;nbsp; Our group of four dwindled to just three on our way into camp.&amp;nbsp; Adam, our kind compatriot and man of few words, declared that he was going to take some additional time in camp and that we should go on without him.&amp;nbsp; Gary and I agreed to be back at the gate in just 10 minutes.&amp;nbsp; Upon arrival, Mindy, who became known as the Nascar pit-crew captain, had everything dialed.&amp;nbsp; She had me resupplied and ready to go in about 8 min.\nGary and I after finishing Loop 1.&amp;nbsp; Image Credit : Remy Jegard\nWalking to the gate with the one and only Billy Simpson to start Loop 2\nLoop 2 (night)\nAs Gary and I got our new bib numbers and began to leave, AT was arriving in camp.&amp;nbsp; I was hopeful that he would have a quick turn-around and come catch up to us on loop 2, I was eager to chat with him.&amp;nbsp; We left camp with a little over one hour of light left, better make use of it!&amp;nbsp; If we could make it to book 2 prior to turning on lights I would be thrilled.&amp;nbsp; We wondered when and where we would catch the first runners.&amp;nbsp; We figured it would be Rhonda and her guide Christian given how extremely difficult it must be to negotiate the course with only 8% vision.&amp;nbsp; It is hard enough with full vision; I was in awe at what she was attempting.&amp;nbsp; My mind wandered to the book When Smoke Ran Like Water, where in Donora, Pennsylvania during an acute air pollution spike so bad people couldn&amp;rsquo;t see their feet, a blind man with a walking stick guided a seeing person home.&amp;nbsp; I envisioned Rhonda zipping around the course during a thick Barkley fog guiding the rest of us.\nAs we descended towards book 2, we saw two lights and heard some hooting and hollering in the drainage near book 2.&amp;nbsp; Sure enough it was Rhonda and Christian and they were lost trying to find the book; Gary and I were happy to be of some assistance.&amp;nbsp; Gary immediately ran over to Rhonda and gave her a hug. &amp;nbsp;&amp;ldquo;Gary coming in&amp;rdquo; he said so she&amp;rsquo;d know who was approaching her.&amp;nbsp; My respect for Gary ratcheted up by the way he encouraged and applauded Rhonda and Christian.&amp;nbsp; We chatted with them briefly, indicated the general direction and off we went, knowing that they would be able to follow our headlights for a short while.\nAnother plug for Gary.&amp;nbsp; For a guy who I had essentially just met, the fact that some of our first conversations were about how much he loves his wife Linda and how fatherhood has positively changed him speaks volumes about him.&amp;nbsp; His son Reed is bound to have a remarkable life.\nWhen on the summit of Bald Knob we could see several additional lights further ahead on the course, I estimated them to be at the Garden Spot.&amp;nbsp; We forged on eager to help this next group of runners.&amp;nbsp; Sure enough, there was a gaggle of folks.&amp;nbsp; We first met Starchy who was looking for book 4.&amp;nbsp; He was only 20&amp;prime; from it when we arrived.&amp;nbsp; Several minutes ahead we ran into another group who wanted nothing more than to find the nearest quitters road, and some who wanted help getting to book 5.&amp;nbsp; We jogged the nice jeep road towards Mouth Branch.&amp;nbsp; It was a perfect night and fun to have a small group of folks with us.&amp;nbsp; The group held on&amp;nbsp;and we made it to the critical spot where I leave the first (of three) roads into Mouth Branch.&amp;nbsp; I verbally described the next section in hopes that it would simplify their getting to Bobcat Rock.&amp;nbsp; And, off we went.&amp;nbsp; Gary and I snagged the next 2 books without issue and began the descent down Stallion Mtn.\nDescending Stallion Mtn, we made our first (and biggest) navigational error.&amp;nbsp; We rolled too far off to the right (west) off the ridge and ended up on steep cliffed-out terrain.&amp;nbsp; We eventually made it down to a dirt road.&amp;nbsp; I knew that this must be the road where going right on it would&amp;nbsp;take us to Bobcat Rock and left would take us back to the prow of the ridge, where we were supposed to be.&amp;nbsp; We went left, but overshot the prow by quite a bit (over a mile), wrapping around onto the eastern side of Stallion.&amp;nbsp; A quick bearing check and wow, we were heading north-west with the hillside rolling steeply off to our right.&amp;nbsp; Gary and I stopped dead in our tracks, sat down, whipped out the maps\/compasses and decided not to move until we figured out what was going on.&amp;nbsp; While our minds were starting to get cloudy, we were able to deduce where we were.&amp;nbsp; We made the correct decision, turned around, backtracked, and found where we over-shot.&amp;nbsp; We worked through this very well.&amp;nbsp; We were back on track after having lost ~45 min.\nWhile a huge part of Barkley is working tirelessly to prevent yourself from getting lost, one of the most important skills is figuring out how to get back on-track when you get lost.&amp;nbsp; Gary&amp;rsquo;s adventure racing experience was apparent as he rolled smoothly through the mishap and even appeared excited about how well we dealt with it, I know I was.&amp;nbsp; Again, my admiration for him ratcheted up another notch.\nThe remainder of lap 2 is a blur to me aside from some significant knee pain setting in on the descents.&amp;nbsp; A tight IT band, along with some hip alignment issues from months prior, resulted in an over-worked medial quad.&amp;nbsp; This additional stress eventually caused highly localized pain where the quad attaches to my femur. Extrapolating this increase in pain from just two laps did not look good, I could only hope the pain curve wasn&amp;rsquo;t linear or worse.&amp;nbsp; I would have to switch into near-term thinking mode, one objective, one hill, one descent at a time, not how I normally approach Barkley.&amp;nbsp; Soon we were back in camp and had decided on a 15 minute turn-around time.\nLoop 3 (CCW; day)\nThe first counter-clockwise loop is in a way exciting as it feels different and new.&amp;nbsp; We marched up to Chimney Top at a strong pace, riding adrenaline from our brief time in camp.&amp;nbsp; Roughly 1\/3 the way up the climb we crossed paths with John Kelly, exchanging few words.&amp;nbsp; He was moving great and we were excited to see that he had recovered some time from whatever mishap he had had on loop 1.\nThe descent was painful, a theme that would exist from here to the end of the race.&amp;nbsp; On the descent, we veered too far to the right (west).&amp;nbsp; We spotted a suspi",
                "fallback": "Jared Campbell&amp;#039;s Blog Link: Barkley 2016 – Act 4 (the&nbsp;Guide)",
                "from_url": "https:\/\/door5.com\/2016\/04\/16\/barkley-2016-act-4-the-guide\/#more-2302",
                "id": 1
            }
        ],
        "ts": "1461003838.000011"
    },
    {
        "type": "message",
        "user": "U0HUKRME0",
        "text": "Wow—Teddy Keizer was a winner in 2003",
        "ts": "1461008351.000013"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Friend of Uncorked (Pete Bromka, who spoke here once) finished Boston 30th overall, 10th American",
        "ts": "1461027544.000014"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "2:29",
        "ts": "1461027557.000015"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "good lord",
        "ts": "1461027558.000016"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "woah",
        "ts": "1461028305.000017"
    }
]