[
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "so this is from some research we did for our Cannes panel, the bit about connecting the unconnected; responder is the head of our Brazil office.",
        "ts": "1438645635.000002"
    },
    {
        "type": "message",
        "subtype": "file_share",
        "text": "<@U07KCCF0V|nick> shared a file: <https:\/\/uncorked.slack.com\/files\/nick\/F08HLUFSA\/unconnected_ideas|Unconnected ideas>",
        "file": {
            "id": "F08HLUFSA",
            "created": 1438645709,
            "timestamp": 1501033317,
            "name": "Unconnected_ideas",
            "title": "Unconnected ideas",
            "mimetype": "text\/plain",
            "filetype": "space",
            "pretty_type": "Post",
            "user": "U07KCCF0V",
            "editable": true,
            "size": 5394,
            "mode": "space",
            "is_external": false,
            "external_type": "",
            "is_public": true,
            "public_url_shared": false,
            "display_as_bot": false,
            "username": "",
            "url_private": "https:\/\/files.slack.com\/files-pri\/T0260V1BR-F08HLUFSA\/unconnected_ideas?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "url_private_download": "https:\/\/files.slack.com\/files-pri\/T0260V1BR-F08HLUFSA\/download\/unconnected_ideas?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "permalink": "https:\/\/uncorked.slack.com\/files\/nick\/F08HLUFSA\/unconnected_ideas",
            "permalink_public": "https:\/\/slack-files.com\/T0260V1BR-F08HLUFSA-307f8be597",
            "preview": "<document><p><b>Designing for the disconnected\/unconnected 4.3 billion people in the world are still not connected to the world’s greatest enabling technology – the internet. Smartphone and mobile internet proliferation is leapfrogging many such ‘unconnected’ into the digital age. But there remains something amiss: the newly connected are experiencing the internet for the first time, hence lacking the ‘mental model’ (i.e. intuition of how something works based on past experiences, knowledge, common sense) of why and how to use basic digital services. How are we going to design digital experiences for these people?<\/b><\/p><p>the thing about the mental model is not a 100% true. Sure they lack previous experiences with “the internet” but they have had many other experiences with other “interactive” things (lets say a magazine that they need to turn the pages, or a TV to change channels, volume, color, etc, a stereo, voice control with their kids haha, among millions of others). And this surely shapes their mental models. I’m saying this because one thing that is FUNDAMENTAL on designing for the unconnected is to understand their other experiences, how they are already familiar or not with other interactive experiences. and this will vary among difference cultures, age groups, professions, etc. maybe we could put this as “understand their context”. Because is not only about their current familiarity with technology but is also their environment, their devices, the quality of internet they will be able to access, etc. &quot;The challenge is to design the appropriate touchpoints, services, and supporting ecosystem with an appreciation for the existing infrastructure and its inherent constraints.<\/p><p>So, after understanding their context, co-create. This is not about internet, but it is a brilliant example on how to design for these communities.  &quot;Following a human-centered innovation process, the team directly involved CHWs in the design of new tools and solutions aimed at improving the quality of service they provide to their communities.” <a href=\"http:\/\/www.frogdesign.com\/work\/backpack-plus-toolkit.html\">http:\/\/www.frogdesign.com\/work\/backpack-plus-toolkit.html<\/a><\/p><p>There is a lot of fear. These groups are very often afraid to do something wrong, to get lost, to spend money without knowing, to break their devices.. So whenever possible, put a human being at a button distance. Lots of brands, mainly in the online retails business, are creating virtual assistants to guide people trough the process. Not ideal yet because they are still very much robotised and inflexible… but you got my point =) people want to be able to talk with someone, to check if they are doing things right.<\/p><p>Start with something that will effectively make a difference in their lives. To make them actually seeing a reason to use the internet, proof your point. In Brazil it is all about social connections.. People want to use the internet to see their friends pictures, to share their own, to talk, etc. in other countries or regions it can be a way to get medical assistance whre there is no doctors… a way to buy things where there are no stores..<\/p><\/document>",
            "updated": "1438645709",
            "editor": "U07KCCF0V",
            "last_editor": "U07KCCF0V",
            "state": "locked",
            "channels": [
                "C07HKDVNH"
            ],
            "groups": [],
            "ims": [],
            "comments_count": 0
        },
        "user": "U07KCCF0V",
        "upload": false,
        "display_as_bot": false,
        "username": "nick",
        "bot_id": null,
        "ts": "1438645716.000003"
    },
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "<http:\/\/wearablesforgood.com\/WearablesForGood-UseCaseHandbook.pdf>",
        "ts": "1438645758.000004"
    },
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "an old Wired feature on \"frugal innovation\" <http:\/\/www.wired.co.uk\/magazine\/archive\/2013\/05\/features\/frugal-innovation>",
        "attachments": [
            {
                "service_name": "Wired UK",
                "title": "Frugal innovation: adapting local tech where top-of-the-range is out of reach (Wired UK)",
                "title_link": "http:\/\/www.wired.co.uk\/magazine\/archive\/2013\/05\/features\/frugal-innovation",
                "text": "A rapidly growing movement is creatively adapting local tech where top-of-the-range is out of reach",
                "fallback": "Wired UK: Frugal innovation: adapting local tech where top-of-the-range is out of reach (Wired UK)",
                "from_url": "http:\/\/www.wired.co.uk\/magazine\/archive\/2013\/05\/features\/frugal-innovation",
                "id": 1
            }
        ],
        "ts": "1438645800.000005"
    },
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "another thing, if you can get over the motion-sickness effect of Prezi, to show where Cuba's neighbors are in terms of urban planning: <https:\/\/prezi.com\/5_mato0vfzmw\/experiences-in-urbanization-latin-america-and-the-caribbean-2015\/>",
        "ts": "1438647298.000007",
        "reactions": [
            {
                "name": "sickymouse",
                "users": [
                    "U02918BKW",
                    "U026NB2U2"
                ],
                "count": 2
            }
        ]
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "My friend Mike says Aspen is legit. Along the lines of a Davos  or Council on Foreign Relations. ",
        "ts": "1438661427.000002"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Biggest criticism is that they're  elitist. ",
        "edited": {
            "user": "U026NB2U2",
            "ts": "1438661767.000000"
        },
        "ts": "1438661446.000003"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "But they're very well respected and incredibly connected. ",
        "ts": "1438661471.000004"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "They also have solid academic support. ",
        "ts": "1438661490.000005"
    }
]