[
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "<http:\/\/time.com\/4266772\/barack-obama-raul-castro-press-conference-transcript\/>",
        "attachments": [
            {
                "service_name": "TIME",
                "service_url": "http:\/\/time.com",
                "title": "Read a Transcript of Obama’s Press Conference in Havana",
                "title_link": "http:\/\/time.com\/4266772\/barack-obama-raul-castro-press-conference-transcript\/",
                "author_name": "Ryan Teague Beckwith",
                "author_link": "https:\/\/time.com\/author\/ryantbeckwith\/",
                "thumb_url": "https:\/\/i0.wp.com\/timedotcom.files.wordpress.com\/2016\/03\/516833986.jpg?fit=200%2C150&quality=75&strip=color&ssl=1",
                "thumb_width": 200,
                "thumb_height": 133,
                "text": "President Obama met with Cuban President Raúl Castro in Havana, Cuba, Monday, where the two held a joint press conference.\nHere is a transcript of the full event.\nCASTRO (THROUGH TRANSLATOR): Mr. President Barack Obama, we are pleased to welcome you on this, the first visit of a president of the United States of America to our country in 88 years.\nWe have observed that in the 15 months that have passed since the decision was made to establish our diplomatic relations, we have obtained concrete results. We were able to resume direct postal exchanges and we signed an agreement to resume commercial flights.\nCASTRO (THROUGH TRANSLATOR): We have signed two memorandums of understanding on the protection of the environment and maritime areas, and another one to secure the safety of sea navigation. Today, another one will be signed on cooperation of the area of agriculture. At the moment, another set of bilateral instruments are being negotiated to cooperate in such areas as counter narcotics, the safety of commerce, and travelers and health. About this last issue, we have agreed to deepen our cooperation in the prevention and treatment of transmissible diseases, such as Zika, and non-transmissible chronic diseases, cancer included.\nThis cooperation is beneficial not only for Cuba and the United States, but also for our hemisphere at large. Following the decisions made by President Obama to modify the application of some aspects of the blockade, Cuban enterprises and their American counterparts are working to identify possible commercial operations that could materialize in the still restrictive framework of existing regulations.\nThe fact is that some have already materialized, especially in the area of telecommunications — an area in which our country already has a program designed on the basis of its priorities and the necessary technological sovereignty, one that can secure the appropriate (ph) views and the service of national interests.\nProgress has also been made toward the acquisition of medicines, medical materiel and equipment for power generation and environmental protection, these among others. Much more could be done if the blockade were lifted.\nWe recognize the position of President Obama and his administration against the blockade, and his repeated appeals to Congress to have it removed. The most recent measures adopted by his administration are positive but insufficient. I had the opportunity to discuss with the president other steps that we think could be taken in order to remove restrictions that remain in force, and make a significant contribution to the debunking of the blockade.\nThis is essential, because the blockade remains in force and because it contains discouraging elements and intimidating effects and extra-territorial outreach.\nI put forward to the president some examples on this, showing their negative consequences for both Cuba and other countries. The blockade stands as the most important obstacle to our economic development and the wellbeing of the Cuba people. That’s why its removal will be of the essence to normalize bilateral relations. And actually, it will also bring benefits to the Cuban emigrants who wish the best for their families and their country.\nIn order to move forward towards normalization, it will also be necessary to return the territory illegally occupied by Guantanamo Naval Base. Since they stand as the two main obstacles, these issues were again dealt with in the editorial ran on March 9 by the official newspaper of the Communist Party of Cuba.\nCASTRO (THROUGH TRANSLATOR): And again, only four days ago, in the press conference offered by our Foreign Minister Bruno Rodriguez, those pieces extensively reported by the media.\nOther policies should also be abolished for normal relations to develop between the United States and Cuba. No one should intend to have the Cuban people renounce the destiny it chose in freedom and sovereignty, the same for which you have made enormous sacrifices.\nWe also discussed international issues, particularly those that could have an impact on regional peace and stability. We had thought to discuss other issues, but we did not have enough time. I had planned to raise our concern over the destabilization some are trying to promote in Venezuela, something which we consider to be counterproductive to the overall situation in the continent. I did not have the chance to raise with him, I’m raising it here.\nLikewise, we talked about the ongoing peace process in Colombia and the effort to put an end to that conflict. There are profound differences between our countries that will not go away. Since we hold different concepts on many subjects such as political systems, democracy, the exercise of human rights, social justice, international relations and world peace and stability.\nWe defend human rights. In our view, civil, political, economic, social and cultural rights are indivisible, interdependent and universal. Actually, we find it inconceivable that a government does not defend and insure the right to health care, education, Social Security with provision and development, equal pay and the rights of children. We oppose political manipulation and double standards in the approach to human rights.\nCuba has much to say and show on this issue. That is why I have reiterated to the president our willingness to continue moving forward with the dialogue on this matter that was already initiated.\nOn December 17th, 2014, as we announced the decision to re- establish diplomatic relations, I said that we should learn the art of co-existing with our difference in a civilized manner. In my remarks to Parliament on July 15, 2015, I said changing everything that needs to be changed is the sovereign and exclusive concern of Cubans. The revolutionary government is willing to advance to a normalization of relations, for it is convinced that both countries can co-exist and cooperate in a civilized manner and for the mutual benefit regardless of existing and future differences and thus contribute to peace, security, stability, development and equity in our continent and around the world.\nCASTRO (THROUGH TRANSLATOR): Today, I reaffirm that we should exercise the art of civilized co-existence, which involves accepting and respecting differences and preventing these from becoming the center of our relationship.\nWe should instead promote links that can benefit both our countries and peoples while focusing on those things that bring us closer and not on those that pull us apart. We agree that a long and complex path still lies ahead. But what is most important is that we have started taking the first steps to build a new type of relationship, one that has never existed between Cuba and the United States.\nActually, destroying a bridge can be an easy and quick undertaking. However, its solid reconstruction can prove a lengthy and challenging endeavor. After four failed attempts and giving proof of the will and perseverance, on September 2, 2013, American swimmer Diane Nyad managed to cross the Florida Strait swimming without an anti-shark cage to protect her.\nTo that exploit of conquering the geographical differences between our two countries. It was for that exploit that on August 30th, 2013, as the national anthems of Cuba and the United States were played she was presented with the Order of Sport Merit, a declaration awarded by the State Counsel. Such feat carries a powerful message.\nOne that should serve as an example to honor bilateral relations. For it confirms that if she could do it, then we can do it too. President Obama, I reiterate our appreciation for his visit and the willingness of the government of Cuba to continue moving forward in the well being of our countries. Thank you very much.\nOBAMA: Buenos dias, President Castro, to you, the Cuban government and the Cuban people, thank you for the welcome they’ve extended to me, my family and to my delegation. You know, for more than half a century, the sight of a U.S. president here in Havana would have been unimaginable, but this is a new day.\nThis nuevo dia between our two countries. With your indulgence, Mr. President, I want to go just briefly off topic because during this weekend, I received news that one of our outstanding United States armed service members, Marine Staff Sergeant Louis F. Cardin of Temecula, California, was killed in northern Iraq as we assisted the Iraqi government in dealing with ISIL, the terrorist organization there. And I just wanted to give my thoughts and prayers to the family there and those who have been injured. It’s a reminder that even as we embark on this historic visit, there are U.S. armed servicemembers who are sacrificing each and every day on behalf of our freedom and our safety, so I’m grateful to them.\nMy wife Michelle and I have brought our daughters. And by the way, they don’t always want to go with us. They’re teenagers now. They have friends at home and they have things to do. But they wanted to come to Cuba because they understood and we wanted to show them the beauty of Cuba and its people.\nOBAMA: We were moved by the Cubans who received us yesterday, smiling and waving as we drove in from the airport. We were grateful for the opportunity to experience Old Havana and some excellent Cuban food. Our visit to the cathedral was a reminder of the values that we share and the deep faith that sustains so many Cubans and Americans, and it also gave me an opportunity to express my gratitude to Cardinal Ortega who, along with His Holiness Pope Francis, did so much to support the improved relations between our governments.\nThis morning, I was honored to pay tribute to Jose Marti, not only his role in Cuban independence, but the profound words that he wrote and spoke in support of liberty and freedom everywhere.\nI bring with me the greetings and the friendship of the American people. In fact, I’m joined on this trip by nearly 40 members of Congress, Democrats and Republicans. This is the largest such delegation of my presidency and it indicates the excitement and interest in America about the process that we’ve undertaken. These members of Congress recognize that our new relationship with the Cuban people is in the interest of both nations.\nI’m also joined by some of America’s top business leaders and entrepreneurs because we’re ready to pursue more commercial ties, which create jobs and opportunity for Cubans and Americans alike.\nAnd I’m especially pleased that I’m joined on this trip by so many Cuban-Americans. For them and for the more than two million proud Cuban-Americans across the United States, this is a moment filled with great emotion. Ever since we made it easier to travel between our countries, more Cuban-Americans are coming home. And for many, this is a time of new hope for the future.\nSo President Castro, I want to thank you for your — the courtesy and spirit of openness that you’ve shown during our talks. At our meeting in Panama last year, you said that we’re willing to discuss every issue and everything’s on the table. So with your understanding, my statement will be a little longer than usual.\nPresident Castro always jokes with me about how long Castro brother speeches can be, but I’m going to actually go a little longer than you probably today, with your indulgence. We have a half a century of work to catch up on.\nYou know, our growing engagement with Cuba is guided by one overarching goal, advancing the mutual interest of our two countries, including improving the lives of our people, both Cubans and Americans. That’s why I’m here. I’ve said consistently after more than five very difficult decades, the relationship between our governments will not be transformed overnight. We continue, as President Castro indicated, to have some very serious differences, including on democracy and human rights. And President Castro and I have had very frank and candid conversations on these subjects.\nThe United States recognizes the progress that Cuba has made as a nation, it’s enormous achievements in education and in health care. And perhaps most importantly, I affirm that Cuba’s destiny will not be decided by the United States or any other nation. Cuba is sovereign and rightly has great pride and the future of Cuba will be decided by Cubans, not by anybody else.\nAt the same time, as we do wherever we go around the world, I made it clear that the United States will continue to speak up on behalf of democracy, including the right of the Cuban people to decide their own future. We’ll speak out on behalf of universal human rights, including freedom of speech and assembly and religion. Indeed, I look forward to meeting with and hearing from Cuban civil society leaders tomorrow.\nBut as you heard, President Castro’s also addressed what he views as short comings in the United States around basic needs for people and poverty and inequality and race relations, and we welcome that constructive dialogue as well because we believe that when we share our deepest beliefs and ideas with an attitude of mutual respect that we can both learn and make the lives of our people better.\nOBAMA: A part of normalizing relationships means that we discuss these differences directly, so I’m very pleased that we’ve agreed to hold our next U.S.-Cuba human rights dialogue here in Havana this year. And both of our countries will welcome our visits by independent United Nations experts as we combat human trafficking, which we agree is a profound violation of human rights.\nEven as we discuss these differences, we share a belief we can continue to make progress in those areas that we have in common. President Castro, you said in Panama that we might disagree on something today on which we would agree tomorrow. And that has certainly been the case over the past 15 months and the days leading up to this visit.\nAnd today, I can report that we continue to move forward on many fronts when it comes to normalizing relations. We’re moving ahead with more opportunities for Americans to travel to Cuba and interact with the Cuban people.\nOver past year, the number of Americans coming here has surged. Last week, we gave approval for individual Americans to come here for educational travel. U.S. airlines will begin direct commercial flights this year. With last week’s port security announcement, we’ve removed the last major hurdle to resuming cruises and ferry service — all of which will mean even more Americans visiting Cuba in the years ahead and appreciating the incredible history and culture of the Cuban people.\nWe’re moving ahead with more trade. With only 90 miles between us, we’re natural trading partners. Other steps we took last week, allowing the U.S. dollar to be used more widely with Cuba, giving Cubans more access to the dollar in international transactions and allowing Cubans in the U.S. to earn salaries.\nThese things will do more to create opportunities for trade and joint ventures. We welcome Cuba’s important announcement that it plans to end the 10 percent penalty on dollar conversions here, which will open the door to more travel and more commerce. And these steps show that we’re opening up to one another.\nWith this visit, we’ve agreed to deepen our cooperation on agriculture to support our farmers and our ranchers. This afternoon, I’ll highlight some of the new commercial deals being announced by major U.S. companies. And just as I continue to call on Congress to lift the trade embargo, I discussed with President Castro the steps we urge Cuba to take to show that it is ready to do more business, which includes allowing more joint ventures and allowing foreign companies to hire Cubans directly.\nWe’re moving ahead with our efforts to help connect more Cubans to the Internet and the global economy. Under President Castro, Cuba has set a goal of bringing Cubans online, and we want to help.\nAt this afternoon’s entrepreneurship event, I’ll discuss additional steps we’re taking to help mor",
                "fallback": "TIME Link: Read a Transcript of Obama&#8217;s Press Conference in Havana",
                "from_url": "http:\/\/time.com\/4266772\/barack-obama-raul-castro-press-conference-transcript\/",
                "id": 1
            }
        ],
        "ts": "1458595400.000016"
    }
]