[
    {
        "type": "message",
        "user": "U167FL70V",
        "text": "i’m contemplating bringing my pup bella into the office tomorrow for a trial run. is there anything i should do beforehand? she’s super sweet and well behaved and only barks at the things she should bark at like burglars",
        "ts": "1463007131.000012"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "not any more. mainly we want civilized behavior out of dogs and accountability for dog behaviors from owners. within the dogs crew, we should help each other out.",
        "ts": "1463007206.000013"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "if its your first time to dog club, you will wipe up a mess",
        "ts": "1463007233.000014"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": ":wink:",
        "ts": "1463007237.000015"
    },
    {
        "type": "message",
        "user": "U167FL70V",
        "text": "she is quite civilized, in dog terms anyways",
        "ts": "1463007238.000016"
    },
    {
        "type": "message",
        "user": "U167FL70V",
        "text": "haha ok, as a dog owner i’m well acquainted with cleaning up gross things",
        "ts": "1463007269.000017"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "what in the heavens IS this thing?!",
        "ts": "1463007280.000018"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "There is an unspoken rule that you must bring your dog by to either Melissa or I as members of the new dog welcoming posse. Since she is living it up in Peru I will take on the responsibility for her.",
        "ts": "1463007371.000019"
    },
    {
        "type": "message",
        "user": "U167FL70V",
        "text": "i would be more than happy to bring her by. she is usually shy at first, but after a few pets all she wants is belly rubs forever",
        "ts": "1463007438.000020"
    },
    {
        "type": "message",
        "user": "U167FL70V",
        "text": "also she will likely have to sniff every inch of the office",
        "ts": "1463007466.000021"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "i will break down her barriers in no time at all. they don’t call me the dog whisperer for nothing",
        "ts": "1463007514.000022"
    },
    {
        "type": "message",
        "user": "U13GPDA1F",
        "text": "yay! new doggie!",
        "ts": "1463007631.000023"
    }
]