[
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Hey Joshua, the footer is looking and working great. Really like how it turned out. Nice job!",
        "ts": "1440523474.000002"
    },
    {
        "type": "message",
        "user": "U02HAJ6JF",
        "text": "Dude. Those were some good ideas. I feel like it could use a little polish, but its most of the way there!",
        "ts": "1440523535.000003"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "just a little, i’m glad our ideas workd.",
        "ts": "1440523556.000004"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Matt, just FYI, it took the first stab at a simple fade in functionality. Let me know what you think.",
        "ts": "1440530812.000005"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Gaston. That’s awesome. Funny, it probably means we’ll never see the spinner GIF, but oh well….",
        "ts": "1440532277.000006"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Probably a good thing. :wink:",
        "ts": "1440532296.000007"
    },
    {
        "type": "message",
        "user": "U02HAJ6JF",
        "text": "Super nice Gaston!",
        "ts": "1440535082.000008"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Cool.",
        "ts": "1440535933.000009"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Hey Gaston, I’ve uploaded some fadeIn spec and the PSD for scale &amp; color! Let me know if you want anything else, svg or otherwise.",
        "ts": "1440542364.000010"
    },
    {
        "type": "message",
        "user": "U04JZANJF",
        "text": "hey all - wanted to update you after yesterday’s call. \n\nfirst off, emma is thrilled with the design of the cms. she said it’s very intuitive and well designed. they’re very pleased. well done!\n\nit sounds like they have a lot of copyediting they need to do on this and other projects this week. emma was slightly nervous that they would not be able to meet the deadline for launch on 8\/26. that being said, i’m hoping all development will still be done by EOD tomorrow. please let me know if that will be a problem. ideally, we’ll wrap tomorrow and hold on launch until they’re ready. \n\nfinally, emma had a few questions after our call. here they are: \n\n- for the video slides, i am wondering if there is ability for video to turn off or pause when viewer advances to the next slide?\n- did we discuss a way to have a project coming soon? in the case of this upcoming cohort of grantees is there a way to list their project titles, their names and bios along with a press image on the map. such that we would add a slideshow when their work is completed?  \n\n*i believe we discussed this and advised that they add new projects with a single text only slide that says the project is coming soon. does that sound right?*",
        "ts": "1440543497.000011"
    },
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "that sounds right to me",
        "ts": "1440543757.000012"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Just catching up, <@U04JZANJF>. When you say dev complete by EOD tomorrow do you mean desktop, or also mobile?",
        "ts": "1440543979.000013"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "We haven’t done much crossbrowser testing yet because we were waiting for functional QA to kick in.",
        "edited": {
            "user": "U02618EV1",
            "ts": "1440544906.000000"
        },
        "ts": "1440544025.000014"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "hey <@U026PLK4S> - just noticing the mobile “home” icon. Feels very mystery meat to me, especially when paired with the nav icon in the upper right. Is it going to kill the design to bring back the logo? I am especially concerned about folks accessing these projects through social that won’t ever see the homepage. Those two upper icons are pretty unclear when paired.",
        "ts": "1440545438.000016"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Interesting. I hear your point, not sure I agree that it’s a huge problem. Happy to look again.",
        "ts": "1440545695.000017"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "I also want the program to be represented at the top of every page, and personally am not sure I understand the aesthetic payoff of having an icon over the logo, considering the UX implications.",
        "ts": "1440546011.000018"
    },
    {
        "type": "message",
        "user": "U02HAJ6JF",
        "text": "yo matt + gaston: want to put a mobile jam on the books?",
        "ts": "1440546070.000019"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "though the preloader is nice and addresses my concern partly",
        "ts": "1440546191.000020"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "perhaps a clearer “home” icon would be the ticket if we’re really against the logo?",
        "ts": "1440546318.000021"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "even though i hate that idea",
        "ts": "1440546342.000022"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Happy to look again, but my concern is about density and scale.",
        "ts": "1440546375.000023"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "as an outsider looking at this with fresh eyes, I tend to agree with Melissa here in regards to clarity. I don’t think it needs to be logo necessarily (though it could be) but something more directed",
        "ts": "1440546394.000024"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "also, dev is supposed to stop down tomorrow. not sure if this is the best use of time",
        "ts": "1440546401.000025"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "i’d rather have the devs spend a couple hours on it now and not potentially confuse users to the site for months to come.",
        "ts": "1440546448.000026"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Happy to look again.",
        "ts": "1440546512.000027"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "and my bad for missing that on the original comp. I would have called it out much earlier.",
        "ts": "1440546624.000028"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Sure, and i’m happy to re-visit some of this, but the initial choice was a deliberate one. It’s minimal, it’s connected to the rest of the UI, it’s small and legible. Personally, I don’t think the UX problem you’ve outlined is worth abandoning that aesthetic reasoning. That’s my point of view. I’m also taking in to consideration that from the project page, the NAV and the HOME page aren’t really that different. We can try the wordmark again, but I’d recommend that we stay away from a “home” icon that doesn’t fit with the tone of the rest of the site.",
        "ts": "1440546968.000029"
    },
    {
        "type": "message",
        "user": "U04JZANJF",
        "text": "<!channel> thanks for airing your concerns over tomorrow being the launch date. sounds like we’ve got some more stuff to do on mobile and we’d like to dig into more functional QA. here’s the plan: we’ll wrap up mobile tomorrow and use the remainder of the week to button up any functional and visual QA items by EOD friday - let’s do whatever it takes to meet this deadline.  i’ll be doing testing and prioritizing bugs in jira. if you have any questions about priority before diving in on something or thoughts about the deadline *please* feel free to hit me up.",
        "ts": "1440547284.000030"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Thanks Amanda! This sounds great.",
        "ts": "1440547333.000031"
    },
    {
        "type": "message",
        "user": "U02HAJ6JF",
        "text": "Sounds good!",
        "ts": "1440547374.000032"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Just catching up. Sounds great. Thanks Amanda.",
        "ts": "1440549295.000033"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Just seeing all this. Sounds good on dev side. Mobile icon: I'm in agreement with justin that there may be a way to offer clarity outside just the logo. Is there a solution that hits both aesthetics and clarity. Let's see if we can push towards defining one",
        "ts": "1440549789.000034"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "I just gave the mobile carousel a couple of hours and it looks way better. Still WIP but I hope this helps with some of the concerns we had earlier.",
        "ts": "1440558462.000035"
    }
]