[
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Team, just a gentle FYI that I'm going to have to refactor a big chunk of the frontend code. So, if you need anything, I’ll probably be heads down doing that as fast as I can. Let me know if you have any questions.",
        "ts": "1438187756.000002"
    },
    {
        "type": "message",
        "user": "U02HAJ6JF",
        "text": "cool. let me know what i can do. thanks gaston!",
        "ts": "1438188633.000003"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Will do. Thanks",
        "ts": "1438188839.000004"
    },
    {
        "type": "message",
        "user": "U04JZANJF",
        "text": "<!channel> - answers from magnum on the last round of questions i sent \n\n *Could you send us the translated titles for each project?*\n\nWorking on this, should have for you shortly. \n\n*- You mentioned on a call not so long ago that you (or AFAC) had an Arabic font you preferred to use. Could you give us the name of this font? Do you have a license for it?* \n\nWorking on this too, should have this shortly. \n\n*- Could you tell us which images should be used as the press image for each project?*\n\nHere’s a link to a Dropbox folder with images: <https:\/\/www.dropbox.com\/sh\/drvz7p5j7s4reu5\/AABEeWi_E2bXXRT24kIjWw75a?dl=0> \n\nThese are for the 2015 projects. We do not have these yet for the 2016 projects. \n\n*- Do you have a press image for the homepage?* \n\nWe’re not exactly sure what you mean by this, can you please clarify. \n\n*- Could you send us the 'About the ADPP' copy for the footer?* \n\nFor now you can use this text. We will have updated text for you in the future:\n\nArab Documentary Photography Project (ADPP) is an initiative that provides support and mentorship to photographers from across the Arab region. The Arab Fund for Arts and Culture in partnership with Magnum Foundation and the Prince Claus Fund established the ADPP to stimulate compelling work by Arab Photographers working across a range of experimental styles of storytelling.",
        "attachments": [
            {
                "service_name": "Dropbox",
                "title": "- Press Photos",
                "title_link": "https:\/\/www.dropbox.com\/sh\/drvz7p5j7s4reu5\/AABEeWi_E2bXXRT24kIjWw75a?dl=0",
                "text": "Shared with Dropbox",
                "fallback": "Dropbox: - Press Photos",
                "thumb_url": "https:\/\/cf.dropboxstatic.com\/static\/images\/icons128\/folder_dropbox.png",
                "from_url": "https:\/\/www.dropbox.com\/sh\/drvz7p5j7s4reu5\/AABEeWi_E2bXXRT24kIjWw75a?dl=0",
                "thumb_width": 128,
                "thumb_height": 128,
                "id": 1
            }
        ],
        "edited": {
            "user": "U04JZANJF",
            "ts": "1438208349.000000"
        },
        "ts": "1438208309.000005"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Thanks <@U04JZANJF>!",
        "ts": "1438208529.000008"
    }
]