[
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "<https:\/\/wharferj.wordpress.com\/2012\/05\/25\/ron-cobbs-alien-semiotic-standards\/>",
        "attachments": [
            {
                "service_name": "Joe Blogs",
                "service_url": "http:\/\/wharferj.wordpress.com",
                "title": "Ron Cobb’s Semiotic Standards for Alien…",
                "title_link": "https:\/\/wharferj.wordpress.com\/2012\/05\/25\/ron-cobbs-alien-semiotic-standards\/",
                "author_name": "Joe Blogs",
                "author_link": "https:\/\/wharferj.wordpress.com\/author\/wharferj\/",
                "thumb_url": "https:\/\/i2.wp.com\/wharferj.files.wordpress.com\/2012\/05\/alien_semiotic_standard_icons_by_scotch_and_soda-d351v1c.jpg?fit=200%2C150",
                "thumb_width": 154,
                "thumb_height": 150,
                "text": "With the new Alien film Prometheus coming up in the next few weeks, I watched the first film again recently to remind myself of the story and came across these forgotten gems, referred to on one of the extras spread across the rather excellent fluorescent green, nine dvd box set&amp;hellip;\nIt is a series of signs designed by the graphic artist Ron Cobb (although this sheet is a digitised version based on his hand drawn originals). Ron Cobb was the man responsible for imagining and designing all the human technology in the first and second Alien films. HR Giger of course was famously responsible for the monster itself, and Ridley Scott apparently kept the two men apart so that their particular visions would not become compromised or tainted by the others ideas&amp;hellip;\nThese signs were intended for &amp;ldquo;all commercial trans-stellar and heavy element transport craft&amp;rdquo; and are wonderful examples of graphic design. Conceived when the film was in pre-production sometime during the mid\/ late 1970&amp;rsquo;s, they have a graphic simplicity and an almost contemporary feel that would not look out of place in todays CGI-tastic adventures.\nIn fact thinking about it (and yes I know it&amp;rsquo;s not heavily CGI&amp;rsquo;d) one of my most favourite recent Sci Fi films, Duncan Jones&amp;rsquo;s low-key and very stylish directorial debut Moon from a few years back has similar looking graphics, creating a retro feel that undoubtedly references back to the 1970&amp;rsquo;s and Ron Cobb&amp;rsquo;s designs (although confusingly of course, both these films are set many years in the future, so explain that one away..)\n\nAnyway, next time you watch Alien, keep an eye out for Ron&amp;rsquo;s brilliant little graphics. They are clearly there to see all over the Nostromo; above doorways, arranged in groups around control panels, sometimes glimpsed in the distance through the steam and the panic, looking for all the world as if they&amp;rsquo;d been there forever&amp;hellip; which should mean they should also be evident on the new ship Prometheus? (fingers crossed)\nRon Cobb worked on many classic films during his career, including Star Wars, Total Recall and Back to the Future (I believe the time travelling DeLorean was basically his idea) but I&amp;rsquo;ll leave you with some fine sketches that he did for interiors of the Nostromo and the original felt tip pen artwork for the crew patches and the signage&amp;hellip;",
                "fallback": "Joe Blogs Link: Ron Cobb&#8217;s Semiotic Standards for&nbsp;Alien&#8230;",
                "from_url": "https:\/\/wharferj.wordpress.com\/2012\/05\/25\/ron-cobbs-alien-semiotic-standards\/",
                "service_icon": "https:\/\/s0.wp.com\/i\/webclip.png",
                "id": 1
            }
        ],
        "ts": "1467088889.000009"
    }
]