[
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "SEMIO DAILY: <https:\/\/en.wikipedia.org\/wiki\/Sisu>",
        "attachments": [
            {
                "title": "Sisu",
                "title_link": "https:\/\/en.wikipedia.org\/wiki\/Sisu",
                "author_name": "Wikipedia",
                "author_link": "http:\/\/en.wikipedia.org\/",
                "text": "Sisu is a Finnish concept and cultural construct that is described through a combination of various English terms including stoic determination, grit, bravery, resilience, and hardiness and is held by Finns themselves to express their national character. It is generally considered to not have a literal equivalent in English.\nSisu is a grim, gritty, white-knuckle form of courage that is typically presented in situations where success is against the odds. It expresses itself in taking action against the odds and displaying courage and resoluteness in the face of adversity, in other words, deciding on a course of action and then sticking to that decision even despite repeated failures. It is in some ways similar to equanimity, with the addition of a grim kind of stress management.\n\"To have guts\" is a fairly close translation that uses the same metaphor (found in more languages than Finnish and English), as the word derives from sisus, which means \"interior\" and \"entrails, guts\". A concept closely related to sisu is grit, which shares some of its denoting elements with sisu, save for \"stress management\" and passion for a long-term goal. Sisu may have an element of passion but it is not always present, unlike in the case of grit as defined by Dr. Angela Duckworth.",
                "fallback": "wikipedia: Sisu",
                "service_icon": "https:\/\/fst.slack-edge.com\/bfaba\/img\/unfurl_icons\/wikipedia.png",
                "id": 1
            }
        ],
        "ts": "1495142521.549655",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U13GPDA1F"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "oooooooh",
        "ts": "1495142552.561277"
    }
]