[
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "SEMIO DAILY: \nSimplicity\n\n\"I would have made this shorter if I had more time\"\n— Pascal\n\nA function of simplicity, good storytelling in the corporate world has become increasingly important to the markets. What do The Four (Amazon, Apple, Facebook, and Google) have in common? Simple, compelling stories, strategies, brands, and business models. Some questions your firm must be able to answer:\n\n— what the firm does — one sentence max\n— firm's values — three words max\n— brands — one max\nOf the 13 firms that have outperformed the S&amp;P 500 five years in a row, none are multi-brand conglomerates. The dogma of the brand era has cemented the incorrect notion that every brand has value. No, they don't ... and hundreds of brands will go away. Every brand is another mouth to feed (advertising, brand management, design, and culture). An absence of family planning by households or corporations results in poverty. Seemingly iconic brands and brands born in the digital age are not immune. Tumblr, Etsy, Gilt, Fitbit, Pandora, The Buffalo Bills, Sprint, Cinemax, Hulu, Snapchat, A&amp;E, PBS, and <http:\/\/Jet.com|Jet.com> will join Saab and Pontiac — brands people assumed had substantial equity ... but don't. I believe, over time, even strong brands like YouTube and Instagram will become extensions — Google Tube, Facebook Images, as one brand \/ culture \/ message has less friction in the race to a trillion.\n\nThis will happen in B2B as well. WPP just announced Wunderman is merging with Possible. Why? Because these firms, who exist to help other firms differentiate from one another, are themselves exactly the same. What separates TBWA, BBH, JWT, MDC, BBDO, DDB, FCB, GSD&amp;M, and R\/GA? An address. Agency holding companies bought EBITDA and relationships with each firm and avoided client conflicts with different brands. The relationships have been replaced by algorithms and scale (need to cut costs), so firms pretending to be different (most of them) within holding companies will become product extensions of the few differentiated brands in the portfolio.\n\nClient relationships, similar to brands, still matter ... just less. Your client likes you, but would rather see the value of her stock options increase than hang, eat, or play golf with you. Sport outings, expensive dinners, and swag out your firm as undifferentiated. Very few people at The Four golf or take others golfing. Why? They have the economic success, and differentiated offerings, that afford them weekends with people they like more than you — friends and family. If people are constantly taking you to the latest Broadway show, golfing, or on \"recognition\" weekends, you're in an industry in decline. Facebook, McKinsey, and Tesla don't have \"gold circle\" weekends in Puerto Vallarta.\n\nEvery board director and employee should ask of her CEO \/ employer: how fast, and how simple?",
        "ts": "1499464639.296217"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "abby: also, it seems like there’s an end of day recap for the studio that should be on the books",
        "thread_ts": "1499381179.010864",
        "parent_user_id": "U026103R3",
        "ts": "1499469512.451506"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "ah cool thanks",
        "thread_ts": "1499381179.010864",
        "parent_user_id": "U026103R3",
        "ts": "1499469588.466290"
    }
]