[
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "SEMIO DAILY: Chesterton's Fence <https:\/\/en.wikipedia.org\/wiki\/Wikipedia:Chesterton%27s_fence>",
        "attachments": [
            {
                "image_url": "https:\/\/upload.wikimedia.org\/wikipedia\/commons\/4\/48\/Blocked_road_-_geograph.org.uk_-_1024571.jpg",
                "image_width": 640,
                "image_height": 480,
                "image_bytes": 185237,
                "title": "Wikipedia:Chesterton's fence",
                "title_link": "https:\/\/en.wikipedia.org\/wiki\/Wikipedia:Chesterton%27s_fence",
                "author_name": "Wikipedia",
                "author_link": "http:\/\/en.wikipedia.org\/",
                "text": "Chesterton's fence is the principle that reforms should not be made until the reasoning behind the existing state of affairs is understood. The quotation is from G. K. Chesterton's 1929 book The Thing, in the chapter entitled \"The Drift from Domesticity\":\n\nIn the matter of reforming things, as distinct from deforming them, there is one plain and simple principle; a principle which will probably be called a paradox. There exists in such a case a certain institution or law; let us say, for the sake of simplicity, a fence or gate erected across a road. The more modern type of reformer goes gaily up to it and says, \"I don't see the use of this; let us clear it away.\" To which the more intelligent type of reformer will do well to answer: \"If you don't see the use of it, I certainly won't let you clear it away. Go away and think. Then, when you can come back and tell me that you do see the use of it, I may allow you to destroy it.\"\n\nHistory is full of examples of negative outcomes that resulted from the failure to understand this admonition.",
                "fallback": "wikipedia: Wikipedia:Chesterton's fence",
                "service_icon": "https:\/\/a.slack-edge.com\/bfaba\/img\/unfurl_icons\/wikipedia.png",
                "id": 1
            }
        ],
        "ts": "1498843681.647694"
    }
]