[
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "<@U02688JHZ> - where are we at with copy writing for these evansville UI updates?",
        "ts": "1431968256.000002"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "and friendly reminder that we need spanish translations for whatever the final copy ends up being.",
        "ts": "1431968280.000003"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "I guess final copy questions extend to iRate feature as well.",
        "ts": "1431968335.000004"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "<@U0289USNA>: I'll add to trello! They did decide on copy (in English) and I updated the google doc. Hoping to have spanish translations turned around quickly.",
        "ts": "1431970252.000005"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "<@U02688JHZ> <@U0261PCRQ> - making more work for myself\/kat - but I should likely guess\/assume that we need to be adding analytics to these research group features?",
        "ts": "1431972480.000006"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "Kat might need to speak up with regards to what kind of analytics she can actually perform from the settings section...",
        "ts": "1431972558.000007"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "before we commit to what can be added.",
        "ts": "1431972570.000008"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "I can add whatever to the settings",
        "ts": "1431973114.000009"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "just keep track of your checkpoints and I can mirror them <@U0289USNA>",
        "ts": "1431973133.000010"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "I want to talk to you about error states and a couple things in a little bit",
        "ts": "1431973142.000011"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "<@U02613K0X>: <@U02688JHZ> - The changes made to the vroom server for supporting research groups needs to get pushed to production sometime soon.  Jenny - given that it involves an alembic revision, we\/you should probably block some time for this so that you have time to troubleshoot incase something goes awry when updating.",
        "ts": "1431982839.000012"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "Thanks, Scott! <@U0261PCRQ> and <@U0289USNA> I'm finalizing a copy doc for vroom, and want to make sure I'm capturing any new copy\/error copy we think we need",
        "ts": "1431991318.000013"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "Kat, you already posted some of that in slack for me (from Daniel). From that list, I have: Retry Loading Vroom Groups\n    •    There was a problem loading Vroom Groups. Please try again.",
        "ts": "1431991372.000014"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "are there any other specific errors you guys can think of?",
        "ts": "1431991394.000015"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "I’m sure there’s more than what Daniel reported",
        "ts": "1431991394.000016"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "but idk what all of it is",
        "ts": "1431991398.000017"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "I could work on that first thing tomorrow if that’s alright?",
        "ts": "1431991469.000018"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "sure - my only concern is timing for getting spanish translations back",
        "ts": "1431992551.000019"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "Maybe I'll send them what I have, so they can get started, but let them know we may have additional error message content that will need to be translated",
        "ts": "1431992574.000020"
    }
]