[
    {
        "type": "message",
        "user": "U02HCCTFL",
        "text": "Futuretalk\/Happy Hour at New Relic tonight on Autism <https:\/\/www.eventbrite.com\/e\/futuretalks-pdx-with-dan-selec-special-happy-hour-tickets-14582226833?src=calagator>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "FutureTalks PDX with Dan Selec + Special Happy Hour",
                "title_link": "https:\/\/www.eventbrite.com\/e\/futuretalks-pdx-with-dan-selec-special-happy-hour-tickets-14582226833?src=calagator",
                "text": "Train. Work. Live. Using technology to provide a lifetime answer for those affected by autism Autism Spectrum Disorder affects 1 in 68 children and occurs in all racial, ethnic and socioeconomic groups. While many services and programs exist for children on the spectrum, there remains a dearth of programs that attempt to solve the lifetime needs of these individuals after age 18. nonPareil Institute provides technical training to adults on the autism spectrum, with a goal of growing them into productive members of their development teams, and building products that can compete in the marketplace (iTunes\/Google Play\/etc). Since the vast majority of the ASD population does not drive, nP has a living-campus vision so that their Crew may train, work, and live at consolidated facilities, much like the University campus environment. The difference being; nP Crew members will remain throughout their lifetime, contributing to the company that provides for their on-going training, work and living requirements. The nonPareil program has grown over the last 4 years from 9, to 150 individuals; all on the autism spectrum. With over 800+ on the waiting list, and requests to open in over 40 cities, nP is positioned for rapid growth over the years to come. nonPareil Founder and CEO Dan Selec will be speaking at this session.   › Doors will open at 5:30p for a special networking happy hour! The food and drinks are provided by Bellagios and New Relic. The presentation will begin right at 6:30p.   Dan Selec is the creative innovator behind nonPareil Institute, including the construction of the business model and all software systems, including hardware and cloud infrastructure that currently run the nonPareil training and work platforms. He has been in the technology business for over 20 years as a business owner, developer of software and a systems architect. Dan&amp;#39;s youngest son was diagnosed with autism at 18 months of age. on Twitter @npitx   › FutureTalks is brought to you by New Relic in collaboration with TAO",
                "fallback": "Eventbrite: FutureTalks PDX with Dan Selec + Special Happy Hour",
                "thumb_url": "http:\/\/cdn.evbuc.com\/images\/11709667\/81293735445\/1\/logo.png",
                "from_url": "https:\/\/www.eventbrite.com\/e\/futuretalks-pdx-with-dan-selec-special-happy-hour-tickets-14582226833?src=calagator",
                "thumb_width": 160,
                "thumb_height": 80,
                "id": 1
            }
        ],
        "ts": "1418076184.000002"
    },
    {
        "type": "message",
        "user": "U02HCCTFL",
        "text": "Winter Coder's Social happening tomorrow. Usually a great recruiting opp (ahem <@U026PHQ3J> ) <http:\/\/www.meetup.com\/pdxpython\/events\/218812225\/>",
        "attachments": [
            {
                "service_name": "Meetup",
                "title": "Portland Python User Group",
                "title_link": "http:\/\/www.meetup.com\/pdxpython\/events\/218812225\/",
                "text": "Join Portland's tech community in celebrating the end of another year. This is a fun, free annual event where members of local user groups and their families are invited to mingle, eat and play games.",
                "fallback": "Meetup: Portland Python User Group",
                "thumb_url": "http:\/\/photos3.meetupstatic.com\/photos\/event\/5\/3\/4\/3\/highres_7161315.jpeg",
                "from_url": "http:\/\/www.meetup.com\/pdxpython\/events\/218812225\/",
                "thumb_width": 86,
                "thumb_height": 80,
                "id": 1
            }
        ],
        "ts": "1418078378.000004"
    }
]