[
    {
        "type": "message",
        "user": "U02HCCTFL",
        "text": "8 tickets left for the Intel IoT hackathon this weekend: <https:\/\/www.eventbrite.com\/e\/intel-iot-hackathon-transportation-pdx-tickets-14622589559>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "Intel® IoT Hackathon: Transportation - PDX",
                "title_link": "https:\/\/www.eventbrite.com\/e\/intel-iot-hackathon-transportation-pdx-tickets-14622589559",
                "text": "You&amp;#39;re from the City of Roses and Transportation Awareness and, geez, do you have ideas about how to improve things!! Here&amp;#39;s a chance to hack solutions to your biggest transportation problems using the latest connected hardware from Intel -- the Intel® IoT Hackathon: Transportation! It has been estimated that in the next decade the world could see 1 billion more computerized devices. Be it a GPS enabled fitness tracker, or an intelligent car seat, the utility being built into products is quite useful. This Internet of Things has only just begun, but it is increasingly apparent in our everyday world. Do you have a great idea that needs development?  Or, just want to work with a team of like-minded and motivated collaborators? Intel and Portland ADX are hosting a Hackathon event on December 5-7th that is free of charge to attend.  In this Hackathon, participants will employ the Intel Edison IoT platform to help build new generations of human movement related devices. When we categorize human movement we can look at both mechanized and non-mechanized activities. Whether you are trying to improve child vehicle safety, or add turn signals to a bike, bring your ideas to our event and build them! Schedule: Friday 12\/5 5:30pm-10pm Intro, teams, ideas Saturday 12\/6 8am-10pm Hack Sunday 12\/7 8am-2pm Finish, Present, Awards For more information, visit the official event site",
                "fallback": "Eventbrite: Intel® IoT Hackathon: Transportation - PDX",
                "thumb_url": "http:\/\/cdn.evbuc.com\/images\/11768823\/63426210191\/1\/logo.png",
                "from_url": "https:\/\/www.eventbrite.com\/e\/intel-iot-hackathon-transportation-pdx-tickets-14622589559",
                "thumb_width": 200,
                "thumb_height": 200,
                "id": 1
            }
        ],
        "ts": "1417479063.000002"
    }
]