[
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "<https:\/\/www.facebook.com\/events\/1550083821948717\/>",
        "ts": "1447876765.000002"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "I would go, but I’m out of town. Looks fun",
        "ts": "1447881962.000003"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "that restaurant is great",
        "ts": "1447881966.000004"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "going to see a good friend and colleage speak tonight. <https:\/\/nvite.com\/rfrshpdx\/b901>",
        "attachments": [
            {
                "title": "Refresh Portland presents: Benevolent Dictatorship as Creative Practice \/ #rfrshpdx",
                "title_link": "https:\/\/nvite.com\/rfrshpdx\/b901",
                "text": "Our TopicCreative leadership is about setting the stage for a team to produce the best work possible. It requires a deft balance between vision and empowerment, a strong strategic mooring with room for others to shine. A tall order, yet most people tasked with leading a team are figuring it out as they go. Come hear tales from a self-taught benevolent dictator with over 15 years in the trenches producing passion projects and client work with teams of all sizes. There will be Hebrew. There will be Hip Hop. There will be hard won wisdom\/stupidity.Our speaker, Tsilli PinesTsilli Pines is the Director of Design Week Portland, the Host of CreativeMornings in Portland, and the Digital Creative Director at FINE. She's been working as a designer for over 15 years and is passionate about the value of design and the power of creative discourse.Follow Tsilli on Twitter.",
                "fallback": "Refresh Portland presents: Benevolent Dictatorship as Creative Practice \/ #rfrshpdx",
                "from_url": "https:\/\/nvite.com\/rfrshpdx\/b901",
                "id": 1
            }
        ],
        "ts": "1447892006.000005"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "you’re friends with Tsilli? she seems like such an awesome person.",
        "ts": "1447893718.000007"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "yes shes a good friend! she is an awesome person",
        "ts": "1447893862.000008"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "I started out my career at Fine and she was a senior designer there when i started, like 10 years ago",
        "ts": "1447893890.000009"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": ":simple_smile: awesome",
        "ts": "1447894029.000010"
    }
]