[
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "<https:\/\/www.eventbrite.com\/e\/witch-summer-soiree-tickets-17532875302>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "WITCH Summer Soirée",
                "title_link": "https:\/\/www.eventbrite.com\/e\/witch-summer-soiree-tickets-17532875302",
                "text": "The Women in Technology, Coding, and Hacking (WITCH) second event will be held on July 16th at the Jaguar Land Rover R&amp;D Labs in NW Portland. These events give us the opportunity to share our experiences, make new friends, provide informal mentorship, and strengthen Portland’s community of women in technology. Come celebrate summer with snacks and drinks, network, learn about all the groups serving women in computing and technology in PDX, and hatch fun plans for future collaborations!   Doors will open at 5:30, and at 6:00pm we'll have a quick welcome by organizing groups and sponsors. Food and drinks will be provided, so please RSVP so we can plan accordingly. Looking forward to seeing everyone there!   WITCH is a collaboration of the Portland women in tech groups. It was created to bring our members together to cross-pollinate and provide support to all. Our first event, a holiday happy hour, was a great success and we're excited to make this a biannual event. Sponsored by: Jaguar Land Rover     Worksystems Inc     Organizing groups:         Lesbians Who Tech ChickTech     Girl Develop It     Women Who Code               Django Girls PDX Women in Tech App Camp for Girls              Women Who Hack",
                "fallback": "Eventbrite: WITCH Summer Soirée",
                "thumb_url": "https:\/\/ebmedia.eventbrite.com\/s3-build\/3232-rc2015-07-01_12.04-055fbf7\/django\/images\/logos\/eb_logo_white_1200x1200.png",
                "from_url": "https:\/\/www.eventbrite.com\/e\/witch-summer-soiree-tickets-17532875302",
                "thumb_width": 1200,
                "thumb_height": 1200,
                "id": 1
            }
        ],
        "ts": "1436299107.000002"
    }
]