[
    {
        "user": "U0914MEN7",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U0914MEN7|james> has joined the channel",
        "ts": "1439913437.000002"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "<http:\/\/www.meetup.com\/Innovation-in-Motion\/events\/223841329\/>",
        "attachments": [
            {
                "service_name": "Meetup",
                "title": "Innovation in Motion",
                "title_link": "http:\/\/www.meetup.com\/Innovation-in-Motion\/events\/223841329\/",
                "text": "Eat, drink and talk tech at the 4th Annual TechCrawl.&amp;nbsp;Here are 3 reasons you won’t want to miss it. 1.&amp;nbsp; Stay connected to the ever-growing tech community in Portland (nice!) 2. Free food an",
                "fallback": "Meetup: Innovation in Motion",
                "thumb_url": "http:\/\/photos4.meetupstatic.com\/photos\/event\/c\/4\/9\/c\/highres_64070332.jpeg",
                "from_url": "http:\/\/www.meetup.com\/Innovation-in-Motion\/events\/223841329\/",
                "thumb_width": 400,
                "thumb_height": 325,
                "id": 1
            }
        ],
        "ts": "1439936187.000003"
    },
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "Here's the 3D printing workship series we're hosting starting next week: <https:\/\/www.eventbrite.com\/e\/3d-modeling-and-printing-workshop-series-tickets-18089092964>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "3D Modeling and Printing Workshop Series",
                "title_link": "https:\/\/www.eventbrite.com\/e\/3d-modeling-and-printing-workshop-series-tickets-18089092964",
                "text": "Sign up now, this event has a very limited number of spots! Come to ChickTech’s 3D Printing workshop to get the skills you need to start making 3D models on your own! For three Tuesday evenings in a row, you will be led by an experienced design instructor and focus on building a basic skill set for 3D printing design. Best of all, you'll get to print each session’s project in one of five plastic colors to keep! Technology that will be used: Autodesk Fusion360 3D Printers   The Instructor: 3D printing designer Mazuir Ross (Maz) Maz sculpted the 3D printed cow Veronin for Urban Farmer PDX! To learn more about the designer check out her website at <http:\/\/mazuirross.com|mazuirross.com>. She is also in partnership with Attero, who focuses on the hardware side of 3D printing. You can find information about Maz and Attero’s operation here: mazandattero.xyz Maz designed #crowdcow with her software modeling expertise   Session 1, August 25th: Make a Custom Charm The first session will overview the basics needed for successfully designing 3D printing output, particularly FFF\/FDM printing. In the lesson we will create a snap-on custom charm for beer bottles\/wine glasses. The creation of the snap-on charm will focus on basics of sketching and creating geometry from sketches. You'll be able to put a word or name on the charm, or even make flowers and\/or geometric shapes!     Session 2, September 1st: Make a Trinket Box The second session is about modeling a trinket box with a lid. The session will focus on the combining\/subtracting and\/or intersecting of geometry for modeling. We'll also focus on the concept of fitting tolerances needed for CAM\/CNC fabrication, particularly 3D printing.     Session 3 September 8th: Make a Six-Panel Hinged Cube with Custom Panel Design In the third session, you'll model a 6-panel hinged cube, including learning how to create fitted hinges. You'll also get creative with the custom designs on each panel. This folding cube can be designed with a sports team logo, a company name, anything you want. It can also be made into a desk trinket to hold pencils\/pens\/stylus just by cutting out a hole on the top panel. ------------------------------------ By the end of this workshop series you'll have a comprehensive understanding of 3D printing, 3D modeling software, and 3D design. Part of ChickTech’s mission is to retain women in technology. We intend for this event to build community and add skills to resumes. We encourage anyone who has always wanted to get started with 3D Printing to register for this event! Dates: Aug 25, Sept 1, Sept 8 Time: 5:45pm-8pm (Doors open at 5:30pm and close at 8:30pm, we encourage you to come early and stay late!) Location: Uncorked Studios 1001 SE Water Ave #350 Portland, OR 97214 Registration pays for dinner for all three evenings, along with the class costs. Any amount left over supports ChickTech: High School. A big thank you to our sponsor and event location provider, Uncorked Studios! ChickTech: Career events are open to all genders with a focus on women.",
                "fallback": "Eventbrite: 3D Modeling and Printing Workshop Series",
                "thumb_url": "https:\/\/img.evbuc.com\/https%3A%2F%2Fimg.evbuc.com%2Fhttps%253A%252F%252Fcdn.evbuc.com%252Fimages%252F14752692%252F149224738989%252F1%252Foriginal.jpg%3Frect%3D0%252C290%252C1200%252C600%26s%3Df63d043bc22defbc7785a48879f54938?w=1000&s=5c8cd1df696778518efb5acb09c11e7b",
                "from_url": "https:\/\/www.eventbrite.com\/e\/3d-modeling-and-printing-workshop-series-tickets-18089092964",
                "thumb_width": 1000,
                "thumb_height": 500,
                "id": 1
            }
        ],
        "ts": "1439936796.000005"
    },
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "^^Regarding the above, we can have a few volunteers of any gender there each night to help set up\/clean up and you'll be able to participate at no cost. Lemme know if anyone I haven't talked with already is interested.",
        "ts": "1439938589.000007"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "if you hit a point where you have a schedule hole, let me know and i'll test the waters at home. :simple_smile:",
        "ts": "1439939646.000008"
    }
]