[
    {
        "type": "message",
        "user": "U02HCCTFL",
        "text": "Could someone write up a quick description of our open house next week? Would like to start posting in the appropriate places.",
        "ts": "1422481416.000002"
    },
    {
        "type": "message",
        "user": "U02HCCTFL",
        "text": "Also - would we like to Include contagious and Ushahidi on the open house?",
        "ts": "1422481470.000003"
    },
    {
        "type": "message",
        "user": "U027PV4AP",
        "text": "maybe <@U02F90CRQ> or <@U026NB2U2>",
        "ts": "1422481530.000004"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "I'll take a whack at it. Do we know who the panelist\/speakers are? All I want to confirm is we'll have a unique mixture, not 3 tech types (not that there's anything wrong with tech types). LMK. Thanks",
        "ts": "1422482236.000005"
    },
    {
        "type": "message",
        "user": "U02HCCTFL",
        "text": "<@U02F90CRQ>: for the moment it's just an open house for PDX startup week (similar to design week - but not as blown out.  No speakers or anything planned. We'll have beer and (maybe) some Olympic Provisions? Need confirmation from Marce.",
        "ts": "1422482371.000006"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Gotcha. You guys send me some details and I'll wordsmith them. Thanks. ",
        "ts": "1422482475.000007"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "cool on food and OP for Monday",
        "ts": "1422483115.000008"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Having never read one of these write ups, I hope this is close to the mark:",
        "ts": "1422491602.000009"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "We are a startup product design agency born at P.I.E here in PDX.  Many of our clients are startups, as are people we enjoy sharing office space with - Contagious, Ushahidi and more to come.  Stop by for snacks from Olympic Provisions, adult beverages and to swap stories about all things startup.",
        "ts": "1422491604.000010"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "I dig. I would say we could probably lose the word \"startup\" in the first sentence since you cover it that we work with them in the next one.",
        "ts": "1422493673.000011"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "<@U02HCCTFL>: Thoughts?",
        "ts": "1422493677.000012"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Good point",
        "ts": "1422495086.000013"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "I was gonna be a bit snarkier but I don't want to overplay that hand.",
        "ts": "1422495110.000014"
    },
    {
        "type": "message",
        "user": "U02HCCTFL",
        "text": "Perfect! Thanks <@U02F90CRQ> ! I'll get it up tomorrow on calagator and the like",
        "ts": "1422506214.000015"
    },
    {
        "type": "message",
        "user": "U02HCCTFL",
        "text": "In other events news - we have decided a date for our Smart Things\/Intel\/UCS Hardware Hack Day: May 16th. Venue is (tentatively) at Simple. Pre Party (tentatively) at Ebay",
        "ts": "1422506371.000016"
    },
    {
        "type": "message",
        "user": "U02HCCTFL",
        "text": "I will work with <@U027PV4AP> and <@U026AP8CM> to get up on the team cal etc.",
        "ts": "1422506403.000017"
    },
    {
        "type": "message",
        "user": "U02HCCTFL",
        "text": "SmartThings liked our Manifesto\/Mission Statement. I told them we will brainstorm some names and logos over the next month as we seek sponsors MORE TO COME",
        "ts": "1422506546.000018"
    }
]