[
    {
        "type": "message",
        "user": "U02HCCTFL",
        "text": "<https:\/\/www.eventbrite.com\/e\/techtown-portland-people-on-the-move-tickets-14999633307>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "Techtown Portland: People on the Move",
                "title_link": "https:\/\/www.eventbrite.com\/e\/techtown-portland-people-on-the-move-tickets-14999633307",
                "text": "Come Join US!   Join us at Smarsh&amp;#39;s new headquarters as we unveil TechTown Portland: People on the Move! This short video reveals why Portland is a thriving hub for tech companies, by following six individuals who explain why moving to Portland to work was the right decision. From the food carts to the beautiful scenery, Portland has something for everyone, and the growing tech scene boasts collaboration and creativity. Our artisanal culture extends from arts and crafts, breweries, and food to creating what’s next in tech. We already know how wonderful Portland is; now it’s time to give a bigger audience a glimpse of what our vibrant city has to offer. Our firms are growing with the best and brightest, but we need to attract more talent to support the local companies whose innovative technologies are gaining world acclaim. That’s the purpose behind TechTown Portland: People on the Move. We all benefit from a collective effort to attract more talent to the region. Doors open at 5:00 pm and the video will begin showing at 5:30 pm.   Thank you to the firms (Acquia, Cozy, Elemental Technologies, Globesherpa, Jama, New Relic, Puppet Labs, Smarsh,  Simple, Urban Airship, Viewpoint Construction Software,  and  Webtrends) and organizations (Portland Development Commission, Business Oregon, CBRE, JLL, and Technology Association of Oregon) that made this video possible. Special thanks to Smarsh for hosting the premiere. To stay up to date on all things TechTown follow us on Twitter!",
                "fallback": "Eventbrite: Techtown Portland: People on the Move",
                "thumb_url": "http:\/\/cdn.evbuc.com\/images\/12045635\/958843246\/1\/logo.png",
                "from_url": "https:\/\/www.eventbrite.com\/e\/techtown-portland-people-on-the-move-tickets-14999633307",
                "thumb_width": 355,
                "thumb_height": 200,
                "id": 1
            }
        ],
        "ts": "1421185870.000002"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Shoot. There may be a bcc party that evening. :)",
        "ts": "1421186025.000004"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Looks fun. ",
        "ts": "1421186033.000005"
    }
]