[
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "our friend Nick has graciously extended a comp pass or two to next week’s Most Contagious event. If anyone’s interested, please let me know!  <https:\/\/www.eventbrite.co.uk\/e\/most-contagious-distilled-portland-tickets-20735124315>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "Most Contagious Distilled \/ Portland",
                "title_link": "https:\/\/www.eventbrite.co.uk\/e\/most-contagious-distilled-portland-tickets-20735124315",
                "text": "For the first time ever, Contagious is bringing the thinking and analysis of our annual, sell-out Most Contagious conference to Portland. Most Contagious: Distilled is a 90-minute look at the most impactful marketing themes from the year to decipher what influence each will have on the immediate future for brands and agencies.  Presented by Nick Parish, President of Contagious North America, and Will Sansom, Director of Content and Strategy for Contagious Insider, the event will help Portland marketers navigate the big innovations and ideas of the moment. The Dangers of Anti-Creativity \/ Great work has never been more essential to helping grow brands. But it has never been harder to come by. In this rousing exhortation for transformative creativity we look at the biggest hurdles to achieving it—what we dub ‘anti-creativity’. You’ll learn the barriers, both within and without, to reaching the creative mountaintop and how to equip yourself to avoid them. Mobile Video \/ Consumer demand and a host of new players in the space, including Periscope, Snapchat and Facebook, are ushering in a golden age of video. We’ll freeze frame to examine what’s going on right now and fast forward to see where the opportunities lie for brands. Virtual Reality \/ A perfect storm of investment, creative briefs and headset launches means that marketers now see Virtual Reality as a real opportunity rather than a virtual gimmick. We’ll explore the key players, best work and creative opportunities for brands in this exciting space. Artificial Intelligence \/ Artificial intelligence: we’ve all heard the hype. But let’s cast aside Hollywood’s apocalyptic predictions for a moment. What does the Rise of the Machines actually mean for our industry? We’ll assess the impact that this new digital era will have on marketing and purchase decisions over the next five years, and show you the smartest brands that are already using algorithms to their advantage today.",
                "fallback": "Eventbrite: Most Contagious Distilled \/ Portland",
                "thumb_url": "https:\/\/cdn.evbstatic.com\/s3-build\/perm_001\/2b537e\/django\/images\/logos\/eb_logo_white_1200x1200.png",
                "fields": [
                    {
                        "title": "Where",
                        "value": "403 SW 10th Avenue Portland, OR 97205",
                        "short": true
                    },
                    {
                        "title": "When",
                        "value": "Thu, 3 Mar 2016 at 09:00",
                        "short": true
                    }
                ],
                "from_url": "https:\/\/www.eventbrite.co.uk\/e\/most-contagious-distilled-portland-tickets-20735124315",
                "thumb_width": 1200,
                "thumb_height": 1200,
                "id": 1
            }
        ],
        "ts": "1456183496.000011"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "* check w\/ managers and whatnot for DTO stuff",
        "ts": "1456183511.000013"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Wow - that seems like a great thing for us to attend.",
        "ts": "1456183806.000014"
    },
    {
        "type": "message",
        "user": "U02F9CXTL",
        "text": "+1",
        "ts": "1456184114.000015"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "any other takers? I’ll request a couple seats for you guys",
        "ts": "1456184892.000016"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "wife on call :disappointed:",
        "ts": "1456184940.000017"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "i wouldn’t mind if there’s a spare. i don’t want to bump anyone who is closer to client work",
        "ts": "1456185088.000018"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "we could also probably swing a ticket or two eh?",
        "ts": "1456185331.000019"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "yup",
        "ts": "1456185404.000020"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "cool. let me ask for a couple and we can buy a couple",
        "ts": "1456185453.000021"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "I’m in the same boat as James, but that (event) seems _really_ interesting to me too",
        "ts": "1456185806.000022"
    }
]