[
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "<!channel> Kat and I are planning to go to this tomorrow if any other women in the office are interested!! <https:\/\/www.eventbrite.com\/e\/pdx-women-in-tech-pdxwit-happy-hour-networking-event-tickets-24048439530>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "PDX Women in Tech (PDXWIT) Happy Hour Networking Event",
                "title_link": "https:\/\/www.eventbrite.com\/e\/pdx-women-in-tech-pdxwit-happy-hour-networking-event-tickets-24048439530",
                "text": "***Elemental is located on the Second Floor*** Join us for happy hour at Elemental Technologies! Come network and have fun! We will have a short segment at 5:30, which includes: Introduction to Elemental Hear from Julianne Brands from Oregon Angel Fund about resources available to entrepreneurs Launch the PDXWIT Mentorship Network Tips on better salary negotiations by Amanda Brooks from 24Seven Make sure you say hi to Sabina Andersson, Associate Product Manager for Elemental's cloud solutions. Read our April newsletter to learn more about Sabina! PDX Women in Tech exists to celebrate professional women in the Portland-metro area who work with, manage, lead or have an interest in technology. Whether you are developing event-driven, non-blocking applications in node.js or setting technology strategy for a Fortune 500 company - or anything in between - come join us! Please note that after you RSVP, you may receive an email with a ticket.  You do not need to bring the ticket with you to the event. Thank you for registering and can't wait to see everyone!",
                "fallback": "Eventbrite: PDX Women in Tech (PDXWIT) Happy Hour Networking Event",
                "image_url": "https:\/\/img.evbuc.com\/https%3A%2F%2Fimg.evbuc.com%2Fhttps%253A%252F%252Fcdn.evbuc.com%252Fimages%252F19787515%252F120760049235%252F1%252Foriginal.jpg%3Frect%3D0%252C0%252C2000%252C1000%26s%3D72152ce4790677346eeaf994f08ada37?w=1000&s=279e728b0def879a5d08d3534c5097ba",
                "fields": [
                    {
                        "title": "Where",
                        "value": "721 SW Oak St, Portland, OR 97205",
                        "short": true
                    },
                    {
                        "title": "When",
                        "value": "Tue, Apr 19, 2016 at 4:30 PM",
                        "short": true
                    }
                ],
                "from_url": "https:\/\/www.eventbrite.com\/e\/pdx-women-in-tech-pdxwit-happy-hour-networking-event-tickets-24048439530",
                "image_width": 500,
                "image_height": 250,
                "image_bytes": 42905,
                "id": 1
            }
        ],
        "ts": "1461021806.000002"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "I’m pretty sure men can come too ¯\\_(ツ)_\/¯",
        "ts": "1461021928.000004"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Say hello to Julianne Brands - she’s awesome",
        "ts": "1461026166.000005"
    }
]