[
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "I received an invite to an OMSI event next week - a private opening event to their new exhibit on space. I’m unable to attend, but if anyone wants to go, hit the link below. <https:\/\/www.eventbrite.com\/e\/journey-to-space-the-exhibition-vip-opening-event-at-omsi-tickets-25652287683>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "Journey to Space:  The Exhibition - VIP Opening Event at OMSI",
                "title_link": "https:\/\/www.eventbrite.com\/e\/journey-to-space-the-exhibition-vip-opening-event-at-omsi-tickets-25652287683",
                "text": "You’re invited to live, work, and learn in space as we celebrate the opening of Journey to Space: The Exhibition, on Thursday, June 16, from 5:30pm-8:30pm at OMSI.  Glimpse the extraordinary conditions of human space travel, as well as the unique challenges and rewards of life on board the International Space Station. Bring a friend, family member, or colleague to explore the conditions that make space travel so dangerous and try out some of the engineering technology that makes life and research possible in space.  We hope you'll join us for this private preview of the exhibit, while enjoying refreshments, and appetizers. Thank you, Megan Strong - Event Sales Manager Julia Houha - Event Sales Coordinator Kathleen Meyer - Event Sales Assistant  FAQs Are there ID requirements or an age limit to enter the event? This is a family-friendly event and all ages are welcome! Attendees who are over 21 years old may order complimentary alcoholic beverages by presenting a valid ID.  What are my transport\/parking options getting to the event? Complimentary parking is provided in OMSI parking lots.  Where can I contact the organizer with any questions? Please contact Megan Strong at <mailto:mstrong@omsi.edu|mstrong@omsi.edu> or &lt;tel:(503)797-4671|(503) 797-4671&gt; with any questions. Do I have to bring my printed ticket to the event? Your RSVP is all we require, no ticket necessary. Timeline for Event:  5:30pm-Guest arrival with exhibit open for viewing 6:15-6:30pm-Remarks by OMSI's President Nancy Stueber 8:30pm-Event Concludes",
                "fallback": "Eventbrite: Journey to Space:  The Exhibition - VIP Opening Event at OMSI",
                "image_url": "https:\/\/img.evbuc.com\/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F21323025%2F144887268756%2F1%2Foriginal.jpg?w=1000&rect=0%2C213%2C1500%2C750&s=553fb26b7fd85a167bc7d2a845f649a3",
                "fields": [
                    {
                        "title": "Where",
                        "value": "1945 Southeast Water Avenue, Portland, OR 97214",
                        "short": true
                    },
                    {
                        "title": "When",
                        "value": "Thu, Jun 16, 2016 at 5:30 PM",
                        "short": true
                    }
                ],
                "from_url": "https:\/\/www.eventbrite.com\/e\/journey-to-space-the-exhibition-vip-opening-event-at-omsi-tickets-25652287683",
                "image_width": 500,
                "image_height": 250,
                "image_bytes": 200072,
                "service_icon": "https:\/\/cdn.evbstatic.com\/s3-build\/perm_001\/1aab42\/django\/images\/touch_icons\/apple-touch-icon-57x57.png",
                "id": 1
            }
        ],
        "ts": "1465417641.000002"
    },
    {
        "type": "message",
        "user": "U0DCXC37U",
        "text": "I wish calder was older, i’d love to bring him! thanks for the offer though marce!",
        "ts": "1465418829.000004"
    }
]