[
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "Oops just realized I posted those pics for Mood Ring in the wrong slack. Oh well.",
        "ts": "1469223810.000105"
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "Hey if we find some cool shapes on thingiverse, can we adapt them\/mess with them?",
        "ts": "1469223832.000106"
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "Do we have anyone who messes with 3D modeling?",
        "ts": "1469223847.000107"
    },
    {
        "type": "message",
        "user": "U1J4BQX7G",
        "text": "I think <@U0H4SJN11>, <@U1B4121BP>, and <@U1G7A0NLW> are resident 3D fuck-shit-uppers",
        "ts": "1469225255.000108",
        "reactions": [
            {
                "name": "partyparrot",
                "users": [
                    "U0J6TE0CA",
                    "U1G7A0NLW"
                ],
                "count": 2
            }
        ]
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "<https:\/\/vimeo.com\/49748983>",
        "attachments": [
            {
                "service_name": "Vimeo",
                "service_url": "https:\/\/vimeo.com\/",
                "title": "CLOUD: An Interactive Sculpture Made from 6,000 Light Bulbs",
                "title_link": "https:\/\/vimeo.com\/49748983",
                "author_name": "Caitlind r.c. Brown",
                "author_link": "http:\/\/vimeo.com\/incandescentcloud",
                "thumb_url": "http:\/\/i.vimeocdn.com\/video\/544235575_295x166.jpg",
                "thumb_width": 295,
                "thumb_height": 166,
                "text": "September 15, 2012\n\nYou can also find us here <https:\/\/www.facebook.com\/incandescentcloud> and here <http:\/\/www.incandescentcloud.com|www.incandescentcloud.com>\n\nCLOUD is a large-scale interactive sculpture created from 6,000 light bulbs (new and burnt out) by Canadian artists Caitlind r.c. Brown &amp; Wayne Garrett. The piece utilizes everyday domestic light bulbs and pull strings, re-imagining their potential to create wonder and inspire collaboration. As part of the process of creating the sculpture, the artists collected burnt out incandescent light bulbs from the surrounding community, forging an informal relationship with non-artists, reducing costs, and asking audiences to reconsider household items in an alternative context. During exhibition, viewers interact with CLOUD by initiating impromptu collaborations, working as a collective to turn the entire sculpture on and off.\n\nHow CLOUD works: The hand-bent steel substructure of the sculpture is covered in a skin of incandescent light bulbs (new and burnt out), and rear-lit from within by 250 compact fluorescent bulbs, pulling a total power of approximately 20 amps (the equivalent of two household outlets). Each of these bulbs is attached to a pull-string, allowing viewers to control the illumination of the structure – like lightning in the CLOUD above them.\n\nEditions of CLOUD have appeared at Nuit Blanche Calgary (Canada) and Garage Center for Contemporary Culture as the centerpiece of Art Experiment 2013 (Moscow, Russia). A third evolution of the sculpture was created in June 2013 in Chicago, USA. Entitled CLOUD CEILING, this rendition is a permanent installation (sans pull-chains) in Progress Bar, utilizing motion sensors and over 15,000 light bulbs.\n\nSponsors: Alberta College of Art + Design, The Nuit Blanche Foundation, The City of Calgary, Calgary Arts Development Authority, Calgary Public Arts, Calgary 2012, and The Awesome Foundation (Calgary chapter).",
                "fallback": "Vimeo Video: CLOUD: An Interactive Sculpture Made from 6,000 Light Bulbs",
                "video_html": "<iframe src=\"https:\/\/player.vimeo.com\/video\/49748983?autoplay=1\" width=\"400\" height=\"220\" frameborder=\"0\" title=\"CLOUD: An Interactive Sculpture Made from 6,000 Light Bulbs\" webkitallowfullscreen mozallowfullscreen allowfullscreen><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 220,
                "from_url": "https:\/\/vimeo.com\/49748983",
                "service_icon": "https:\/\/a.slack-edge.com\/e8ef6\/img\/unfurl_icons\/vimeo.png",
                "id": 1
            }
        ],
        "ts": "1469226142.000109"
    }
]