[
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "<@U026E0ZNR> Had time to think about this over the weekend. My understanding is that this  channel is for the back projection setup project while #motion is more of a channel to share links and discuss motion stuff across projects?",
        "ts": "1440433916.000002"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "If that’s correct, would it make sense to keep those 2 separate to prevent confusion and reduce the noise? I’m fine either way but wanted to ask that question before consolidating the 2.",
        "ts": "1440433966.000003"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I think that makes sense. Maybe I'm actually treating this more like the #motion channel. I was just wondering. I think it's fine we have them separate.",
        "ts": "1440435816.000004"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "I think the projector channel might go away once we have the screens and projectors set up",
        "ts": "1440436830.000005"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "just need a way to get consensus there while that stuff is being figured out",
        "ts": "1440436860.000006"
    },
    {
        "type": "message",
        "user": "U06K2R98C",
        "text": "^ that’s how i’ve thought about it. makes sense to me",
        "ts": "1440437143.000007"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Cool. Maybe we make an #[project-name] channel when we start to work on it.",
        "ts": "1440437212.000008"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "yeah",
        "ts": "1440440801.000009"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "In the spirit of that and given the recent sandbox project announcements, I’ve created <#C09HT2S68> to begin chatting, planning and building whatever that project is.",
        "ts": "1440458936.000010"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Feel free to join if you would like to collaborate on that one.",
        "ts": "1440458959.000011"
    }
]