[
    {
        "type": "message",
        "user": "U0HS41J3Y",
        "text": "Update on fishackathon from our call with DC today: They asked portland to stay on the line again - April expressed serious concerns about our numbers so she’s reached out to the City of Portland and Intel on our behalf. She reminded us that we have the lowest number of people signed up out of all 43 states participating. I did update them on our confirmed venue space &amp; judges, and said that we are focusing on improving our numbers. There was a slight hiccup on the call when I indicated that our current event space only holds 15 (I’m working with Jupiter to see if we can fit more people or if they have a different room available) as they were planning on sending a rep to our event based upon our capacity of 50. If we have less people, they might not want to send a rep. April wants to be kept in the loop on all progress moving forward. She asked me to send her an email today with our updated capacity and address of the venue.",
        "ts": "1459796498.000002"
    },
    {
        "type": "message",
        "user": "U0HS41J3Y",
        "text": "I think we are on the right track and we can do this! But as I mentioned before I’m concerned about 1) number of participants 2) internal staffing of the event and 3) sponsors! I am unavailable to attend the event, and I know Rob has very limited availability the weekend of the event as well. I’ll talk with Stephanie and Amanda today to see how we can get more support.",
        "ts": "1459796852.000003"
    },
    {
        "type": "message",
        "user": "U0HS41J3Y",
        "text": "Update on space, per Rob - Sam (Rob’s wife at Jupiter) is moving us to the dreambox which can fit much more (50ish). We also can use the courtyard for lunch, breaks, etc.",
        "ts": "1459797283.000004"
    },
    {
        "type": "message",
        "user": "U0HS41J3Y",
        "text": "I’ll provide this information to April today",
        "ts": "1459797303.000005"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Thanks Ally. Did you get a chance to ask about Whole Food sponsorship contact or other recommended sponsors? Also, have we gotten any new participants?",
        "ts": "1459799728.000006"
    },
    {
        "type": "message",
        "user": "U0HS41J3Y",
        "text": "Thanks for bringing that up - I did ask about Whole Foods &amp; April said she would connect me with their contact. Their recommendations in terms of sponsors were to reach out to universities\/schools in our area - which is on our to do list!",
        "ts": "1459799856.000007"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "I’m reaching out to folks to both participate and volunteer (and have connected them w\/ Rob)",
        "ts": "1459801105.000008"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Another person pinged me via PDX Startup Slack bc of the Calagator posting (so thanks for doing that). He’s interested in helping out (and I’ve reached out to him but haven’t heard back yet).",
        "ts": "1459801250.000009"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Can we make sure we have reps from within the company as well? I’ve dangled AVP as part of this to the managers - want to make sure we have people from our team there as well. Margaret and I will be there all-day Sat and Sunday. (I can stop by on Friday after the Code thing).",
        "ts": "1459801307.000010"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Yes. I’ve put together this monitoring sheet and am going to disseminate it to managers to sign people up",
        "ts": "1459804234.000011"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "I’m thinking if we can get people to volunteer in 2-3 hr. shifts, we can reduce the burden on any one person",
        "ts": "1459804259.000012"
    }
]