[
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Great Saturday morning read: <http:\/\/firstround.com\/article\/hardware-adam-macbeth>",
        "attachments": [
            {
                "title": "Software is Eating Hardware - Lessons for Building Magical Devices",
                "title_link": "http:\/\/firstround.com\/article\/hardware-adam-macbeth",
                "text": "“Software is eating hardware.” That might sound counterintuitive given all the innovative hardware plays in the mix today — from Android Wear, SmartThings, Sproutling and Nest to the hotly anticipated iWatch. But Adam MacBeth, an advocate of the software-first approach, would argue that those products are only as compelling as the end-to-end experience that sets them alight. “People think that they can build a game-changer with some really great industrial design and packaging, but that’s not the case anymore,” says MacBeth, whose work has helped shaped the iPod, Jawbone’s wristbands and FiftyThree’s Pencil. “Incredible industrial design is increasingly non-optional, what really matters is an equally beautiful software system that spans mobile, desktop, and more. It’s something that takes a lot of thought to get right.” As technology accelerates, with companies like Dragon Innovation making manufacturing, supply chain and distribution cheaper and easier than ever before, tons of hardware startups are coming out of the woodwork. In this exclusive First Round Review interview, MacBeth offers tactics for how these companies can capture people’s imagination and create truly world-class products.",
                "fallback": "Software is Eating Hardware - Lessons for Building Magical Devices",
                "thumb_url": "http:\/\/frcs3.s3.amazonaws.com.global.prod.fastly.net\/library\/mainImage\/sproutling3.jpg",
                "from_url": "http:\/\/firstround.com\/article\/hardware-adam-macbeth",
                "thumb_width": 1800,
                "thumb_height": 634,
                "id": 1
            }
        ],
        "ts": "1401551209.000002"
    }
]