[
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "<@U02918BKW> \/ <@U027PV4AP> Not sure how to answer this",
        "ts": "1412785899.000121"
    },
    {
        "type": "message",
        "subtype": "file_share",
        "text": "A file was shared",
        "file": null,
        "upload": false,
        "ts": "1412785918.000125"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "Agree. Really need a \"Maybe\" button",
        "ts": "1412785935.000126"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Scale 1 to 11.",
        "ts": "1412785953.000127"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "<http:\/\/f3nation.com\/wp-content\/uploads\/2013\/11\/spinal_tap_but_it_goes_to_eleven.jpg>",
        "attachments": [
            {
                "from_url": "http:\/\/f3nation.com\/wp-content\/uploads\/2013\/11\/spinal_tap_but_it_goes_to_eleven.jpg",
                "fallback": "503x283px image",
                "image_url": "http:\/\/f3nation.com\/wp-content\/uploads\/2013\/11\/spinal_tap_but_it_goes_to_eleven.jpg",
                "image_width": 503,
                "image_height": 283,
                "image_bytes": 16984,
                "id": 1
            }
        ],
        "ts": "1412785980.000128"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "I get my own ice cream flavor!",
        "ts": "1412787031.000131"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "<http:\/\/www.golocalpdx.com\/news\/ben-jerrys-ice-cream-renames-flavor-in-oregon>",
        "attachments": [
            {
                "service_name": "GoLocalPDX",
                "title": "GoLocalPDX | News | Ben & Jerry’s Ice Cream Renames Flavor in Oregon",
                "title_link": "http:\/\/www.golocalpdx.com\/news\/ben-jerrys-ice-cream-renames-flavor-in-oregon",
                "text": "Ben & Jerry's will rename an ice cream flavor in support of Genetically Modified Organisms (GMO) mandatory food labeling, according to Bussiness Wire. ",
                "fallback": "GoLocalPDX: GoLocalPDX | News | Ben &amp; Jerry’s Ice Cream Renames Flavor in Oregon",
                "from_url": "http:\/\/www.golocalpdx.com\/news\/ben-jerrys-ice-cream-renames-flavor-in-oregon",
                "id": 1
            }
        ],
        "ts": "1412787031.000132"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "!!!",
        "ts": "1412787189.000135"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Go Scott!",
        "ts": "1412787202.000136"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel>: who's got an ipad i could use for one minute?",
        "ts": "1412787504.000137"
    },
    {
        "type": "message",
        "user": "U027PV4AP",
        "text": "<@U02618EV1> aghhhhhhh. doesn't matter. yes the work load is heavy or no the work load isn't.",
        "ts": "1412787588.000138"
    },
    {
        "type": "message",
        "user": "U027PV4AP",
        "text": "sorry!",
        "ts": "1412787591.000139"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "<@U027PV4AP> No worries. Assumed it was that and answered it anyways. :simple_smile:",
        "ts": "1412787651.000140"
    },
    {
        "type": "message",
        "subtype": "file_share",
        "text": "A file was shared",
        "file": null,
        "upload": false,
        "ts": "1412787969.000141"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "thanks <@U0260V1BX> - I feel really creapy and icky now.",
        "ts": "1412788443.000142"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "anytime",
        "ts": "1412788453.000143"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "<http:\/\/qz.com\/276396\/jerry-seinfeld-ripped-apart-the-advertising-industry-on-its-biggest-night\/>",
        "attachments": [
            {
                "service_name": "Quartz",
                "service_url": "http:\/\/qz.com",
                "title": "Jerry Seinfeld ripped apart the advertising industry on its biggest night",
                "title_link": "http:\/\/qz.com\/276396\/jerry-seinfeld-ripped-apart-the-advertising-industry-on-its-biggest-night\/",
                "author_name": "Zachary M. Seward",
                "author_link": "https:\/\/qz.com\/author\/zachseward\/",
                "text": "“I love advertising because I love lying,” comedian Jerry Seinfeld told a banquet hall full of advertising executives at the industry’s annual awards show on Oct. 1. He didn’t appear to be joking.\nThe deadpan acceptance speech for his honorary Clio award drew cheers and applause from the crowd, apparently full of gluttons for punishment. “I think spending your life trying to dupe innocent people out of hard-won earnings to buy useless, low-quality, misrepresented items and services is an excellent use of your energy,” Seinfeld said.\nHere’s the full transcript:\nI am excited to win this. This is the award they give you when they don’t think you can actually win one, but they think you’ve done a pretty good job and seem to have been around for quite some time, and that’s how I got it.\nI would like to thank Ogilvy and Mather and American Express for getting me into this business. That was the first time I did it. I’d like to thank my manager George Shapiro, my incredible wife Jessica, and Ammirati for keeping me going.\nI love advertising because I love lying.\nIn advertising, everything is the way you wish it was. I don’t care that it won’t actually be like when I actually get the product being advertised because, in between seeing the commercial and owning the thing, I’m happy, and that’s all I want. Tell me how great the thing is going to be. I love it. I don’t need to be happy all the time. I just want to enjoy the commercial. I want to get the thing. We know the product is going to stink. We know that. Because we live in the world, and we know that everything stinks. We all believe, hey, maybe this one won’t stink. We are a hopeful species. Stupid but hopeful.\nBut we’re happy in that moment between the commercial and the purchase, and I think spending your life trying to dupe innocent people out of hard-won earnings to buy useless, low-quality, misrepresented items and services is an excellent use of your energy.\nBecause a brief moment of happiness is pretty good. I also think that just focusing on making money and buying stupid things is a good way of life. I believe materialism gets a bad rap. It’s not about the amount of money. Nothing’s better than a Bic pen, a VW Beetle, or a pair of regular Levi’s. If your things don’t make you happy, you’re not getting the right things. This will all be in my new book, Soulful Materialism, which is in the planning stages at this moment.\nI have always wanted a Clio. I don’t know much about it, but I know it’s a good award because in 1991, they screwed up this whole presentation, and there were a bunch of awards left over, and all of these ad people here climbed up onto the stage and tried to grab them. So, to me, that says this means something. That really happened, and it’s my all-time favorite awards show occurrence because it was so honest. People just said, I want a damn Clio, and they went for it. And that is why I am happy right now. I got this. I didn’t really win it, but I got it. And tomorrow, I don’t know where this is going to be. It’s going to be somewhere. Eventually I’ll be dead. Someone will just take it or sell it or throw it out. That’s fine. I’m happy now. The same way those executives were in 1991 when they ran onto this stage and grabbed trophies that weren’t theirs. But it trumped up their phony careers and meaningless lives.\nSo thank you all for this great honor and all your great work. I hope it makes you happy as you have made me happy for this five minutes of my life, which will last until I get to the edge of this stage, and it hits me that this was all a bunch of nonsense. Thank you, and have a great evening.",
                "fallback": "Quartz Link: Jerry Seinfeld ripped apart the advertising industry on its biggest night",
                "from_url": "http:\/\/qz.com\/276396\/jerry-seinfeld-ripped-apart-the-advertising-industry-on-its-biggest-night\/",
                "id": 1
            }
        ],
        "ts": "1412793798.000144"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "reading his quotes in text completely changes their meaning for me",
        "ts": "1412795007.000147"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "but maybe that was kind of his point",
        "ts": "1412795013.000148"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "<!channel>: does anyone have a thumb drive I can borrow?",
        "ts": "1412808481.000149"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "i do",
        "ts": "1412808493.000150"
    }
]