[
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "<http:\/\/vimeo.com\/109169719>",
        "attachments": [
            {
                "service_name": "Vimeo",
                "service_url": "https:\/\/vimeo.com\/",
                "title": "I've fallen, and I can't get up!",
                "title_link": "http:\/\/vimeo.com\/109169719",
                "author_name": "Dave Fothergill vfx",
                "author_link": "http:\/\/vimeo.com\/davefothergillvfx",
                "thumb_url": "http:\/\/i.vimeocdn.com\/video\/493060177_295x166.jpg",
                "thumb_width": 295,
                "thumb_height": 166,
                "text": "Crowd dynamics test using Miarmy for Maya.\nShows the new servo force feature which allows struggling animation once the agent has become dynamic\n\nRendered with Arnold",
                "fallback": "Vimeo Video: I've fallen, and I can't get up!",
                "video_html": "<iframe src=\"\/\/player.vimeo.com\/video\/109169719\" width=\"400\" height=\"225\" frameborder=\"0\" title=\"I&#039;ve fallen, and I can&#039;t get up!\" webkitallowfullscreen mozallowfullscreen allowfullscreen><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "from_url": "http:\/\/vimeo.com\/109169719",
                "id": 1
            }
        ],
        "ts": "1414425965.000002"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Wow.",
        "ts": "1414426279.000005"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "I brought home my corgi puppy this weekend. since i've never raised a dog before, I'm documenting my efforts here <http:\/\/raisingmoxon.tumblr.com\/> . Enter at your own risk.",
        "ts": "1414428608.000006"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "I hope to bring him in Friday afternoon for show and tell.",
        "ts": "1414428627.000007"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I could watch that vine clip allllllll dayyyyyy loooooooong",
        "ts": "1414429138.000008"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "wtf gaston, that is amazing and hilarious.",
        "ts": "1414429327.000009"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "<@U026E0ZNR> <http:\/\/tilde.club\/~waxpancake\/running\/>",
        "ts": "1414429398.000010"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "wow.",
        "ts": "1414429493.000011"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Then follow the \"Screams by Metro\" link to learn the true purpose of the internet.",
        "ts": "1414429562.000012"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Yeah I had to give up after seeing that before I completely lost composure.",
        "ts": "1414429593.000013"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<@U026PT0D7>: congrats! Corgis are such a great breed.",
        "ts": "1414429787.000014"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "oh my...he's so frickin' cute",
        "ts": "1414430098.000015"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": ":P",
        "ts": "1414430108.000016"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel>: did anyone move a long skinny box form the walnut table today? i moved three out of four to my desk but in going back for the fourth it has mysteriously disappeared. any help is appreciated.",
        "ts": "1414434442.000017"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "problem solved",
        "ts": "1414436187.000018"
    },
    {
        "type": "message",
        "user": "U02HCCTFL",
        "text": "In case you were wondering: <https:\/\/www.cbinsights.com\/blog\/internet-of-things-periodic-table\/?utm_content=buffer2ec8a&amp;utm_medium=social&amp;utm_source=linkedin.com&amp;utm_campaign=buffer>",
        "attachments": [
            {
                "service_name": "CB Insights - Blog",
                "title": "The Periodic Table of IoT",
                "title_link": "https:\/\/www.cbinsights.com\/blog\/internet-of-things-periodic-table\/?utm_content=buffer2ec8a&utm_medium=social&utm_source=linkedin.com&utm_campaign=buffer",
                "text": "The 141 companies, VCs, private equity firms, angels, accelerators, and acquirers engaged in the Internet of Things space that you should know.",
                "fallback": "CB Insights - Blog: The Periodic Table of IoT",
                "thumb_url": "https:\/\/cbi-blog.s3.amazonaws.com\/blog\/wp-content\/uploads\/2014\/10\/PeriodicTable-of-IoT-final2.png",
                "ts": 1414134000,
                "from_url": "https:\/\/www.cbinsights.com\/blog\/internet-of-things-periodic-table\/?utm_content=buffer2ec8a&utm_medium=social&utm_source=linkedin.com&utm_campaign=buffer",
                "thumb_width": 1967,
                "thumb_height": 837,
                "id": 1
            }
        ],
        "ts": "1414444906.000019"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "So - in a story that will likely interesting to no one but me: This weekend I was running a race downtown (the run like hell) and at about the 8 mile mark, the course is overlaps with itself so you end up passing runners who are way in front (or way behind) you. It was here that a woman pushing a stroller BLEW past me. You don't see a lot of strollers in races (most races wont allow them) and when you do, they're NEVER moving that fast. As best I could tell she was running somewhere in the top ten. So any way - other than motivating me to kick it up a little, I didn't think a lot more about this. Then today I was checking the weekend race results and I found this: <http:\/\/www.runnersworld.com\/general-interest\/julia-webb-runs-3815-10k-while-pushing-a-stroller>",
        "attachments": [
            {
                "service_name": "Runner's World &amp; Running Times",
                "title": "Julia Webb Runs 38:15 10K While Pushing a Stroller",
                "title_link": "http:\/\/www.runnersworld.com\/general-interest\/julia-webb-runs-3815-10k-while-pushing-a-stroller",
                "text": "Her husband, Alan Webb, owns the American record in the mile with a 3:46.91, but Julia Webb appears to have added to her family’s collection of records on Sunday by running faster than the Guinness World Record for a 10K while pushing a stroller. Webb finished fifth overall at the Run Like Hell 10K in Portland, Oregon, running 38:15, or 6:09 per mile.",
                "fallback": "Runner's World &amp; Running Times: Julia Webb Runs 38:15 10K While Pushing a Stroller",
                "ts": 1414422412,
                "from_url": "http:\/\/www.runnersworld.com\/general-interest\/julia-webb-runs-3815-10k-while-pushing-a-stroller",
                "id": 1
            }
        ],
        "ts": "1414447053.000022"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "turns out then was in the process of setting the new world record for running with a stroller",
        "ts": "1414447073.000025"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "which I did not know was a thing",
        "ts": "1414447081.000026"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "she has a nice post about it all here: <http:\/\/runteamwebb.wordpress.com\/2014\/10\/26\/running-a-new-stroller-pr-3815-for-10k\/>",
        "attachments": [
            {
                "service_name": "RunTeamWebb",
                "service_url": "http:\/\/runteamwebb.wordpress.com",
                "title": "Running a new stroller PR - 38:15 for 10K",
                "title_link": "http:\/\/runteamwebb.wordpress.com\/2014\/10\/26\/running-a-new-stroller-pr-3815-for-10k\/",
                "author_name": "runteamwebb",
                "author_link": "https:\/\/runteamwebb.wordpress.com\/author\/runteamwebb\/",
                "thumb_url": "https:\/\/i2.wp.com\/runteamwebb.files.wordpress.com\/2014\/10\/warriordashcal.jpg?fit=200%2C150",
                "thumb_width": 99,
                "thumb_height": 150,
                "text": "Running with my empty stroller to the start at Pioneer Square in downtown Portland before I met up with my rent-a-baby Ruby Schares and her family, gave me a feeling as if I was one of those people with Reborn Dolls (they look real but are obviously not). With my own daughter almost 3000 miles away on a rare trip with dad, I was sad but empowered by our 25 minute FaceTime session just before I exited the car to take on the 10K stroller challenge. After hearing the consistent “No” from race directors about running with my stroller, the only “Yes” I got that fit perfectly in my schedule was the one time my own baby would be gone. Run Like Hell 10K would have to be it, and my awesome friend Steph was more than supportive in making it happen.\nThe race morning weather said “No” after the long summer had finally officially ended. The rain was coming down hard, the sun had only been out once for about an hour the entire week and 50 degrees didn’t make it any more comfortable. I reassured Ruby’s mama Steph that I had a great rain cover and Joanie actually does better running with that because its like a little cocoon to protect her from the elements and usually puts her to sleep. I was bummed though, because I didn’t want 7 month old Ruby to miss the experience of seeing the race. Once you start running, the cover fogs up and inside would be similar to sitting in an airplane seat without a window.\nMy major concern was not Ruby’s performance but my tires. I am far from being anything mechanical and can boast I inherited my skills from my dad “Mechanical Pete” – sarcasm there- as he would frequently take days to do a shoddy job in what other dads could accomplish in an hour. (Take the Pinewood Derby car for example – my dad would spend endless time only to present my brothers the car that would likely place last). Just before bed the eve before race morning, I had a great victory in getting the PSI in each tire to the recommended “20” using Alan’s bike pump.\nWeeks ago I noticed that they could likely use more air, not only by visibility but by the heavy strain of each stride. I put my fingers on them and it squished down at least an inch. I tried using my special Mountain Buggy pump ferociously pumping for almost 30 minutes mid-run, with my frustration building as the squishiness would not go away. Later that night my friend Adam noticed the air tube was cut in half, with the massive leak giving me zero chance of getting the job done. Somehow I had likely been running with tires with maybe a max of 1 PSI for months and months. The last time I had pumped them up was when Sara Vaughn let me borrow hers, and she moved away over a year and a half ago. I guess that definitely explained some of my frustration as I thought Joanie was just getting too heavy nearing 28 lbs. That wasn’t completely the case. In hindsight, that definitely helped add to my strength training in making this run not nearly as challenging as I’d imagined. (Just weeks ago I ran a practice mile with 14 pound Ruby on a track and hit 6:25 -thinking that would be my max race pace. Thankfully my aired up tires gave me about a 20 sec per mile boost!)\nDuring this whole process I was beginning to feel like a triathlete with the thought of “your tire literally could pop and you’re done”. With Alan having tire issues at 2 of 3 at his triathlons, I could relate. His issue stemmed from my failed attempt at trying to ship him Zipp wheels over the border to Kelowna in Canada so he didn’t have to drag them around his family vacation in Toronto. With 6 days to get the job done UPS and the customs got in a fight and somehow Alan’s Zipp wheels were lost for almost a month. This meant using his regular wheels in 2 big races. Finally we got a call from UPS saying they found them in a warehouse and we received them back just in time before Alan headed over to his final race in South Korea. To my understanding it would be like running in regular trainers vs flats. Runners are not used to these technical issues, and I was praying my lack of tire pumping skills wouldn’t cause any race day trouble.\nTo explain further my deficiencies in machines I’ll share this story- my dad once told me to add more oil to my car. I couldn’t ask him to do it since I was in Virginia and he was back in Wisconsin. I ignored him for weeks not having a clue where this would go or how it would happen. Finally one day after my car was making weird noises and the check oil light had been on for now 3 months, I bravely pulled over, asked some clueless UVA student if it looked like this was where oil would go. He was as dumb as me and didn’t offer any advice. I took the bottle of oil and poured it into the hole with the “blue” cap. I didn’t happen to look close enough to see there was also a picture of a windshield wiper – I had poured oil in the wrong place, and when I put on my wipers, oil oozed out onto my windshield. That cost me a good $200 to flush out.  I have skill in the industrial arts and could have used some “shop” classes back in my day. Somehow I do know how to drive stick so back off.\n\nBack to my race, Ruby gave me the game on smile, her parents Steph and Eric ready to cheer us on with big sister Rosie (Joanie’s 2 year old pal). I had set a goal of sub 40 to get under the current official Guinness World Record of 43:07, but didn’t really have any workout evidence to base that on. The start was freezing, so Ruby was hidden in the cocoon and I was still wearing my rain jacket and ear warmers when the gun went off. I noticed my Hood to Coast teammate Carre Heineck next to me at the front. The rest of the competition was thinned out with Bridget Franek’s uncle reintroducing himself as he passed me around the mile. For most of the race I could see the lead pack of 3, followed by a guy who I tried to match (until I got caught up in removing the rain cover and then facing the final .2 mile uphill to the finish).\nThe previous year the Run Like Hell course took a different route going over train tracks, this year they rerouted it creating some exciting turns. In the 2013 races, somehow a train was stopped a full 39 minutes blocking runners with only a mile to go. This may have deterred more people from returning to this year’s competition, but I had an amazing race experience from start to finish. The race director was fully supportive in my “World Record attempt” not to mention flawless logistics you’d expect from a top notch organized race. This included:\n:heavy_check_mark:An abundance of bathrooms (no peeing in a bush or in-between businesses!)\n:heavy_check_mark:On-time start (I didn’t have to freeze an extra minute or 20)\n:heavy_check_mark:Accurately placed mile splits (didn’t have to question running a sub 4 minute mile then running a positive 9 minute the next!)\n:heavy_check_mark:Supportive crowds along the course (only one deranged Burnsider lady yelling weird stuff around mile 5.5)\n:heavy_check_mark:No bottle-necking with 3 races going on at the same time (people actually recognized I was a top finisher and no one got trampled by my stroller!)\nTerrapin Events had informed me they were getting the course USATF certified, which will also help make my case official.\n\nThe course – lots of turns, which seemed to be helpful for an ADD steeplechase runner like myself. It flew by. The variation helped in someways to keep me from being blasted by the wind or going up a hill for too long. It was relatively flat, but small ups\/downs with less than 50 feet til the final stretch (100 ft incline here). I was also a fan of crossing paths with a good portion of the 5K race- I have never in my life experienced that much cheering and love from other mom runners!\nMy splits  – \nMile – 6:00 (took off my jacket\/slowed to put in the bottom- didn’t want a homeless guy to pick up my fav BTC jacket!!)\n2 mile – 5:58 (with a slight wind; mostly flat, not too many turns)\n3 mile – 6:08 (heading into the twisty section with lots of bumpy uneven road- was cautious not to shake up baby Ruby too much!)\n4 mile – 6:21 (definitely felt some wind and my hips\/butt starting to really work!)\n5 mile- 6:19 (feeling strong, more turns, like “I’m working hard but never feel this good at mile 5 in a real 10K race”)\n6.2 miles – 7:27 (6:12 pace-threw off my rain cover, got dropped by 3rd overall male at the 6 mile mark, also likely because we were heading uphill and he did not want to be chicked\/strollered, the double sentence.. was worth it because I wanted Ruby to get some face time!)\nFinal time - 38:15  (6:09 per mile average)\nOfficial results – <https:\/\/www.athletepath.com\/run-like-hell\/2014-10-26\/10k>\nWide eyed Ruby definitely didn’t want to miss out and was far from asleep when I peaked in at her after the finish. Just like our first run, she took it all into stride, alert and intensely sucking on her binky, only to pass out from exhaustion once she returned home from her running adventure. \nI felt great and finished with more left in the tank which is a good thing. Honestly Warrior Dash was 3x as difficult  and most workouts my coach Jon Marcus subjects me to trying to keep up with speedy Kristen Rohde can be much tougher. See photo evidence of me looking like I am going to cry at about 2.75 miles in to the 3.2 mile Warrior Dash- ha! Run Like Hell thankfully I felt awesome, was definitely having a lot of fun and happy to easily beat my sub 40 \/top 5 female goal. I also know I need to have something to put on the line next week at my last Stumptown XC race before we head to AZ. Here I’ll once again get to face incredibly fit teammate Olivia Mickle. Let’s just say I want to have more than my last xc race where I basically was cashed out at 1K mark. Next Saturday-time to muster up all my strength and fly in the rain and mud to inspire my Westview boys who will be running at State later that afternoon!\nUntil I find a stroller friendly race to run with Joanie, I’ll gladly accept my 3",
                "fallback": "RunTeamWebb Link: Running a new stroller PR - 38:15 for 10K",
                "from_url": "http:\/\/runteamwebb.wordpress.com\/2014\/10\/26\/running-a-new-stroller-pr-3815-for-10k\/",
                "id": 1
            }
        ],
        "ts": "1414447144.000027"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Tripple Wow!",
        "ts": "1414447171.000030"
    },
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "ha",
        "ts": "1414447259.000031"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Maybe I'm too sensitive about this but I really dislike the fact that the article begins by listing the husband's record. As if she were an extension of him.",
        "ts": "1414447307.000032"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "interesting - I hadn't taken it like that, but i could see that POV",
        "ts": "1414447343.000033"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "i just read it as context-setting",
        "ts": "1414447415.000034"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "speaking of things i did know know were things <http:\/\/www.click2houston.com\/news\/lifelike-reborn-dolls-a-comfort-to-some-curiosity-to-others\/24872836>",
        "attachments": [
            {
                "service_name": "Click2Houston",
                "title": "Lifelike 'reborn' dolls a comfort to some, curiosity to others",
                "title_link": "http:\/\/www.click2houston.com\/news\/lifelike-reborn-dolls-a-comfort-to-some-curiosity-to-others\/24872836",
                "text": "They sound like the perfect babies: They don’t cry, they don’t get messy and they don’t wake you up in the middle of the night.",
                "fallback": "Click2Houston: Lifelike 'reborn' dolls a comfort to some, curiosity to others",
                "thumb_url": "http:\/\/www.click2houston.com\/image\/view\/-\/24355044\/highRes\/1\/-\/l18kl7\/-\/doll3-jpg.jpg",
                "from_url": "http:\/\/www.click2houston.com\/news\/lifelike-reborn-dolls-a-comfort-to-some-curiosity-to-others\/24872836",
                "thumb_width": 640,
                "thumb_height": 360,
                "id": 1
            }
        ],
        "ts": "1414447470.000035"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "I think it's just bad writing. You wouldn't being a story with \"Her.\" &lt;\/rant&gt;",
        "ts": "1414447479.000038"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<@U02618EV1>: I share your rant. Would have been better had they told the whole story, then tagged on an \"oh by the way, her husband kinda runs fast, too\"",
        "ts": "1414450153.000039"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "+1 <@U02E3CRMA>. AKA the inverted pyramid of journalism.",
        "ts": "1414450555.000040"
    }
]