[
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "Great and quick read, and something I always need to work on <https:\/\/medium.com\/@jasonfried\/give-it-five-minutes-b8115d6f2361>",
        "attachments": [
            {
                "service_name": "Medium",
                "title": "Give it five minutes",
                "title_link": "https:\/\/medium.com\/@jasonfried\/give-it-five-minutes-b8115d6f2361",
                "text": "I used to be a hothead. Whenever anyone said anything, I’d think of a way to disagree. I’d push back hard if something d…",
                "fallback": "Medium: Give it five minutes",
                "thumb_url": "https:\/\/cdn-images-1.medium.com\/max\/800\/0*iogT6QBu33BhVdzo.png",
                "ts": 1442278527,
                "from_url": "https:\/\/medium.com\/@jasonfried\/give-it-five-minutes-b8115d6f2361",
                "thumb_width": 240,
                "thumb_height": 240,
                "id": 1
            }
        ],
        "ts": "1442418424.000002"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "\"There are two things in this world that take no skill: 1. Spending other people’s money and 2. Dismissing an idea.\"",
        "ts": "1442418458.000004"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "very tempting to dismiss that",
        "ts": "1442418654.000005"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "<http:\/\/blog.piepdx.com\/2015\/09\/16\/its-time-for-a-new-flavor-of-pie\/>",
        "attachments": [
            {
                "service_name": "PIE Blog",
                "service_url": "http:\/\/blog.piepdx.com",
                "title": "It’s time for a new flavor of PIE",
                "title_link": "http:\/\/blog.piepdx.com\/2015\/09\/16\/its-time-for-a-new-flavor-of-pie\/",
                "author_name": "Rick Turoczy",
                "author_link": "https:\/\/blog.piepdx.com\/author\/turoczy\/",
                "text": "When Wieden+Kennedy collaborated with the Portland startup scene to make PIE a reality, it was an experiment. A way to test collaboration between the agency and startups. Truth be told, none of us foresaw it becoming an accelerator.\nBut that’s exactly what we became.\nAs such, PIE has spent five of the last six years building an accelerator program. Borrowing ideas from industry leaders like Y Combinator and Techstars — and imbuing them with a distinctly Portland flavor. In so doing, we created a platform that continues to explore how to help a wide range of startups and growth-stage companies. We found ways to collaborate with the largest privately held creative agency in the world — an agency with “Fail harder” built into its DNA — and the global brands that agency continues to attract as clients. We even had our share of exits with companies like AppThwack, Nutmeg, and Orchestrate.\nSo it seems to be working. And we’d like to think that these efforts have had a positive impact on the Portland startup scene. And maybe, even beyond. Hopefully, Portland feels the same way.\nSpeaking of Portland… wow. Good job, you! We’ve had an amazing vantage point to watch our once nascent startup scene grow, mature, and succeed. New companies. New support vehicles. New investments. And with that growth and maturity, things have changed. And many of the original challenges that PIE was designed to address have been overcome.\nBut, luckily, a whole new set of challenges have replaced them.\nAnd that got us thinking about the next phase of our experiment — and how PIE should evolve to tackle these new challenges.\nYou see, we don’t talk about this much, but when we began the accelerator experiment, we designed it with a limited lifespan — like a fund. Or like a Replicant. And with that three-class lifespan in mind, we ran the accelerator as efficiently as we could. Experimenting with our resources to see how much could be done with how little. And how efficiently our capital could be used to help startups and create value.\nWe did okay. It was neither a raving success nor a miserable failure. But it was a good experiment. That ran efficiently and effectively. We ran it so efficiently in fact, that instead of ending with the three classes we’d planned, we wedged in a fourth. And now, after a lot of late nights, intensive mentoring, tears, cheers, and four graduated classes, we are proud to have had a hand in supporting a diverse portfolio of companies and a dynamic pool of incredible mentors from around the world who continue to be connected to the Portland startup scene.\nPIE became an accelerator. Not because we planned it that way, but because we had to. Our proverbial gut said that it seemed like the right experiment to run at the time.\n \nBut it’s not that time anymore\n \nYou see, despite some pretty kick-ass results, PIE was never meant to be an accelerator. PIE was meant to be an incubator for on-going experiments.\nPIE incubates new ways for corporations and startups to work together. PIE tests how those with scale and resources can collaborate with innovators to create mutual value. PIE unlocks the tribal knowledge of entrepreneurial ecosystems to help build better founders — and help some of those founders (predominantly Portland founders) to be more successful. PIE fosters interesting services and technologies — and hopefully, makes it easier to start successful companies in Portland.\nPIE enables us to explore concepts. To put hypotheses to the test. To work. To try. To fail. To learn. And to have the wherewithal to get up and go at it again.\nFirst, as a coworking space. Then, as an accelerator.\nIn our current iteration, the easiest — and most straightforward — thing to do would be to continue running the accelerator as we’ve run it to date. Well, okay, not easy… but it would be us doing what we’ve gotten pretty decent at doing. With outcomes that would be relatively predictable.\nBut easy is not what we do.\nWe like to fix problems. We like to try new experiments. We like to make things difficult to make them interesting. Long story short, we like to start new things.\nAnd so, even though it’s going to be scary and messy and rife with uncertainty, it’s time for the next phase of the experiment.\nWe’re not changing everything, mind you. One thing will remain absolutely consistent: we’ll continue to strive to help Portland startups and the Portland startup scene. Because that’s what makes PIE, well, PIE.\nBut the fresh PIE — the new experiment — will be different. Familiar, but different. Because what’s needed now is different than when we began.\nWithout giving too much away, this new experiment will tackle how we provide the same type of assistance we’ve provided in the past. But this time, at scale. So we can help more than the handful of startups we traditionally welcomed into the space, every year. So we can help more and more founders. To find new ways to collaborate and create value. And help ensure that this amazing momentum that Portland has harnessed, continues. In Portland… and beyond.\nEven better? The next phase of the PIE experiment is already underway. You may have noticed some telltale signs of this next version of the experiment. Such as:\n\nOur on-going collaboration with organizations like Oregon Story Board, BREAKER, and the Startup PDX Challenge are an initial exploration into how local accelerators can collaborate more effectively. \nWe’re experimenting with sharing what we’ve learned through things like the content we’ve started creating on Medium and by talking to our peers about their challenges and opportunities. \nWe’re working to bring even more attention to the Portland startup scene through events like Portland Startup Week and the 1776 Challenge Cup. \nWe’re experimenting with ways to ensure that the Portland startup scene is even more connected with things like the Portland Startups Slack and the Portland Startups Switchboard. \n\nBut that’s just the beginning. There will be much, much more. Some of it will work. Some of it will fail miserably. Like any new thing, this is going to be messy and difficult. And full of highs and lows. And along the way, we’re likely to accidentally stumble into some awesome things we never really intended. Because this is — and will continue to be — the Portland Incubator Experiment.\nWe realize that this is a lot to digest. Undoubtedly, this will raise a few expletives. And probably some questions. Let’s cover the questions:\n \nFAQs\n \nWill there be an application period for a class, this year?\nNope. There will be no formal application for a new class this year. We are always interested in working with teams building amazing things, so please don’t be shy about reaching out to us. But we will be focusing our efforts on things beyond our traditional three-month accelerator program.\nBut let’s say that I was really hoping to go through an accelerator. What then?\nIf you’re seeking an accelerator program, the following applications are either open or opening soon:\n\nBeaverton Startup Challenge\nFounders Pad\nJaguar Land Rover Incubator\nStartup PDX Challenge\nTechstars Seattle\n\nHow can you help more startups without hosting a class?\nWhoa, nelly! Stay tuned.\nSo you’re never doing an accelerator again?\nNever say never. This is an experiment. We’re not ruling anything out. And we’re constantly re-evaluating PIE and its impact. We simply need our time and resources to be completely focused on the next phase of PIE at the moment. After that, who knows?\nIf you’re not going to do a class, how are you going to keep busy?\nDon’t you worry. We aren’t kicking back and taking a break. But we also haven’t hit “the big reveal” yet. One effort, for example, has us focused on assisting our portfolio companies —  helping us understand what growth stage startups need and how an accelerator might benefit that stage of startups. Another has been collaborating with other local and regional incubators and accelerators. Still another has been figuring out how the PIE model might be applied in other communities or industries. But there are a bunch of other things in the works, too.\nI see you work with other accelerators in Portland. Do you work with accelerators outside of Portland?\nMost definitely. PIE has been lucky enough to chat with accelerators and incubators from all over the world. If you’re running one of those programs or are thinking about starting one of those programs, please — by all means — get in touch with us.\nDo you have any podcasts you’d recommend?\nThat’s a really odd question. It’s almost like we asked you to ask that. But since you asked… we’re in the midst of starting up a podcast by accelerators, for accelerators. It might be worth a listen.\nI like Slack. How do I get invited to the Portland Startups Slack?\nSeriously? This is just starting to sound like one of those pseudo FAQs that folks make up. Fine. Just head over to the registration page. We’ll look forward to chatting with you.\nIs Wieden+Kennedy still involved with PIE?\nOh good. A serious question again. Finally. And the answer is yes, most definitely. W+K keeps looking to increase their impact on the startup ecosystem. And that’s another part of the “Experiment” — capital “E” — you’ll be hearing more about.\nIs this simply because you couldn’t come up with a PIE flavor that started with “e”?\nNo. For the Python (Monty, not the language) fans out there, “Elderberry” is waiting in the wings. (Fun Fact: PIE classes are designated by pie flavors, in alphabetic order. Like Android releases, but better.)\nMore soon.\nRenny &amp; Rick",
                "fallback": "PIE Blog Link: It’s time for a new flavor of&nbsp;PIE",
                "from_url": "http:\/\/blog.piepdx.com\/2015\/09\/16\/its-time-for-a-new-flavor-of-pie\/",
                "id": 1
            }
        ],
        "ts": "1442421419.000006"
    },
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "<@U0260V1BX> agreed and me too, thanks for sharing that!",
        "ts": "1442421790.000008"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "Good read! I find it funny people are commenting on specific paragraphs. Did they give it 5 minutes too?",
        "ts": "1442422742.000009"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "^ I didn't give that 5 minutes. clearly need practice.",
        "ts": "1442422765.000010"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "what if youtube comments had a 5 minute cooling off period",
        "ts": "1442422783.000011"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "7 day background checks",
        "ts": "1442422798.000012"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Interesting read on considerations for a certain subset of users with vertigo type disabilities: <http:\/\/alistapart.com\/article\/designing-safer-web-animation-for-motion-sensitivity>",
        "attachments": [
            {
                "title": "Designing Safer Web Animation For Motion Sensitivity",
                "title_link": "http:\/\/alistapart.com\/article\/designing-safer-web-animation-for-motion-sensitivity",
                "text": "Val Head suggests accessible animation techniques to avoid triggering dizziness in users with inner ear and balance disorders.",
                "fallback": "Designing Safer Web Animation For Motion Sensitivity",
                "thumb_url": "http:\/\/alistapart.com\/d\/ALA_428_Safer-Web-Animation.png",
                "from_url": "http:\/\/alistapart.com\/article\/designing-safer-web-animation-for-motion-sensitivity",
                "thumb_width": 1920,
                "thumb_height": 502,
                "id": 1
            }
        ],
        "ts": "1442426475.000013"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "For those that attended the auto layout talk: I figured out why the responsive breakpoint wasn't working: The priority of the width constraint (the constraint that was meant to break) had to be _below_ the compression resistance priority (750 at the time). I'm happy to show anyone what this means, but rest assured: responsive layouts _can_ work!",
        "edited": {
            "user": "U026PT0D7",
            "ts": "1442437948.000000"
        },
        "ts": "1442437930.000015"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "slides and demos will be uploaded shortly",
        "ts": "1442437964.000018"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "Auto Layout stuff on the NAS! uncorked &gt; Lunch &amp; Learn Presentations &gt; iOS\/OS X Auto Layout Talk. I know it technically wasn't Lunch &amp; Learn. If someone has a suggestion for a better place for it, I'm all ears!",
        "ts": "1442439133.000019"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "the Breakpoints demo is fixed as per above note, so anyone with Xcode should be able to run it as-is and see the responsive layout I was trying to describe.",
        "ts": "1442439166.000020"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "on these floor plans: the columns are spaced 9' on-center vertically and 13' on-center horizontally",
        "ts": "1442445283.000021"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "the two freestanding walls are 7'6\" wide",
        "ts": "1442445298.000022"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "The longer stretches of windows(?) are ~10'4\" long",
        "edited": {
            "user": "U026PT0D7",
            "ts": "1442445361.000000"
        },
        "ts": "1442445345.000023"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "thanks for the auto layout talk <@U026PT0D7> !!",
        "ts": "1442445382.000025"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "my pleasure! hope it was useful",
        "ts": "1442445429.000026"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "i mostly learned that all the times i’ve spec’d stuff in the past i’ve done it poorly because i didn’t understand the springs and struts thing… and now i’m glad that Xcode has caught up to the way that I typically spec things :simple_smile:",
        "ts": "1442445539.000027"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "wait <@U026PT0D7> is that based on the legend at the bottom?",
        "ts": "1442445769.000028"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "just pinned something to arya",
        "ts": "1442445817.000029"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "cause i stretched that printout so it was large enough to doodle on",
        "ts": "1442445827.000030"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "yes, i measured with a pocket scale and used the scale at the bottom of the",
        "ts": "1442445831.000031"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "oh",
        "ts": "1442445832.000032"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "and the key is wrong now",
        "ts": "1442445833.000033"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "26' between columns :confused:",
        "ts": "1442445845.000034"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "no worries!",
        "ts": "1442445846.000035"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "oh so does that mean the standing walls are more like 15’ wide?",
        "ts": "1442445875.000036"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "or do we know what the length\/width of the entire space is?",
        "ts": "1442445925.000037"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "might want to look at the architect drawing on the trello and tell the <#C091457Q9> channel what the answer is...i gotta go off to a preschool event. sigh.",
        "ts": "1442445952.000038"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "ok",
        "ts": "1442445958.000039"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "<http:\/\/www.nextportland.com\/wp-content\/uploads\/2015\/05\/811_stark_dz_dwg_03.jpg>",
        "attachments": [
            {
                "fallback": "2550x1650px image",
                "image_url": "http:\/\/www.nextportland.com\/wp-content\/uploads\/2015\/05\/811_stark_dz_dwg_03.jpg",
                "image_width": 2550,
                "image_height": 1650,
                "image_bytes": 211136,
                "from_url": "http:\/\/www.nextportland.com\/wp-content\/uploads\/2015\/05\/811_stark_dz_dwg_03.jpg",
                "id": 1
            }
        ],
        "ts": "1442446111.000040"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "nice!",
        "ts": "1442446606.000042"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "let's print a few and replace the 2nd floor ones",
        "ts": "1442446622.000043"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "ok",
        "ts": "1442446656.000044"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "on it",
        "ts": "1442446659.000045"
    },
    {
        "text": "GONG GONG GONG",
        "username": "bot",
        "type": "message",
        "subtype": "bot_message",
        "ts": "1442448393.000046"
    },
    {
        "text": "GONG GONG GONG",
        "username": "bot",
        "type": "message",
        "subtype": "bot_message",
        "ts": "1442448426.000047"
    },
    {
        "text": "GONG GONG GONG",
        "username": "bot",
        "type": "message",
        "subtype": "bot_message",
        "ts": "1442448457.000048"
    },
    {
        "text": "GONG GONG GONG",
        "username": "bot",
        "type": "message",
        "subtype": "bot_message",
        "ts": "1442448471.000049"
    },
    {
        "text": "GONG GONG GONG",
        "username": "bot",
        "type": "message",
        "subtype": "bot_message",
        "ts": "1442448475.000050"
    },
    {
        "text": "GONG GONG GONG",
        "username": "bot",
        "type": "message",
        "subtype": "bot_message",
        "ts": "1442448479.000051"
    },
    {
        "text": "GONG GONG GONG",
        "username": "bot",
        "type": "message",
        "subtype": "bot_message",
        "ts": "1442448487.000052"
    },
    {
        "text": "GONG GONG GONG",
        "username": "bot",
        "type": "message",
        "subtype": "bot_message",
        "ts": "1442448539.000053"
    },
    {
        "text": "GONG GONG GONG",
        "username": "bot",
        "type": "message",
        "subtype": "bot_message",
        "ts": "1442448814.000054"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "dope",
        "ts": "1442449043.000055"
    },
    {
        "text": "GONG GONG GONG",
        "username": "bot",
        "type": "message",
        "subtype": "bot_message",
        "ts": "1442449098.000056"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "\/giphy gong show",
        "attachments": [
            {
                "fallback": "giphy: <http:\/\/giphy.com\/gifs\/steve-martin-the-gong-show-13BaLv2bp88tzO>",
                "image_url": "http:\/\/media0.giphy.com\/media\/13BaLv2bp88tzO\/giphy.gif",
                "image_width": 500,
                "image_height": 352,
                "image_bytes": 517060,
                "title": "gong show",
                "id": 1,
                "title_link": "http:\/\/giphy.com\/gifs\/steve-martin-the-gong-show-13BaLv2bp88tzO"
            }
        ],
        "ts": "1442449390.000057"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "So sad we left ",
        "ts": "1442449448.000058"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "\/giphy chuck barris",
        "attachments": [
            {
                "fallback": "giphy: <http:\/\/giphy.com\/gifs\/the-gong-show-gene-patton-InKZtuwR1NXtC>",
                "image_url": "http:\/\/media4.giphy.com\/media\/InKZtuwR1NXtC\/giphy.gif",
                "image_width": 400,
                "image_height": 300,
                "image_bytes": 818018,
                "title": "chuck barris",
                "id": 1,
                "title_link": "http:\/\/giphy.com\/gifs\/the-gong-show-gene-patton-InKZtuwR1NXtC"
            }
        ],
        "ts": "1442450483.000059"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "ITS GENE GENE THE DANCIN MACHINEEEEEEE",
        "ts": "1442450499.000060"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "gong, but not forgotten",
        "edited": {
            "user": "U02E3CRMA",
            "ts": "1442460239.000000"
        },
        "ts": "1442460084.000002"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "oops. wrong channel...",
        "ts": "1442460090.000003"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "ios9 content blockers: THE HYPE IS REAL",
        "ts": "1442461203.000005"
    }
]