[
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Hey there <!channel> - \n\nHappy to share our initial case study for the Google Global Impact project that we recently launched with the Policy Team. While we're working with their team to put a formal case study together, this is a fantastic look behind the scenes of the great work that our team launched in the Google Partnerplex. \n\nPlease take some time to look over the work, especially if you're not already familiar with it. This is yet another product that we are able to talk about, and every word in this post has been cleared with the Google team. So please share! \n\nGreat work to all who were involved on what I know was an exceptionally difficult product to build. \n\n<http:\/\/www.uncorkedstudios.com\/work\/google-global-impact\/>",
        "attachments": [
            {
                "title": "A Renewed Space",
                "title_link": "http:\/\/www.uncorkedstudios.com\/work\/google-global-impact\/",
                "text": "Environmental design is practical and purposeful. The space that we are in and the information that we glean from it has a profound impact on our interpretation of the world. Which is why when we started a project to transform an existing exhibit space for Google’s Policy team, located in the Google Partner Plex in Mountain View, we began by looking at the environment, understanding how people interact with it, then deciding how to evolve it.",
                "fallback": "A Renewed Space",
                "from_url": "http:\/\/www.uncorkedstudios.com\/work\/google-global-impact\/",
                "service_icon": "https:\/\/www.uncorkedstudios.com\/images\/logo.png",
                "service_name": "uncorkedstudios.com",
                "id": 1
            }
        ],
        "edited": {
            "user": "U0265G76F",
            "ts": "1495130038.000000"
        },
        "ts": "1495129184.956905",
        "reactions": [
            {
                "name": "+1::skin-tone-2",
                "users": [
                    "U1HKQRLMR",
                    "U026NB2U2",
                    "U02HAJ6JF"
                ],
                "count": 3
            }
        ]
    }
]