[
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "Funny how :adidas: is OUTSIDE the Biketown coverage area",
        "ts": "1468954050.000051",
        "reactions": [
            {
                "name": "fu",
                "users": [
                    "U0J6TE0CA"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": ":shade:",
        "ts": "1468954102.000052"
    },
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "Got one out front if anyone wants to take a spin.",
        "ts": "1468954274.000053"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "How was it?",
        "ts": "1468960616.000054"
    },
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "I’m super biased because I love everything about bikeshares but it was great to ride a big ole beast again, and really love the shaft drive on them, the grips had that new grip grip, the shifter was nice and smooth. it took me a few minutes to find the bell because it’s so cleverly concealed in the left handle. But once I did, I was off and happily dinging, sitting up high in the saddle and feeling the wind in my face. Even in the biggest gear it was still an easy climb across the Tillikum. Fun bikes. The speeches etc. I could have done without; the Nike guy who talked a good 15 minutes of SKU-heavy corporate jargon replete with a Tinker H shout out (thanks for designing those shoes bro). Blumenauer and Novick were both pretty entertaining, the former in an aloha shirt. They even gave us a 30 minute coupon that I’ll happily offer to anyone who wants to take a free spin. That’s it. Reporting live from blah blah, signing off.",
        "ts": "1468964484.000055",
        "reactions": [
            {
                "name": "raised_hands",
                "users": [
                    "U02613K0X",
                    "U02F8TTPU",
                    "U0260V1BX"
                ],
                "count": 3
            }
        ]
    }
]