[
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<http:\/\/kitchenoverlord.com\/2015\/12\/03\/dune-week-spice-filled-sandworm\/>",
        "attachments": [
            {
                "service_name": "Kitchen Overlord",
                "service_url": "http:\/\/kitchenoverlord.com",
                "title": "Dune Week: Spice Filled Sandworm",
                "title_link": "http:\/\/kitchenoverlord.com\/2015\/12\/03\/dune-week-spice-filled-sandworm\/",
                "author_name": "Chris-Rachael Oseland",
                "author_link": "https:\/\/kitchenoverlord.com\/author\/chrisrachael\/",
                "thumb_url": "https:\/\/i2.wp.com\/kitchenoverlord.files.wordpress.com\/2014\/02\/sandworm-bread-03.jpg?fit=200%2C150",
                "thumb_width": 150,
                "thumb_height": 150,
                "text": "I have an entirely irrational love of David Lynch’s 1984 science fiction epic, Dune. (This is almost unrelated to my entirely rational and well thought out love of Frank Herbert’s Dune books. These two things should never be confused.) Maybe I saw it at just the right age to find Sting, black leather, and redheads seductive. Maybe it was the first big budget science fiction movie I’d seen where a woman who was just there to be a decorative prize actually bitched about how much her role in life sucked. Maybe giant sandworms made me think of David Bowie’s tights in Labyrinth. Regardless of the causes, something about the Lynch version made an indelible mark on my brain.\nFast forward a few years. I’m now a grownup with a kitchen of my very own and some lovely books to prove I’m officially Good At Food. The time has come for me to experiment at making my very own edible sandworm. The final result is even more delicious than it looks. Now, you too can make a proud, impressive, spice-scented Great Maker of Arrakis.\nSpice-Filled Sandworm Bread\nSANDWORM DOUGH:\n1 1\/2 cups warm water\n 2 tbsp yeast\n 1\/2 cup brown sugar\n 1 tsp vanilla\n 1 tbsp cinnamon\n 3 eggs\n ¼ cup slightly cooled melted butter\n 2 tsp salt\n 6 ½ – 7 cups bread flour\nSPICE FILLING:\n2 tbsp garam masala (or pumpkin pie spice, or Chinese five spice powder, by preference)\n2 tsp cinnamon\n 3\/4 cup brown sugar  (or 1\/2 cup brown sugar and 1\/4 cup white sugar if you want it less sticky)\n 1\/4 cup melted butter\n sliced blanched almonds\n 1\/2 cup raisins (optional)\nGLAZE:\n3\/4 cup powdered sugar\n ¼ cup water\n 1 tsp cinnamon or garama masala\n 1 tsp vanilla extract\n\nSo many things went wrong with my first sandworm that the Fremen threw me out of the sietch. Look at this monstrosity.\n\nNo. Just no. That looks like it belongs in Tremors.\nI spent a little time in the city serving those soft, water-fat lords from Caladan. When I couldn’t take that anymore, I wandered the desert in search of a vision. Shai Hulud himself came to me and spoke with his spice scented breath, giving me visions of proper tributes to him both in bread and in pie.\nBehold and learn.\n\nDIRECTIONS:\nFirst, mix the yeast and warm water. Let the yeast blossom like a sand storm in the desert. After ten minutes, add the brown sugar, vanilla, cinnamon, salt, and eggs. Whisk it all together until your bowl starts to smell like stale spice wine.\nAdd half the flour. Top that off with the melted butter. You may think you want to add the melted butter to the liquids, but you’re wrong. The heat will destroy your yeast as surely as a spice mining platform attracts a worm. Top it off with the rest of the flour.\nThis part may seem dangerous, but if you own a stand mixer, set it to 2 and let it go for six or seven minutes. Try to break the rhythm by pausing at random times to scrape the sides. It’s far safer to mix everything up by hand then knead it for a good 10 minutes at a random, uneven pace.\nForm the spice dough into a ball. Put it in a well greased bowl, cover it with a clean kitchen towel, and let it rise for an hour, or until the size doubles.\n\nWhen you come back, punch it like a fat Harkonen.\nSpread some extra flour on a clean surface and roll the dough out into a large rectangle.\nPaint the dough with your melted butter, leaving at least 1 inch of clear space around the edges.\nThe last time I made a sandworm, I tried neatly arranging the almonds into teeth facing outwards. It wasn’t awful, but that worm looked more like it should be terrorizing a desert town in Tremors instead of riding majestically across the desert. The problem was when the dough rose, it pushed all the teeth outwards and upwards.\nI learned from that mistake. This time, I spiked the first inch or so of my sandworm’s mouth with almonds pointing up, but angled ever so slightly outwards.\n\nEvenly sprinkle on your cinnamon, choice of spice, and sugar. You can pre-mix them if you’d like, or you can just lightly massage it all into the butter using your fingertips.\nIf you like raisins, toss some on top. I usually make my sandworms half and half, with pure spice up front and some raisins in the tail end.\n\nIn addition, instead of rolling the worm tight, I made sure it was loose, almost floppy. If you roll a bread too tight, it’ll push outwards, malforming the shape. Give it room to grow.\n\nOnce I had a fat, toothy sandworm, I put it on a pizza tray covered in parchment paper, gave the body some slithery kinks, sliced ridges into its back, and let it grow. I also balled some aluminum foil into a cone and kept that in the Great Maker’s mouth so he’d have an intimidatingly toothy gape after being baked.\n\nAll that was left to do was whisk a teaspoon of vanilla with an egg (the vanilla makes your kitchen smell amazing), paint the Great Maker’s back, and bake it at 350F for 25 minutes.\n\nAs soon as it emerged from the oven, I anointed its flesh in glaze so the flavor could penetrate the outer skin.\nBehold! The sleeper has awakened!\n\nAfter your friends take their Pintrest shots, treat it like a baby worm you’re melting into the Water of Life. Wait, don’t. Soaking it in a puddle won’t help the flavor. Instead, cut it into rings and drizzle a little more glaze on each slice.\nIf only fat, sugar, and carbs could extend life and broaden the mind without an infusion of the spice melange.\n\n\nNeed more nerdy carbs in your life? Kitchen Overlord’s GEEK BREADS is coming soon! \nClick here to pre-order a signed copy!\n\n\nNeed More Dune Recipes?\nKitchen Overlord’s Illustrated Geek Cookbook includes fast &amp; easy spice stuffed sandworms plus nerdy recipes from 50 other fandoms.\n\nOr check out the links below for even more Dune themed recipes!\n\nSpice Stuffed Squash Sandworms\nSpice Filled Sandworm Bread\nSandworms Swimming in a Spice Patch\nSandworm Wellington\nSandworm Spice Cookies\nTabara Cake and Spice Tea\nSandworm Crudites\nSandworm Cake Roundup\nVintage Dune Coloring Pages for Nihilistic Children\n \n\nWalk without rhythm and you won’t attract the worm… but you might attract Christopher Walken.\n\t\t\n\t\t\t0.000000\n\t\t\t0.000000",
                "fallback": "Kitchen Overlord Link: Dune Week: Spice Filled&nbsp;Sandworm",
                "from_url": "http:\/\/kitchenoverlord.com\/2015\/12\/03\/dune-week-spice-filled-sandworm\/",
                "id": 1
            }
        ],
        "ts": "1449362935.000002"
    }
]