[
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "This (apeel) is rad <http:\/\/a16z.com\/2016\/12\/13\/apeel\/>  <http:\/\/apeelsciences.com\/>",
        "attachments": [
            {
                "service_name": "Andreessen Horowitz",
                "service_url": "http:\/\/a16z.com",
                "title": "Apeel",
                "title_link": "http:\/\/a16z.com\/2016\/12\/13\/apeel\/",
                "author_name": "kimata16zdotcom",
                "author_link": "https:\/\/a16z.com\/author\/kimata16zdotcom\/",
                "thumb_url": "https:\/\/i1.wp.com\/s0.wp.com\/wp-content\/themes\/vip\/a16z-2015\/static\/images\/a16z-logo.png?fit=200%2C150&ssl=1",
                "thumb_width": 194,
                "thumb_height": 15,
                "text": "Much of our current food system is broken. Food production is an enormous part of our economy, requiring 10% of the US&rsquo;s power, 50% of our land, and 80% of our freshwater &mdash; and yet 40% of our food goes uneaten at the same time that many go hungry. Each day massive amounts of fruits and vegetables are wasted at every stage of the process, from growers to the store to the home. Reducing food waste by just 10% would feed millions at a time when one in six Americans are struggling to put food on the table. And the problem of food waste is only amplified worldwide, where natural spoilage is a $1T problem.\nThe need to address this is abundantly clear.\nUntil now, however, we&rsquo;ve had to rely on a centuries-old technique to slow spoiling produce: wax coatings. But wax is a blunt tool: It cannot handle the delicate biological balance between slowing down the respiration of fruit so it lasts longer, and the potential risk of asphyxiation, which also ruins the fruit. Enter Apeel, who are using advances in nanoscience to change something very, very small &mdash; and very powerful. By applying these advances (previously principally the domain of materials science applications), Apeel has developed a nano-scale, invisible, safe, and edible barrier that keeps fruit and vegetables from spoiling by slowing down the natural respiration of the fruit.\nSo what does it mean to apply nanoparticles to our fruit? And where does this barrier come from? The beauty of Apeel&rsquo;s product is that it is entirely produced from an FDA-approved food that we are already eating: plant material. Apeel uses the agricultural waste we&rsquo;re now throwing away &mdash; peels, rinds, the leftovers of the system &mdash; to create an invisible barrier that can be tailored to meet the unique needs of an enormous range of fruits and vegetables.\nApeel CEO and founder James Rodgers, who comes out of the University of California, Santa Barbara&rsquo;s world-renowned materials science department, embodies the company&rsquo;s unique blend of deep technical knowledge combined with a passion for changing the world. While driving through the farmland of California, James was struck by the potential impact that his materials science expertise could have in (so to speak) the field.\nRevolutionizing how food is kept from spoiling by using the tiniest of particles will indeed have profound consequences and broad applications for our entire food ecosystem. This technology lowers cost for everyone involved, from growers to distributors to supermarkets to consumers, thereby making fruits and vegetables more accessible to all. It opens up new markets for fruits and vegetables in far reaching places &mdash; allowing, for example, avocados to ship to China from South America, or previously unknown varietals in Asia to reach American supermarkets. It also improves our diets and health by&nbsp;introducing more produce at lower costs in more places through adding new and bigger markets to local producers.\nBut potentially, the greatest and most powerful impact will be on world hunger. As our ability to ship food to places in need grows, supply chains are simplified by in many cases eliminating the need for cold storage. With the ability to keep produce edible longer, there will be less waste, and more food to eat. It&rsquo;s as simple as that.\nFor all of these reasons, we are proud to announce our investment in Apeel, leading their series B round; I&rsquo;ll be taking a board seat. A strategy of ours is to invest in truly major scientific breakthroughs, and Apeel&rsquo;s use of nanoscience as applied to our most basic human need is exactly that. We&rsquo;re very excited to partner with James and the Apeel team to bring this vision to market and fundamentally change food for the world.",
                "fallback": "Andreessen Horowitz Link: Apeel",
                "from_url": "http:\/\/a16z.com\/2016\/12\/13\/apeel\/",
                "service_icon": "http:\/\/0.gravatar.com\/blavatar\/028155d40793d8c2f7fd77a3b55ac924?s=114",
                "id": 1
            }
        ],
        "ts": "1481654752.000112"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "<https:\/\/instagram.com\/p\/BN_FtzRj7av\/>",
        "attachments": [
            {
                "service_name": "Instagram",
                "title": "Instagram video by J. Kenji López-Alt • Dec 14, 2016 at 5:26am UTC",
                "title_link": "https:\/\/instagram.com\/p\/BN_FtzRj7av\/",
                "text": "See this Instagram video by @kenjilopezalt • 456 likes",
                "fallback": "Instagram: Instagram video by J. Kenji López-Alt • Dec 14, 2016 at 5:26am UTC",
                "image_url": "https:\/\/scontent.cdninstagram.com\/t51.2885-15\/e15\/14591897_1262520697120573_8977874635383111680_n.jpg?ig_cache_key=MTQwNDg2Njc0NjQyNzM1Njg0Nw%3D%3D.2",
                "from_url": "https:\/\/instagram.com\/p\/BN_FtzRj7av\/",
                "image_width": 250,
                "image_height": 250,
                "image_bytes": 50151,
                "service_icon": "http:\/\/instagramstatic-a.akamaihd.net\/h1\/images\/ico\/apple-touch-icon-76x76-precomposed.png\/932e4d9af891.png",
                "id": 1
            }
        ],
        "ts": "1481698080.000114"
    }
]