[
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "A new train of thought! ",
        "ts": "1464879382.000091"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "<http:\/\/luckypeach.com\/stargrazing-june-2016\/>",
        "attachments": [
            {
                "service_name": "Lucky Peach",
                "title": "Stargrazing: Food Horoscopes for June 2016",
                "title_link": "http:\/\/luckypeach.com\/stargrazing-june-2016\/",
                "text": "Let the stars guide your food this month.",
                "fallback": "Lucky Peach: Stargrazing: Food Horoscopes for June 2016",
                "image_url": "http:\/\/luckypeach.com\/wp-content\/uploads\/2016\/06\/PaigeMehrer-300x200.jpg",
                "ts": 1464861841,
                "from_url": "http:\/\/luckypeach.com\/stargrazing-june-2016\/",
                "image_width": 300,
                "image_height": 200,
                "image_bytes": 29565,
                "service_icon": "http:\/\/luckypeach.com\/wp-content\/themes\/luckypeach\/xapple-icon-57x57.png.pagespeed.ic.GILNzmrur2.png",
                "id": 1
            }
        ],
        "ts": "1464885785.000092"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "<http:\/\/techcrunch.com\/2016\/06\/02\/selfie-shrug-rofl-face-palm-whiskey-clowns-and-more-among-new-emoji-arriving-in-june\/?ncid=rss> - MOTHERFUTON WHISKEY EMOJI!",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "Selfie, Shrug, ROFL, Face Palm, Whiskey, Clowns and more among new emoji arriving in June",
                "title_link": "http:\/\/techcrunch.com\/2016\/06\/02\/selfie-shrug-rofl-face-palm-whiskey-clowns-and-more-among-new-emoji-arriving-in-june\/?ncid=rss",
                "author_name": "Sarah Perez",
                "thumb_url": "https:\/\/i1.wp.com\/tctechcrunch2011.files.wordpress.com\/2016\/06\/unicode-9-emojis-emojipedia.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 199,
                "thumb_height": 91,
                "text": "New emoji are coming! The organization that approves new emoji before they hit your keyboard has just announced 72 more&amp;nbsp;emoji which will be added to the Unicode standard (Unicode 9.0) later this month. This selection includes several fun additions, including those reflective of internet slang &amp;ndash; for example, Rolling on the Floor Laughing &amp;ndash; which has its roots in the acronym&amp;nbsp;ROFL &amp;ndash; is one of the upcoming emoji and shows a tilted smiley face with a wide mouth and closed eyes. Another surely popular addition will be the shrug, which people tend today to type out with&amp;nbsp;symbols like&amp;nbsp;&amp;macr;_(&amp;#12484;)_\/&amp;macr;.\nPlus there is a&amp;nbsp;clown face, a Pinocchio-like lying face with a growing nose, a cowboy, and several &amp;ldquo;sick&amp;rdquo; faces like a green nauseated face, a sneezing face, and a drooling face (which looks more sick than salivating.).\n\nAmong the people additions, the notable new arrivals will include a woman with a child, a dancing man that looks like Saturday Night Fever&amp;rsquo;s John Travolta, a guy in a tux, a face palm, and the aforementioned shrug.\n\nFor hand gestures, we&amp;rsquo;re at last&amp;nbsp;getting the crossed fingers emoji, as well as handshakes, fist bumps, and a raised arm with a phone in hand for the &amp;ldquo;selfie&amp;rdquo; emoji, among other things.\n\nThere are also a number of new animals and food items, including the timely add of a gorilla, plus deer, fox, lizard, shark, butterfly, and more, plus tasty bacon and baguettes, pancakes, and salad (if you&amp;rsquo;re being good), to name just a few.\n\nOh, and yes: there&amp;rsquo;s now finally a whiskey glass for those days when a beer mug or martini simply doesn&amp;rsquo;t reflect your drink of choice. (Aka: every day.)\n\nThere are also a ton more sports and travel options, like mopeds and scooters, karate, fencing, boxing, handball, wrestling, juggling, gymnast, and even water polo&amp;hellip;because&amp;hellip;uh, well I&amp;rsquo;m sure someone plays water polo and was tired of typing that out. Oh and&amp;nbsp;hey, the Summer Olympics are coming!\nThe new gold, silver and bronze medals will be handy for that, too.\n\nThis is only a partial list with some of&amp;nbsp;the highlights, but you can browse the full list of new emoji here on the <http:\/\/Unicode.org|Unicode.org> website.\nOne thing that you won&amp;rsquo;t see in the new standard? More diverse emoji.&amp;nbsp;Unicode had already rolled out an update that&amp;nbsp;includes a skin tone modifier, but it still features a lot of male characters in job and sports roles &amp;ndash; something where it would be nice to at least choose from a man or a woman.\nOther companies are also working to diversify their emoji. Facebook this week introduced new emoji to better reflect skin tones and gender, along with more emoji of females &amp;ndash; including as a police officer, runner, surfer, pedestrian, and a swimmer. Google employees, meanwhile, have submitted a proposal to the Unicode Consortium asking them to add 13 new emoji that highlight &amp;ldquo;the diversity of women&amp;rsquo;s careers,&amp;rdquo; featuring women working as doctors, scientists, in the technology industry and more.\nHowever, before you get your hopes up too much about all these new characters: although the Unicode Consortium will approve&amp;nbsp;these new emoji in the Unicode 9.0 on June 21, 2016, that doesn&amp;rsquo;t mean that&amp;rsquo;s when they&amp;rsquo;ll arrive in emoji keyboard on your phone.\nAfter that point, smartphone makers like Apple, Google and Microsoft can use add the new emoji into their own software. They then have to release that to the public via a software update.\nMain image: mock-up from Emojipedia; remaining from <http:\/\/Unicode.org|Unicode.org>",
                "fallback": "TechCrunch Link: Selfie, Shrug, ROFL, Face Palm, Whiskey, Clowns and more among new emoji arriving in&nbsp;June",
                "from_url": "http:\/\/techcrunch.com\/2016\/06\/02\/selfie-shrug-rofl-face-palm-whiskey-clowns-and-more-among-new-emoji-arriving-in-june\/?ncid=rss",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/techcrunch-2013\/assets\/images\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1464886410.000094"
    }
]