[
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "<http:\/\/www.chkchk.com\/>",
        "ts": "1454438054.000002"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Yum",
        "ts": "1454438151.000003"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Tho that sandwich looks questionably constructed",
        "ts": "1454438157.000004"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<http:\/\/kitchenoverlord.com\/2013\/08\/15\/settlers-of-the-noms-personalized-nacho-board\/>",
        "attachments": [
            {
                "service_name": "Kitchen Overlord",
                "service_url": "http:\/\/kitchenoverlord.com",
                "title": "Settlers of the Noms: Personalized Nacho Board",
                "title_link": "http:\/\/kitchenoverlord.com\/2013\/08\/15\/settlers-of-the-noms-personalized-nacho-board\/",
                "author_name": "Chris-Rachael Oseland",
                "author_link": "https:\/\/kitchenoverlord.com\/author\/chrisrachael\/",
                "thumb_url": "https:\/\/i0.wp.com\/kitchenoverlord.files.wordpress.com\/2013\/08\/nacho-board.jpg?fit=200%2C150",
                "thumb_width": 200,
                "thumb_height": 110,
                "text": "There are nearly 200 recipes in Wood for Sheep: The Unauthorized Settlers Cookbook, but this is my favorite of the easy edible boards. If you’re barely comfortable in that room with the hot box, the cold box, and the sharp objects, you can still host a kick ass game night that’ll impress all your friends, because this barely requires any cooking.\nThe hardest part is finding the ocean of hex shaped blue corn chips from the brand Food Should Taste Good. My regular grocer doesn’t stock them, but they’re a staple at health food and\/or schmancy food stores. While they cost a little more than your average blue corn chips, the hex-tastic shape makes them well worth it for the sake of Settlers Nachos.\nLet’s be honest. Gamers are both notoriously picky eaters with an uncanny ability to roll a critical hit for every food allergy known to man. That’s a big part of the inspiration behind a Settlers of Catan themed cookbook. Whenever I get people together for an afternoon of gaming, there’s an awkward moment when one generous person offers to buy pizza. Whoops. Somebody at the table says that’s really nice, but they’ll have to bow out because they’re lactose intolerant and they’re not about to inflict a cheeseless pizza on the whole group. Another person says that’s okay, they have a nitrate allergy and can’t eat processed meats, so no pizza for them, either. A third pops up and says they didn’t want to make a big deal about it, but they’ve stopped eating gluten for the sake of their health. You can’t get four nerds together without discovering five things wrong with their digestive systems.\nThe Settlers of the Nacho Bar is my answer to to the simple struggle of trying to buy a pizza for your friends who are allergic to everything. It’s dirt simple to make this into something your gluten free, lactose intolerant, vegetarian friends can all eat. It’s simple to make (the only thing you need to cook is the taco meat for the mountains), super customizable, and looks awesome.\nFor those of you who can’t wait for the cookbook, here are the quick and dirty steps to making sure all your friends can eat together.\n\nMake sure you have gluten free blue corn tortilla chips (might as well get that ocean color in there) and this board works great for Celiac or wheat allergic players.\nLactose intolerant players can make theirs without cheese, or you can generously pick up some soy\/almond\/rice fake cheese.\nSince the meat is in its own separate dish, vegetarians can easily leave it off entirely when assembling their nachos. Heck, if you’ve got vegans coming over, pick up the vegan sausage crumbles in your frozen food aisle and a bag of cheese alternative (which they can share with any lactose intolerant players) and designate a special mountain and field just for them.\nGrab some grain-free all-nut cracker alternatives and you’ll even have something your Paleo friends can enjoy!\n\nI hope this makes it easier to enjoy game nights with ALL your friends!\n\nTo assemble the nachos, just throw a hearty handful of chips in the bottom of whatever spare pans you have around. (I use 9 inch round cake pans, but square baking dishes or cookie sheets also work just fine.) Pile on your toppings (meat first, cheese last works best) and throw them under the broiler for 2-3 minutes. There’s a fine line between melty cheese goodness and horrifying burnt dairy, so keep an eye on the nachos as they cook. That last 15 seconds makes all the difference.\nA nacho bar is cheaper than pizza, easy to customize, and best of all, comes in convenient hex shapes while representing all the colors of a Catan board. What more could you want for a Sunday afternoon gaming snack?\n\nCovet those hex shaped dishes?\n\nFind those and more in our post on 7 Tasty Ways to Level Up Your Catan Night\n\nNeed more Catan-Tastic Goodness?\nYou can find recipes for much more complicated theme food in Wood for Sheep: The Unauthorized Settlers Cookbook.\nMeanwhile, check out more cookbook preview posts:\nSettlers of Catan Breakfast Bar\nSettlers of the Mediterranean (Map)\nSettlers of the Quick Breads\nWelcome to South Catan Y’all\nSettlers of the Cold Salad\nAll-American Meatloaf Map\nPersonalized Settlers Nacho Bar\nSettlers of Catan City Pot Pies\nSettlement of Catan Basil and Mozzarella Bites\n\n\t\t\n\t\t\t0.000000\n\t\t\t0.000000",
                "fallback": "Kitchen Overlord Link: Settlers of the Noms: Personalized Nacho&nbsp;Board",
                "from_url": "http:\/\/kitchenoverlord.com\/2013\/08\/15\/settlers-of-the-noms-personalized-nacho-board\/",
                "id": 1
            }
        ],
        "ts": "1454475011.000010"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "trying to make nachos clever RUINS NACHOS",
        "ts": "1454475162.000012"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "but looks cool",
        "ts": "1454475170.000013"
    }
]