[
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "<https:\/\/techcrunch.com\/2017\/02\/06\/anova-electrolux\/?ncid=rss&amp;utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+Techcrunch+%28TechCrunch%29>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "Sous Vide startup Anova gets acquired by appliance giant Electrolux",
                "title_link": "https:\/\/techcrunch.com\/2017\/02\/06\/anova-electrolux\/?ncid=rss&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Techcrunch+%28TechCrunch%29",
                "author_name": "Brian Heater",
                "thumb_url": "https:\/\/i2.wp.com\/tctechcrunch2011.files.wordpress.com\/2015\/08\/anova-environmental-6-cropped.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 125,
                "text": "Sous vide Kickstarter darling Anova announced over the weekend that Swedish appliance giant Electrolux has agreed to purchase the cooking hardware startup for $250 million.\nThe Anova brand will remain intact under the deal, retaining its name and the leadership of co-founder and CEO Stephan Svajian, existing&nbsp;as a part of the larger Electrolux umbrella.\n&ldquo;With Electrolux, we&rsquo;ll have the resources and reach to continue to change the way people cook,&rdquo; Svajian writes in the post. &ldquo;Electrolux is committed to helping Anova continue its mission of building the Anova Kitchen&#8202;&mdash;&#8202;a kitchen where devices are precise, dead-simple to use, affordable, and connected in a meaningful way to help people cook like pros every day.&rdquo;\n\nSvajian told TechCrunch on a call today that the move cements Electrolux&rsquo;s interest in the connected kitchen as part of the smart home hub.&nbsp;&ldquo;There&rsquo;s a very strong value set between the two companies,&rdquo; he explained. &ldquo;We&rsquo;re super impressed by their commitment to keep us autonomous and invest in this new strategic direction.&rdquo;\nThe company&rsquo;s history dates back to 2013, launching a Kickstarter campaign the following year, and raising $1.8 million in the process. Anova has kept plenty busy since then. Last year it released a second generation of its cooker, this time with Bluetooth\/WiFi functionality and this past CES the company announced plans to release a lower cost version.\nSvajian told TechCrunch that the company is sticking to its plans, but added, &ldquo;we&rsquo;re not allowed to comment on future products at this point.&rdquo;\n&nbsp;\n&nbsp;",
                "fallback": "TechCrunch Link: Sous Vide startup Anova gets acquired by appliance giant&nbsp;Electrolux",
                "from_url": "https:\/\/techcrunch.com\/2017\/02\/06\/anova-electrolux\/?ncid=rss&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Techcrunch+%28TechCrunch%29",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/techcrunch-2013\/assets\/images\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1486423892.000484"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "huh",
        "ts": "1486424430.000486"
    },
    {
        "type": "message",
        "user": "U3M4RRNQ5",
        "text": "$250MM for a limited application kitchen appliance eh?",
        "ts": "1486426276.000487"
    },
    {
        "type": "message",
        "user": "U3M4RRNQ5",
        "text": "that must be some pretty great industrial design they want",
        "ts": "1486426303.000488"
    }
]