[
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "<http:\/\/lewisandquark.tumblr.com\/post\/140508739392\/the-neural-network-has-weird-ideas-about-what>",
        "attachments": [
            {
                "service_name": "Postcards from the Frontiers of Science",
                "title": "The neural network has weird ideas about what humans like to eat",
                "title_link": "http:\/\/lewisandquark.tumblr.com\/post\/140508739392\/the-neural-network-has-weird-ideas-about-what",
                "text": "So I’ve been training this neural network to generate cookbook recipes by letting it look at tens of thousands of existing recipes. The generated titles can get a bit odd. There’s a creativity variable I can set when the network is generating new recipes, and when I set it low, it comes up with its best guess at the most quintessential recipe titles: Cream Cheese Soup Cream Of Sour Cream Cheese Soup Chocolate Cake (Chocolate Cake) Chocolate Chocolate Chocolate Cake Chocolate Chicken Chicken Cake Chocolate Chocolate Chocolate Chocolate Cake Chocolate Chips Chocolate Chips With Chocolate Chips When I tell it to get creative, things get even weirder. Beef Soup With Swamp Peef And Cheese Chocolate Chops &amp; Chocolate Chips Crimm Grunk Garlic Cleas Beasy Mist Export Bean Spoons In Pie-Shell, Top If Spoon and Whip The Mustard Chocolate Pickle Sauce Whole Chicken Cookies Salmon Beef Style Chicken Bottom Star * Cover Meats Out Of Meat Completely Meat Circle Completely Meat Chocolate Pie Cabbage Pot Cookies Artichoke Gelatin Dogs Crockpot Cold Water",
                "fallback": "Postcards from the Frontiers of Science: The neural network has weird ideas about what humans like to eat",
                "from_url": "http:\/\/lewisandquark.tumblr.com\/post\/140508739392\/the-neural-network-has-weird-ideas-about-what",
                "service_icon": "http:\/\/68.media.tumblr.com\/avatar_87ba58d63414_128.png",
                "id": 1
            }
        ],
        "ts": "1490841107.433345"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "I, for one, welcome our new AI overlords 🤢",
        "ts": "1490844369.802179"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": ":robot_face:  Kill all humans  :robot_face: ",
        "edited": {
            "user": "U0K8ZSHN0",
            "ts": "1490848845.000000"
        },
        "ts": "1490848813.245390"
    }
]