[
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "made this yesterday minus whatever ingredients I didn’t have on hand (caraway, used powdered cumin, no mint) - pretty delicious <https:\/\/smittenkitchen.com\/2010\/05\/carrot-salad-with-harissa-feta-and-mint\/>  did not follow the recipe, just mixed everything into a dressing.",
        "attachments": [
            {
                "service_name": "smitten kitchen",
                "service_url": "http:\/\/smittenkitchen.com",
                "title": "carrot salad with harissa, feta and mint",
                "title_link": "https:\/\/smittenkitchen.com\/2010\/05\/carrot-salad-with-harissa-feta-and-mint\/",
                "author_name": "deb",
                "author_link": "https:\/\/smittenkitchen.com\/author\/debsk\/",
                "thumb_url": "https:\/\/i1.wp.com\/smittenkitchendotcom.files.wordpress.com\/2010\/05\/carrot-salad-with-harissa-feta-mint.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 199,
                "thumb_height": 133,
                "text": "There&rsquo;s nothing better than a recipe that gives you a feeling of promise, especially when it involves something as mundane as carrots. Yes, carrots. I mean, just when I thought I&rsquo;d done everything worth doing with carrots &mdash; shredding them into my favorite carrot salad, pickling them, roasting them for an avocado salad, grinding them into a ginger dressing, grating them into Indian vegetable pancakes &mdash; a reader (Hi, Sasa!) came along, emailed me her favorite carrot recipe and with one look, I knew exactly what my carrot routine was missing.\n\n\nIt turned out to be a lot of things (fortunately, none of them were striped socks), actually, but small things: paprika, caraway, cumin, harissa, mint, garlic, parley and also feta. The carrots are grated, the spices are heated with a pinch of sugar in olive oil, whisked with lemon juice and poured warm over the carrots, with minced mint and parsley &mdash; think North African pesto. You let the flavors muddle for a bit and then you add feta. And I know this is when I should say &ldquo;You can eat it with lamb! At a picnic! With skewers off the grill and pitas!&rdquo; But honestly, I just ate it with a fork. Because this salad is fascinating.\n\nCarrots (carrots!) (I&rsquo;m sorry, I have to do that parentheses thing every time because I myself can hardly believe that a bundle of carrots can generate such excitement.) are hot, spicy, punchy with lemon, salty with crumbled cheese, bright and minty, green and fresh. This is the exact kind of thing I always wished I had waiting for me when I would try to pack lunch for the office, instead of the same old leftovers or deli counter dry turkey sandwich &mdash; not just a salad but a welcome break from routine. Even carrots deserve that once in a while, and so do you.\n\nOne year ago: Asparagus Goat Cheese and Lemon PastaTwo years ago: Mushroom StrudelThree years ago: Baked Eggs + Chive Biscuits + Bloody Marys\n\t\n\n\t\nCarrot Salad with Harissa, Feta and Mint\nAdapted a bit from a reader, who adapted it from her mother, who adapted, most likely, she said, from Cuisine Magazine\n3\/4 pound carrots, peeled, trimmed and coarsely grated\n4 tablespoons olive oil\n1 crushed clove of garlic\n1\/2 teaspoon caraway seeds or about half as much, ground (I used seeds but ground them first)\n3\/4 teaspoon cumin seeds or about half as much, ground (I used the seed but ground them first, again)\n1\/2 teaspoon paprika\n3\/4 teaspoon harissa (for a solid kick of heat; adjust yours to taste, and to the heat level of your harissa)\n1\/2 teaspoon sugar\n3 tablespoons lemon juice\n2 tablespoons flat leaf parsley, finely chopped\n2 tablespoons fresh mint, finely chopped\n100 grams feta, crumbled or chopped into bits\nIn a small saut&eacute; pan, cook the garlic, caraway, cumin, paprika, harissa and sugar in the oil until fragrant, about one to two minutes. Remove from heat and add the lemon juice and a pinch of salt. Pour over the carrots and mix. Add the herbs and mix. Leave to infuse for an hour and add the feta before eating. With a fork.\nHarissa: Is a North African chile paste that has become so popular, we were tickled to find it all over tables in Paris two years ago, right next to the Dijon mustard. There is almost nothing it doesn&rsquo;t make more delicious: eggs, potatoes, stews, couscous, sandwiches and more, and there are almost as many recipes as there are people who consume it. Most boil down to hot chiles ground with garlic, cumin, coriander, caraway and olive oil, often with a smidge of sundried tomatoes. You can make your own (I&rsquo;ve been eying this recipe for some time) or you can buy some (I brought home this brand, which we love). The adavantage of making your own, as always, is that you can adjust the recipe to suit your tastes and desired level of heat.",
                "fallback": "smitten kitchen Link: carrot salad with harissa, feta and&nbsp;mint",
                "from_url": "https:\/\/smittenkitchen.com\/2010\/05\/carrot-salad-with-harissa-feta-and-mint\/",
                "service_icon": "https:\/\/secure.gravatar.com\/blavatar\/eaeb269fafc68519dd2c6677a39820df?s=114",
                "id": 1
            }
        ],
        "edited": {
            "user": "U0260V1BX",
            "ts": "1484334589.000000"
        },
        "ts": "1484333866.000341"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "Flying Fish on Hawthorne is selling off everything they have tomorrow including equipment (\"Refrigerators, freezers (large and small), chest freezers, tables, racks, storage, kitchen supplies... name your price.”)  All frozen fish, meat, and sausage is 50% off.",
        "ts": "1484334014.000344"
    },
    {
        "type": "message",
        "user": "U243UT96G",
        "text": "woah",
        "ts": "1484358161.000347"
    }
]