[
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "Urick part two: <https:\/\/firstlook.org\/theintercept\/2015\/01\/14\/exclusive-serial-prosecutor-defends-guilty-verdict-adnan-syed-case-part-ii\/>",
        "attachments": [
            {
                "service_name": "The Intercept",
                "title": "Exclusive: Serial Prosecutor Defends Guilty Verdict in Adnan Syed case, Part II - The Intercept",
                "title_link": "https:\/\/firstlook.org\/theintercept\/2015\/01\/14\/exclusive-serial-prosecutor-defends-guilty-verdict-adnan-syed-case-part-ii\/",
                "text": "Last week, The Intercept published Part I of an interview with Kevin Urick, the lead prosecutor in the 2000 murder trial of Adnan Syed. Today, we are publishing Part II.",
                "fallback": "The Intercept: Exclusive: Serial Prosecutor Defends Guilty Verdict in Adnan Syed case, Part II - The Intercept",
                "thumb_url": "https:\/\/prod01-cdn00.cdn.firstlook.org\/wp-uploads\/sites\/1\/2015\/01\/Eli.Valley.Intercept.Courtroom.Final_.jpg",
                "from_url": "https:\/\/firstlook.org\/theintercept\/2015\/01\/14\/exclusive-serial-prosecutor-defends-guilty-verdict-adnan-syed-case-part-ii\/",
                "thumb_width": 2000,
                "thumb_height": 1370,
                "id": 1
            }
        ],
        "ts": "1421260640.000002"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "funny- this is one is so much more cut and dry than the previous",
        "ts": "1421262448.000004"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "its literally just the interview transcript",
        "ts": "1421262474.000005"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "the grownups at the intercept stepped in!",
        "ts": "1421262693.000006"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "Yeah. Totally neutered. ",
        "ts": "1421262701.000007"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "But",
        "ts": "1421262706.000008"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "which made it kinda boring, but better than that other crap",
        "ts": "1421262709.000009"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "Not surprising FROM THE PROSECUTOR",
        "ts": "1421262717.000010"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "I think if the intercept is going to work they're going to have find some functional ground between baseless mudslinging and just transcription services",
        "ts": "1421262742.000011"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "<@U0260V4K1>: ha! agreed",
        "ts": "1421262762.000012"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "for those playing along at home: <http:\/\/natashavc.tumblr.com\/post\/108089592316\/here-are-the-e-mails-from-koenig-to-urick-left-on>",
        "attachments": [
            {
                "title": "Here are the e-mails from Koenig to Urick left on the cutting room floor",
                "title_link": "http:\/\/natashavc.tumblr.com\/post\/108089592316\/here-are-the-e-mails-from-koenig-to-urick-left-on",
                "text": "Hello. I was very pleased to see part 2 of our interview with prosecutor Kevin Urick published today on The Intercept. My co-workers and editors worked very hard to make sure it was presented in the most coherent, air tight, fact checked way and I think they all succeeded marvelously. There was a disagreement about running a correspondence between Sarah Koenig and Kevin Urick, mostly because I&amp;#8217;m told, that the emails were more confusing and minor than some of the bigger issues we covered in part 2. That could be true. But I don&amp;#8217;t agree. And that&amp;#8217;s ok! That&amp;#8217;s why we have the miracle of micro-publishing platforms.  Here is why I believe these emails are important. As a crime journalist, there are not a lot of people who want to talk to me. This includes lawyers. What&amp;#8217;s cool about the criminal justice system, is that because it is an inherently democratic institution, anybody can walk into a courtroom and plop down! So sometimes when I&amp;#8217;m getting dodged by attorneys, I will simply come to their courtroom where they are having a trial or I will go to their office near a courthouse. And this typically works. Sometimes they say, &amp;#8220;hey, leave me alone.&amp;#8221; Sometimes I do. Other times not. I will wait in the hallway for a recess and they come out and we will talk. In &amp;#8220;Serial&amp;#8221;, Koenig and her team were willing to fly out, unannounced, and knock on a state witnesses&amp;#8217; door, Jay Wilds, without alerting him. I have done similiar things in the course of my reporting. I think it was a good call to find Jay given how much time they put into the story and how invested the whole team seemed to be. What baffles and frustrates me is why the same attempts were not made to reach the lead prosecutor on a possibly wrongful conviction case Kevin Urick &amp;#8212; who practices law in open court in MD several times a week! Here is a man who: &amp;#8212; had the most contact with the victim&amp;#8217;s family &amp;#8212; you are not-so-subtly accusing of being corrupt &amp;#8212; at worst put an innocent person in prison for the rest of his life, and at best, in my opinion, put someone in prison who murdered his teenage girlfriend. But that&amp;#8217;s just me!  Wouldn&amp;#8217;t you want to nail him to the wall and demand answers? Or if you weren&amp;#8217;t convinced of guilt or innocence either way, have him tell you why? Why not? Even if he lies to you, isn&amp;#8217;t that an even better indication that this whole thing has run afoul. Kevin Urick is not a liar. He impressed me with his professionalism, thoughtfulness, and precision about the case. Here is the other thing: I have a bias towards prosecutors. Many of them are hacks, with really medieval views of human beings and justice. But some are very good and try to seek justice with great dignity even though they are picking through barbaric acts. Sit through a rape trial. Or a child abuse case. And tell me how you feel about prosecutors as a monolith.  I believe the work that Urick did for Hae Min Lee and her horrible death was important and worthy of a conversation. It&amp;#8217;s worth a home visit. Or worth going to his office (which is listed on the internet). We did it! It was very pleasant!  It is worth sitting in the hallway of the Elkton courthouse in Maryland, and waiting for Urick.  I don&amp;#8217;t know how you can go this deep into the story, like Serial did, and not at least hear what he had to say. Is it because he represents the state? Or was on the wrong side? Or has put very nice people in prison? None of these reasons are an excuse for not trying harder.   Jay Wilds showed me the emails Koenig sent him throughout and after the show and they are lengthy and pleading. And I see none of that here. I don&amp;#8217;t understand why. When Jay announced he would be going on record via his Facebook. Sarah Koenig sent him an email saying, \"I saw your post on Facebook. I’m raising my hand once again, to ask if you will talk to me. As you probably know, the final installment of my story was last week, but if you wanted to talk, we could always do another episode, so that you can tell your story about what happened to Hae, and about what happened to you. My goal has always been to get this story right. Please know that, to me, this case has never been an entertainment. I am mindful all the time that everyone involved in this case is a real person - not an archetype, not a character, not a stereotype - but a real person. I don’t know if you’ve listened to the podcast, but in every episode I tried to convey that, and to respect that.  If you change your mind about an interview, please feel free to contact me at your convenience.&amp;#8221; I do not understand why the same attempts were made to talk to Urick. Their attempts were underwhelming and I think poisoned the narrative, allowing more strange theories about &amp;#8220;butt dial&amp;#8221; and &amp;#8220;Mr. S&amp;#8221;  or a serial killer to bloom. I like talking to prosecutors because sometimes they get it very wrong. And when the state gets it very wrong that a huge fucking deal. I also like talking to them because when they get it right, as it has been in the case in my own life, with two people I loved getting murdered, you can see the astonishingly difficult work they do and that deserves respect.  That&amp;#8217;s what I think. Here&amp;#8217;s why I think it. You can think differently. We can still be friends. That is what&amp;#8217;s cool about having different brains in our heads. * * * Subject: Contact from the Kevin Urick Website Date: December 12, 2014&amp;#160;8:49:30 AM PST To: Kevin Urick NAME: Sarah Koenig ADDRESS:  CITY:  STATE:  ZIPCODE:  PHONE:  EMAIL: COMMENTS: Hello Mr. Urick. I&amp;#8217;ve been trying to reach you, to run something by you that I plan to use in my story on &amp;#8220;Serial&amp;#8221; next week, about the Adnan Syed case. A state&amp;#8217;s witness claims you were very upset with him after he testified, that you &amp;#8220;yelled&amp;#8221; at him. I wanted to fact-check that with you and give you a chance to respond. Please contact me as soon as possible. Sincerely, Sarah Koenig Then a phone call to Urick&amp;#8217;s law firm in December 2014 From: [NAME REDACTED]  Date: December 12, 2014&amp;#160;9:13:14 AM EST To: Kevin Urick Kevin - I received a telephone message from a Sarah Kanig (?) of SerialPodcast.  She is preparing a presentation regarding a case you handled about 15 years ago.  She did not mention the name of the case but said she wanted to speak with  you before she aired it.  Her number is ***-***-****. Urick responds to Koenig&amp;#8217;s requests On Dec 12, 2014, at 1:01 PM, &lt;kevin&gt; wrote: Ms. Koenig, Thank you for your inquiry.  I am no longer employed by the Baltimore City State&amp;#8217;s Attorney&amp;#8217;s Office and am not authorized to comment on the case. Also, it is my understanding that the Lee family have not given their permission for anyone to talk about the case. Koenig responds: Thank you, Mr. Urick, for getting back to me. I very much appreciate that. If it&amp;#8217;s OK with you, I&amp;#8217;ll say something like, &amp;#8220;I ran this by Mr. Urick, and he responded that he was not authorized to comment on the case.&amp;#8221; Is that OK? I want to make it clear that we checked with you. Sincerely, Sarah K. Urick responds, this is the final communication between the two. From: kevin Subject: Re: Date: December 12, 2014&amp;#160;1:29:56 PM EST To: Sarah Koenig That will be fine. When we reached out to Serial about Kevin saying that the first time he heard from Koenig was the week of the final broadcast. Here is what producer Julie Snyder said to my reporting partner Ken Silverstein: On Mon, Jan 12, 2015 at 11:34 AM, Julie Snyder &lt;julie&gt; wrote: Hi Ken, I actually said we reached out to Kevin Urick multiple times, in multiple locations in our statement we sent you last week.  I merely reiterated it via Twitter. Sarah left several messages at (443) 350-*** — the number listed on Urick’s law office website. Several messages were left at the Cecil County State’s Attorney’s Office 410.996.****. Sarah also left messages with Bruce Hemphill 410-392-****, a former law partner. Sarah may have also emailed Urick through the contact form on his website but she can’t remember for sure and doesn’t have an email receipt since it’s a contact form. She does not have specific dates noted for every message but the time period was from late January 2014 (when Sarah began working on Serial full time) to at least early March (the message she left at Hemphill’s firm is dated in her notes as 3\/3\/14). And just to remind you: Sarah did do a lengthy interview with KC Murphy, Urick’s co-prosecutor for the Adnan Syed trial, in January of 2014.  Ms. Murphy still works at the Baltimore City State’s Attorney’s Office and it was the SAO’s position to ask us to not broadcast the interview without the consent of the Lee family. Best, Julie This is an email exchange I had with Urick last week on the issue. To: Natasha Vargas-Cooper From: Kevin Urick Natasha, I understand Ms. Koenig is claiming she made numerous attempts to reach me.  As I said, I cannot definitely say she did not try one time to reach me.  I do not recall ever receiving a voice recording or e-mail from her.  But I can say I have no recollection and no record of &amp;#8220;numerous attempts.&amp;#8221; To me, the most telling point is how she attempted to contact me in December.  I have four telephone numbers I can be reached at.  Two are listed in the phone book.  I am also employed at the Cecil County State&amp;#8217;s Attorney&amp;#8217;s Office.  That is in the phone book and if someone calls there they will be put through to me or my voice mail.  The fourth is my cell phone.  That number is unlisted. When Ms. Koenig tried to reach me, she called the Hemphill Law Firm.  Hemphill is an Elkton firm where I used to be a part-time associate handling specific ",
                "fallback": "Here are the e-mails from Koenig to Urick left on the cutting room floor",
                "thumb_url": "http:\/\/assets.tumblr.com\/images\/og\/text_200.png",
                "from_url": "http:\/\/natashavc.tumblr.com\/post\/108089592316\/here-are-the-e-mails-from-koenig-to-urick-left-on",
                "thumb_width": 200,
                "thumb_height": 200,
                "id": 1
            }
        ],
        "ts": "1421279804.000013"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "...",
        "ts": "1421281054.000015"
    }
]