[
    {
        "type": "message",
        "user": "U243UT96G",
        "text": "I added deck functionality to the static site - you can see it in action in the staging site I set up: <http:\/\/ucs-staging.netlify.com\/categories\/samsungdeck\/>",
        "attachments": [
            {
                "title": "Uncorked Studios",
                "title_link": "http:\/\/ucs-staging.netlify.com\/categories\/samsungdeck\/",
                "text": "A design and engineering firm that builds connected products for the digital and physical world. From smart devices and wearables to native iOS \/ Android apps and the platforms that support them, Uncorked helps its clients build innovative products with purpose. The team consists of experience and visual designers, strategists, hardware and software developers, and producers.",
                "fallback": "Uncorked Studios",
                "thumb_url": "http:\/\/ucs-staging.netlify.com\/images\/logo.png",
                "from_url": "http:\/\/ucs-staging.netlify.com\/categories\/samsungdeck\/",
                "thumb_width": 32,
                "thumb_height": 32,
                "service_icon": "http:\/\/ucs-staging.netlify.com\/images\/logo.png",
                "service_name": "ucs-staging.netlify.com",
                "id": 1
            }
        ],
        "ts": "1479240122.000635"
    },
    {
        "type": "message",
        "user": "U243UT96G",
        "text": "The way this works - to create a new deck, you just need to add the flag \"xxxxdeck\" to the works entries you want to add to the deck.  There is an additional category called \/private that is all password-protected case studies.  Those can get added to the deck as well, but when you click on the work entry it will prompt you for the password.  click on the first entry (i reused the arab photo project case study) to see it.  user\/password is uncorked\/megaquake!",
        "ts": "1479240227.000637",
        "reactions": [
            {
                "name": "clap",
                "users": [
                    "U0B9N0HF0",
                    "U1HKQRLMR",
                    "U1S5GKTHQ"
                ],
                "count": 3
            }
        ]
    },
    {
        "type": "message",
        "user": "U243UT96G",
        "text": "if we want to password protect the entire deck, we can do that too.  just let me know.  Also if there is design\/content direction for this page beyond a title and a list of entries, please let me know.  <@U0265G76F>",
        "ts": "1479240279.000638"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Neat!",
        "ts": "1479241071.000639"
    }
]