[
    {
        "type": "message",
        "user": "U167FL70V",
        "text": "<@U13GPDA1F> somewhat silly question for you: what is the current process for how we’re creating tickets for work on the site? do you want to enter them in or should it be the person who is requesting the thing or…? \n\nasking because <@U1HKQRLMR> and i were talking about an issue she ran into - trying to add sidebar quotes to blog posts. it looks like we don’t have support for that from a dev or design standpoint currently. it should be fairly low effort, but want to make sure we’re sticking to ideal process :slightly_smiling_face:",
        "ts": "1497479291.519964",
        "reactions": [
            {
                "name": "+1::skin-tone-2",
                "users": [
                    "U1HKQRLMR"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U13GPDA1F",
        "text": "sorry for the delayed response - the process (which I'm totally open to evolving) is to submit a request via the feedback form (link is topic of channel) and from there they'll be converted to JIRA tickets and assigned accordingly. ",
        "ts": "1497498112.163429"
    },
    {
        "type": "message",
        "user": "U13GPDA1F",
        "text": "I didn't receive a notification of a request BUT I will check because I was having some issues with it (and making sure that's not the bottleneck). If it makes sense to have people create tickets for a backlog directly I'm totally open to that (at the time the form was created we hadn't yet rolled out JIRA for some of the internal stuff so I was worried it might be a barrier for folks who don't use the tool regularly) ",
        "ts": "1497498239.176251"
    },
    {
        "type": "message",
        "user": "U13GPDA1F",
        "text": "i definitely not attached to creating JIRA tickets myself though :) likely the assigning of tickets would be done with PP sprint planning, so that would be my only caveat - not having requestors assign directly to a dev without that being vetted",
        "ts": "1497498422.195274"
    },
    {
        "user": "U02613K0X",
        "text": "<@U02613K0X|jenny> has left the channel",
        "type": "message",
        "subtype": "channel_leave",
        "ts": "1497507086.156864",
        "reactions": [
            {
                "name": "sob",
                "users": [
                    "U0260V1BX",
                    "U167FL70V"
                ],
                "count": 2
            }
        ]
    }
]