[
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel> hey visual design \/ motion team!! trying to get a read on whether we need a design meeting tomorrow and assuming we do, what the agenda will be. please sound off on what you’re working on for compass and if you have thoughts on what to share with scott tomorrow.",
        "ts": "1474305595.000052"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "From my pov the only thing i know Scott is looking for is where we land on discussions of activity badge scale. i’ve already shared all current motion studies, not sure if we would benefit from an in person meeting for it.",
        "ts": "1474305721.000053"
    },
    {
        "type": "message",
        "user": "U0XCJ372R",
        "text": "I started testing the icons Scott sent over on the home screen at different scales since there was some concern that the hierarchy between the icons and the patterns were conflicting.",
        "ts": "1474305737.000054"
    },
    {
        "type": "message",
        "subtype": "file_share",
        "text": "<@U0XCJ372R|ali> uploaded a file: <https:\/\/uncorked.slack.com\/files\/ali\/F2D9P3FQA\/compass_icons_scale_test.zip|Compass Icons Scale Test.zip>",
        "file": {
            "id": "F2D9P3FQA",
            "created": 1474305797,
            "timestamp": 1474305797,
            "name": "Compass Icons Scale Test.zip",
            "title": "Compass Icons Scale Test.zip",
            "mimetype": "application\/zip",
            "filetype": "zip",
            "pretty_type": "Zip",
            "user": "U0XCJ372R",
            "editable": false,
            "size": 1722042,
            "mode": "hosted",
            "is_external": false,
            "external_type": "",
            "is_public": true,
            "public_url_shared": false,
            "display_as_bot": false,
            "username": "",
            "url_private": "https:\/\/files.slack.com\/files-pri\/T0260V1BR-F2D9P3FQA\/compass_icons_scale_test.zip?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "url_private_download": "https:\/\/files.slack.com\/files-pri\/T0260V1BR-F2D9P3FQA\/download\/compass_icons_scale_test.zip?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "permalink": "https:\/\/uncorked.slack.com\/files\/ali\/F2D9P3FQA\/compass_icons_scale_test.zip",
            "permalink_public": "https:\/\/slack-files.com\/T0260V1BR-F2D9P3FQA-e6ba849c3c",
            "channels": [
                "C12DB31V4"
            ],
            "groups": [],
            "ims": [],
            "comments_count": 0
        },
        "user": "U0XCJ372R",
        "upload": true,
        "display_as_bot": false,
        "username": "ali",
        "bot_id": null,
        "ts": "1474305814.000055"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Awesome, I think we can talk about scale of icons with Scott. And maybe make sure he’s got what he needs in terms of the motion studies you sent over at the end of the day on Friday Trent.  We can also reach out to him and see if he’s got stuff to share with us.",
        "ts": "1474306038.000056"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "I’d also be curious to hear his thoughts on the plus button placement per our last email.",
        "ts": "1474306102.000057"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Sounds good. His response this weekend didn’t address any motion stuff I gave him (assuming that’s a good thing). We can follow up to see if he had any other input on it.",
        "ts": "1474306143.000058"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Yep just rereading his note, and makes sense. One other question <@U026E0ZNR> - where are we at overall in terms of working with chris on the home screen patterns?",
        "ts": "1474306401.000059"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Chris has sort of gone dark… last I checked in with him (maybe a week or so ago) he said he wasn’t able to work on the prototype stuff cuz he had other things he was working on. I told him to let me know when he made more progress but it’s been a while. When was the last you spoke with him?",
        "ts": "1474306650.000060"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Ah interesting, it’s possible Israel gave him some dev work to do that took priority (maybe not purposely, we can find out). I also know he would be out of pocket end of last week on a trip I believe, so that’s probably why he’s gone dark.",
        "ts": "1474306727.000061"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Let me reach out to him and get some clarity for us",
        "ts": "1474306737.000062"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Cool, thanks!",
        "ts": "1474306806.000063"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<@U026E0ZNR> so that i know, do you feel there is a lot more work on those patterns? or for example on the pattern for launch, are we close to calling it good?",
        "ts": "1474306855.000064"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "let me look back at my work for a minute",
        "ts": "1474307031.000065"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "thanks",
        "ts": "1474307035.000066"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "```What’s finished:\n* General motion\/easing on incremental growth of Sticks pattern\n* Maximum amount of shapes for Sticks pattern\n\nWhat’s as good as we can do for now:\n* Percentage of shapes released per tap (prototype specific, not necessarily 1 to 1 with final app implementation)\n\nWhat needs to be done:\n* Smooth out timing issues with Replay feature (Chris’s territory)\n* Tweak easing values of Replay feature (awaiting code updates from Chris)\n* Meta\/Water pattern easing values (awaiting code updates from Chris)\n* Determine percentage of growth per tap (prototype specific)\n```",
        "ts": "1474307516.000067"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "This is what I’ve got <@U026103R3>",
        "ts": "1474307527.000068"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Awesome, this is super helpful thanks Trent. I looked back at my notes and Chris is OOO through tomorrow, so I’ll send him a note to make sure we’re aware of what he’s working on and see when he can focus back on the home screen pattern. From my POV that pattern should be priority because we’d like to button it up asap as the devs are working on bringing it into the app nowish and def next sprint which starts next week.",
        "ts": "1474307642.000069"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "If further explanation helps… with the Meta\/Water pattern I just need him to give me a couple more variables to tweak, which _sounds_ to me like it won’t take him long once he gets into it. But the Replay thing on the Sticks pattern sounds to be a much more involved issue to solve. He didn’t have a clear solution last we spoke, though I’m sure he’ll get there once he digs in.",
        "ts": "1474307899.000070",
        "reactions": [
            {
                "name": "+1::skin-tone-3",
                "users": [
                    "U0HPGQ4KH"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Thanks for the clarification, that’s helpful.",
        "ts": "1474308047.000071"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "home pattern art direction question: for this replay feature, is it important that the pattern composition for that day remains exactly the same after the replay is initiated, in the sense of a literal video playing out the same content in a fast forward kind of manner?",
        "ts": "1474329526.000072"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "hey trent! good question. for me, I’d say you’re correct. \nit’s always been important for these days to be unique creations. My hope is that the act of replaying a day’s pattern, will help sarah understand how she got to this unique composition. if it were to change, i’d be worried that we’d lose some of that “create every day” idea.",
        "ts": "1474329848.000073"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "cool, i’m noticing that may not be how the current iteration is built so i’ll be sure to pass that along to Chris",
        "ts": "1474329932.000074"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "<@U0XCJ372R> do you have a final\/official hex value for the background color of the pattern window? i’m discovering some discrepancies in color currently in this prototype and want to be sure it's using the correct value",
        "ts": "1474331704.000075"
    },
    {
        "type": "message",
        "user": "U0XCJ372R",
        "text": "I'm not really sure what they should be since the values have shifted from when I first built the pattern. ",
        "ts": "1474331907.000076"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "ok, i’ll leave it alone for now. but maybe that should be a thing for the team to address at some point. the prototype BG currently seems to be a tad bit darker than what the latest home screen photoshop comps have. not necessarily an issue for me but we can change that if it needs to be",
        "ts": "1474332189.000077"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "Chiming in here on the built. I'd be positively surprised if we can regenerate the same pattern all over again on that day. But I like positive surprises and Chris is definitely one that can deliver those ... ",
        "ts": "1474341590.000078"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "And yes, it would be cool if that can be managed!",
        "ts": "1474341621.000079"
    }
]