[
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "<@U0XCJ372R> <@U026PLK4S> just some notes we jotted down during our ruleset discussion around Haze today: \n\n*Things to consider for Tuesday 4pm meeting*\n-Maybe we add in a color burst anytime a discovery is done? \n-What could happen when a discovery is done? \n-If we don’t have a solution we should pick Scott’s brain, but we need to come with a strong POV.\n-Lower the milestone to 20 minute increments so we can show that each discovery pushes you forward \n-Show the difference between in payoffs for tomorrow \n-Do we want this to communicate where you are from low to high? Or leveling up\/variations?\n-Have game references up \n-Write pros\/cons on the board\n-Do a week view for each of these spectrums \n-Clean up boards",
        "edited": {
            "user": "U0U9WJB7F",
            "ts": "1480984085.000000"
        },
        "ts": "1480984044.000002"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "as always, let us know if we can help in any way",
        "ts": "1480984057.000003"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Yes and please don't let those derail or overwhelm! Use em as loose guidelines. ",
        "edited": {
            "user": "U026103R3",
            "ts": "1480984473.000000"
        },
        "ts": "1480984465.000005"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Wanted to chime in and request to be kept in the loop on whatever advances are made around the ruleset for Haze (knowing full well this is all in heavy flux rn). I’m currently deconstructing what I can see from Ali’s PSDs to start building the foundation in OpenGL and also begin laying out suitable ranges where variables can be selected from randomly for our “new every day” goal.\n\nAny new developments on the design intent would be very helpful for Chris and I. Just want to be sure I’m not missing anything that might send us on a more accurate trajectory.",
        "ts": "1480989665.000007"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Thanks for the reminder Trent, we'll be sure to keep you in the loop. From my understanding we haven't shifted from what you and Ali discussed but we'll flag it if we do. And also it will be helpful to see where we net out after tomorrow's meeting with Scott so you and everyone can help push Chris forward. ",
        "ts": "1480990547.000008"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Cool, thanks!",
        "ts": "1480990649.000009"
    }
]