[
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Quickly following up on the above - the task is captured in this JIRA ticket: <https:\/\/future-dev.atlassian.net\/browse\/COM-844>\n\nLet’s get through shipping the prototype for this round of testing and see when this exploration makes most sense to try out and see if we want to push it forward. Lastly, since things are getting very granular (this is a great example) I’d love if we were all comfortable filing JIRA tickets as needed. I’ll reach out hopefully by end of week with some quick guidelines to help get ahead of questions on how\/when to do so.",
        "ts": "1475684452.000751"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "Thanks Abby. Should we be filing 1.1+ topics in jira as well? I've got an ongoing list on my desktop and have been waiting for the go ahead to document them elsewhere. Katrina mentioned jira as the preferred venue for those items, even if they're not defined yet",
        "ts": "1475696250.000752"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Yea I think that would be great. maybe we can connect tomorrow on details but essentially we need to make sure it's in the 1.1 release version and is in the correct epic ",
        "ts": "1475697087.000753"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "Sounds good",
        "ts": "1475697164.000754"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "<@U026PLK4S> as you’re working through typography \/ homescreen component updates, please consider a use case where there might be &gt;1 “homescreen message” (that generic, elevated message + actions). We may end up using that component for workout confirmation so i can see scenarios where we’ll need to house multiple of those. thanks yo",
        "ts": "1475698121.000755"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "totally. good call. i’ll add it to my list",
        "ts": "1475698537.000756"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "glad we’re liking it and considering it for more stuff",
        "ts": "1475698576.000757"
    }
]