[
    {
        "type": "message",
        "user": "U0XJFPSRL",
        "text": "What are the rules for when the status bar is shown?",
        "ts": "1480359303.000002"
    },
    {
        "type": "message",
        "user": "U0XJFPSRL",
        "text": "I’m trying to answer a dev question about whether the status bar is shown in the sharing module flow",
        "ts": "1480359341.000003"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "status bar should be visible everywhere except for the media player",
        "ts": "1480359420.000004"
    },
    {
        "type": "message",
        "user": "U0XJFPSRL",
        "text": "Great, thanks",
        "ts": "1480359548.000005"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "<@U0XCJ372R> <@U026E0ZNR> <@U0MKH0BE0> <@U026PLK4S> <@U026103R3> <@U0260V1BX> <@U0HP6TFNX> <@U0HPGQ4KH>    Sounds like we'll be moving forwad with the Haze direction. I'm working on setting up a time with Scott for either tomorrow afternoon or sometime on Wednesday depending on his schedule. Just to keep you in the loop, we received this email from Scott just a few minutes ago: \n\n\"I am vey pleased to introduce Zara Evens to our team, who has joined us from Citizen as a Senior Interactive Art Director.  Zara will be joining to onboard and take a leading role in the team for Visual Design.\n\nI understood the sentiment for weekly's.  We can move to as needed based on the work streams.\n\nWe are excited by the results for Haze having the most appeal and perceived usefulness surveyed in the user tests.  There is a clear connection to the identity which should help us connect those dots for a more cohesive user journey, but it is not all logic, and we need to recognize when rules are broken.\n\nThe perception of the spectrum visualized was a cold to hot spectrum, this is clear, but which spectrum? Can we work with color wheel logic for a common understanding of the states?  Can we dial the Brightness back to the 'identity work' saturations - what does this look like?  We like the aerosol textures, it will help us dial in the Splash screen and App tile direction.\n\nWe should meet to discuss the actual color strategy and how this extends throughout the other discovery experiences.  Which Hues? Which transitions?\n\nI want to come away with a clear understanding of how the rules apply to other discovery engagements to present back to the Identity team etc.\"",
        "edited": {
            "user": "U0U9WJB7F",
            "ts": "1480376651.000000"
        },
        "ts": "1480376607.000006"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "Y'all should have received an invite for tomorrow at 4pm to regroup with Scott.",
        "ts": "1480378297.000009"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "<@U0XCJ372R> do you know if we have a spec comp for week view? I can’t find it",
        "ts": "1480383169.000010"
    },
    {
        "type": "message",
        "user": "U0XCJ372R",
        "text": "<@U0260V1BX> I don’t see it either. I did’t do any of the home screen specs, Phillip and Melodee were the ones working on specs for that section. It’s possible it got overlooked.",
        "ts": "1480384277.000011"
    },
    {
        "type": "message",
        "user": "U0MKH0BE0",
        "text": "Phillip did the most recent specs for the new home visual",
        "ts": "1480384359.000012"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "<@U02AUNA0P> did you spec week view?",
        "ts": "1480387419.000013"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "I don't think so. I know someone re-designed it but i haven't seen the psd.",
        "ts": "1480387517.000014"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "Can someone point me to the psd?",
        "ts": "1480387882.000015"
    }
]