[
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel> Heads up folks - Scott has said something came up and he won’t be able to make it this morning. So, let’s take the time to keep pushing forward if there is more room to push. We can regroup after standup and discuss. I’ve also asked if he could come by tomorrow at 11am so we’re able to solidify the three concepts for testing by EOD tomorrow, so I will keep you all in the loop on that front.",
        "ts": "1479228812.001338"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "<@U026E0ZNR> <@U0XCJ372R> <@U0MKH0BE0> i want to give you all heads-down time but PLEASE grab myself or megan or felix or matt (when he arrives) if you want a second eye on something, are feeling stuck or unsure, or need anything.",
        "ts": "1479237727.001339",
        "reactions": [
            {
                "name": "raised_hands",
                "users": [
                    "U026103R3"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel> Hey team, quick heads up - Let’s plan to check in with Scott at 11am tomorrow. We haven’t heard back from him yet, but Adam and Quinn would like to check in as well and join him during that time and have said Scott looks free as well. We’ll send out a calendar invite shortly.",
        "ts": "1479244758.001340"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Also in that case, sounds like we should regroup before EOD so if everyone could plan to get together around 3:30 and check in that would be super helpful. I will try to join as soon as possible if meetings run short.",
        "ts": "1479245108.001341"
    },
    {
        "type": "message",
        "user": "U0XCJ372R",
        "text": "<!channel> I'm not feeling great so I'm heading home for the rest of the afternoon. I shared my progress on the data visualization with Melissa and I'll be keeping an eye on slack.",
        "ts": "1479246060.001342"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "okay feel better soon <@U0XCJ372R>",
        "ts": "1479246172.001343"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel> Hey Team - Just got off the phone with Adam and we have updates all around. As mentioned above, Adam and Quinn will join Scott tomorrow at Uncorked for an 11AM check in. \n\nWe’ll see what feedback looks like, but the goal is to determine the three directions that will be tested in the upcoming round. Goal is to finish up any feedback by EOD tomorrow so those three directions are baked for testing. \n\nWe’ll need to put those concepts into a PDF (does not have to be crazy in depth or high fidelity), so that Adam\/Quinn\/Scott can share them with Amy (and possibly Christian) on Thursday.\n\n*A bigger update* - We are no longer planning to test Dec 1 with animations of all concepts. Instead we will be testing flats\/comps and showing the visualizations at multiple points throughout the day (e.g. 30 mintues of activity, 45 min, 60 min, 90 min, etc). This allows adidas to hook into an existing testing round and target Monday\/Tuesday 11\/21 and 11\/22 for that testing. \n\nPhew, that was a lot of updates, please ping me or ask questions in here that I can help answer.",
        "ts": "1479246403.001344",
        "reactions": [
            {
                "name": "tada",
                "users": [
                    "U026E0ZNR"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Does this mean there are no motion needs at all anymore?",
        "ts": "1479247064.001345"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Yep, that’s what it means",
        "ts": "1479247256.001346",
        "reactions": [
            {
                "name": "carlton",
                "users": [
                    "U026E0ZNR"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "hey all, does anyone mind checking in earlier, say at 2:30? Megan won’t be able to join at 3:30 and I’d love to get the whole crew in the room if possible (minus Ali of course, who’s not feeling well).",
        "ts": "1479247982.001347"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "if we’d rather keep the 3:30 no worries",
        "ts": "1479248081.001348"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "I think it's fine, just a note that Abby and I will be in a producer meeting from 230-330 (or 4pm) so we'd miss it. I think we were just hoping that in preparation for the 11am tomorrow we will have each idea clearly posted up on boards for an easy walk through.",
        "ts": "1479248289.001349"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "ok, let’s do it. 10 min y’all. This gives more time to address team feedback and yes we’ll make sure to have boards for tomorrow’s 11am",
        "ts": "1479248373.001350",
        "reactions": [
            {
                "name": "raised_hands",
                "users": [
                    "U0U9WJB7F"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "we do have the compass retrospective tomorrow so it cuts into the morning a bit...just a reminder of that! :slightly_smiling_face:",
        "ts": "1479248421.001351"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "yes thanks for the reminder",
        "ts": "1479248691.001352"
    }
]