[
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "For my own clarity, I took down a high level account of all the main points I saw in Scott’s thinking for this home pattern meeting email. Figured I’d share what I was able to boil it down to and potentially help parse the jazz…\n\n```\n* Addition of color\n* Semi-transparency\/overlapping layers\n* Saturation\/Desaturation\n* Continue focusing on density to convey meaning\n* Responsive z-axis (zooming out as pattern grows)\n* Goal or no goal?\n* Still Daringly Simple\n* Must feel personal and evolving\n* Recognizable shapes\n* Structure over chaos\n* Mapped to data (not arbitrary)\n* Conveys time somehow, at least loosely\n* Mention of Dx color (accent color or pillar colors?)\n* Containing visualization to center of canvas “w\/o filling screen to edge”\n```",
        "ts": "1478286636.001221"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Thank you for pulling those notes together Trent! It’s always good to map our interpretations of the jazzy emails to each other's",
        "ts": "1478300908.001222"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel> For some context on the note above from Trent, and a head’s up I wanted to give, we’ve been asked due to the results of user testing to work on some new patterns for the app. We know this is a huge part of the experience, and is really important to nail for all the reasons we know, so it’s great that we’re looking to update it based on real user feedback. It’s also kind of a cool opportunity to jam on some patterns for a bit and work together. \n\nWe’ve met with Adam and Quinn today on the topic, and still need to synthesize and kind of digest the ask before we pull in more folks to jump in. So, please be on the lookout and be ready for us to pull you all in as needed next week, as it’s likely going to be a full team effort. We don’t have solid plans at this point, so please just be excited, flexible, willing, and ready. :slightly_smiling_face: Thanks all.",
        "ts": "1478301129.001223"
    }
]