[
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<@U026E0ZNR> Hey Trent, doing some planning for tomorrow and wanted to check in on progress to see if we’ve got enough to warrant a meeting with Scott tomorrow. When you get a moment, can you let us know if by tomorrow at 4pm you feel you will have future motion studies and\/or more to check out on the pattern front? If not we may want to push the meeting with Scott or move to meetings when needed versus having the standing weekly.",
        "ts": "1473703988.000036"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Yeah I definitely won’t have anything worth sharing tomorrow. Any new work since our last meeting has either already been sent to him or is documented in spreadsheet format.\n\nI have been wondering in regards to future motion planning: How far down the rabbit hole I should go in mocking up motion sample clips of each idea I envision beyond a simple\/standard movement. I’ve highlighted 10 instances that _might_ benefit from a visual example but also may be just as well off being described in text format. How exhaustive should I be in the motion thinking beyond our current priorities of home screen stuff?",
        "ts": "1473704472.000037"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Thanks for the update Trent, super helpful and makes sense considering the email communication I’ve seen between you guys. Sounds like we’re still waiting to hear back from Scott on the one question you posed about the discovery cards (I believe), but we also have a larger question about how far we should go. \n\nI’m not sure of the answer off the top of my head, but my gut says we shouldn’t go *too* far without having the product out, getting some initial learnings, seeing how things continue to shape considering social down the line, etc. \n\nI’d propose that we email Scott with the current status, and clearly identify our open questions, as well as send him a link to the spreadsheet so he can reference it. Depending on his answer, we can find the right timing for a next meeting or forego. That work for you?",
        "ts": "1473704865.000038",
        "reactions": [
            {
                "name": "+1::skin-tone-3",
                "users": [
                    "U0HPGQ4KH"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "For team visibility, we agreed on the above and sent an email to Scott asking how far we should push into future motion work so we can reframe these weekly meetings and ensure he’s driving the work we’re doing rather than us guessing.",
        "ts": "1473706832.000039",
        "reactions": [
            {
                "name": "raised_hands::skin-tone-3",
                "users": [
                    "U0HPGQ4KH"
                ],
                "count": 1
            }
        ]
    }
]