[
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Posting some of my findings\/opinions about the Water\/Meta pattern with color:\n\n*Screen Shots*\n<https:\/\/www.dropbox.com\/sh\/i7jdgldt0ehrjlu\/AADeEI1_qJFOZRl9cA7tgv7La?dl=0>\n\n*Pros*\n• Doesn’t completely white out (not as soon at least)\n• Few colors look better than all 4 pillar colors\n• Higher density starts to look like colorful camo, interesting\n\n*Cons*\n• Too many colors get crazy pretty fast\n• Overlapping colors create new\/non-pillar colors\n• Magenta kinda looks like blood drops\n• Current implementation makes it hard\/impossible to do opacity layering\n• Doesn’t feel on brand with current direction",
        "attachments": [
            {
                "service_name": "Dropbox",
                "title": "Water-Meta Color",
                "title_link": "https:\/\/www.dropbox.com\/sh\/i7jdgldt0ehrjlu\/AADeEI1_qJFOZRl9cA7tgv7La?dl=0",
                "text": "Shared with Dropbox",
                "fallback": "Dropbox: Water-Meta Color",
                "thumb_url": "https:\/\/cf.dropboxstatic.com\/static\/images\/icons128\/folder_dropbox.png",
                "from_url": "https:\/\/www.dropbox.com\/sh\/i7jdgldt0ehrjlu\/AADeEI1_qJFOZRl9cA7tgv7La?dl=0",
                "thumb_width": 128,
                "thumb_height": 128,
                "id": 1
            }
        ],
        "ts": "1478042134.001155"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I’ve told Chris that I don’t intend to experiment much further until we can use these findings to uncover clearer direction from the adidas visual team. Happy to try other things if you all have something in mind you’d like to see before we share externally. Felix has run through these things with me already earlier today.",
        "ts": "1478042243.001157"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Personally, I feel like there are much stronger directions in Scott’s pattern inspiration deck than what we’re able to accomplish with a colorized version of the water pattern that wasn’t originally intended for that.",
        "ts": "1478042385.001158"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Thanks for sharing Trent! Really interesting stuff. I’m curious to hear what Matt and Felix think about these. If\/when we all agree I think we should share these with adidas along with our POV and some suggestions of how to move forward (whether that’s an entirely new pattern, one with existing parameters, etc).",
        "ts": "1478042499.001159"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Since I believe we are sending out new home designs before taking off today, I think it would be great if we can regroup tomorrow morning on how to share this work with the adidas crew. Maybe right after standup? <@U026E0ZNR> <@U026PLK4S> <@U0HPGQ4KH>",
        "ts": "1478044201.001160"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Quick follow up - I’ve got a 9:15am and Matt needs some time tomorrow to pull designs into a deck for sharing, so let’s regroup on patterns when we can, def before lunch.",
        "ts": "1478045762.001161"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "i should be free at any point",
        "ts": "1478046309.001162"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Sounds good - thanks Trent. Looks like we’re all pretty free from 10-12 so we’ll see what works and grab everyone.",
        "ts": "1478046388.001163"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "yes, all game to talk about it tomorrow",
        "ts": "1478047960.001164"
    }
]