[
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "hello all, Zara Evens replied via email and I like her feedback (please see my response in email). <@U026E0ZNR> there are a few notes in what to try\/change in that email. I believe particularly the snow globe effect. \n\nI wrote: “ ...Also, I will speak to the team about the noise and the layering. The snow globe effect is due to the fact that that noise seems to be its own layer.\nIt would be interesting to see how it visually works out when all noise is more ‘attached’ to the color layers rather than being (or seeming to be) its own.”\n\nHope this is agreeing with the rest of you. I must admit I forgot a disclaimer that some of this may already have been discussed in my absence. Apologies if it has. \n\nCheers",
        "ts": "1484249015.000002"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "yes, saw both emails and working on adjustments now",
        "ts": "1484249076.000003"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "cool - thx",
        "ts": "1484249128.000004"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "any questions?",
        "ts": "1484249134.000005"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "i think a clarification that may be useful: it is true that all texture is on its own layer over top of the color layers, though they are mapped directly to the position and movement of those color layers. this is out of necessity with limitations we ran into.",
        "ts": "1484249179.000006"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "i think it will come down to manipulating the blending and whatnot of those texture layers to achieve a texture closer to spraying paint",
        "ts": "1484249229.000007"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "i think that chunkier texture is going to be good to use in some way to push this beyond simple noisy static and make it feel like paint",
        "ts": "1484249371.000008"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "the funny thing of how she ended her feedback saying it’s like “somewhere in between option 1 and option 3” is that literally the only difference between those two is the chunkier texture being in one but not the other",
        "ts": "1484249439.000009"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "so that means we should likely leave that in or alter it, but dial it back more, like you suggested in your response to her",
        "ts": "1484249466.000010"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I want to ask what you all think about color with the examples shared. If we are using blending modes with this viz that sometimes alter All Day brand colors beyond original values, will that be an undesirable contrast to them only using “normal” blending modes everywhere else?",
        "ts": "1484249736.000011"
    },
    {
        "type": "message",
        "subtype": "file_share",
        "text": "<@U026E0ZNR|trent> uploaded a file: <https:\/\/uncorked.slack.com\/files\/trent\/F3Q4T656C\/1-3.png|1-3.png>",
        "file": {
            "id": "F3Q4T656C",
            "created": 1484249746,
            "timestamp": 1484249746,
            "name": "1-3.png",
            "title": "1-3.png",
            "mimetype": "image\/png",
            "filetype": "png",
            "pretty_type": "PNG",
            "user": "U026E0ZNR",
            "editable": false,
            "size": 246010,
            "mode": "hosted",
            "is_external": false,
            "external_type": "",
            "is_public": true,
            "public_url_shared": false,
            "display_as_bot": false,
            "username": "",
            "url_private": "https:\/\/files.slack.com\/files-pri\/T0260V1BR-F3Q4T656C\/1-3.png?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "url_private_download": "https:\/\/files.slack.com\/files-pri\/T0260V1BR-F3Q4T656C\/download\/1-3.png?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "thumb_64": "https:\/\/files.slack.com\/files-tmb\/T0260V1BR-F3Q4T656C-c3fe695acd\/1-3_64.png?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "thumb_80": "https:\/\/files.slack.com\/files-tmb\/T0260V1BR-F3Q4T656C-c3fe695acd\/1-3_80.png?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "thumb_360": "https:\/\/files.slack.com\/files-tmb\/T0260V1BR-F3Q4T656C-c3fe695acd\/1-3_360.png?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "thumb_360_w": 201,
            "thumb_360_h": 360,
            "thumb_480": "https:\/\/files.slack.com\/files-tmb\/T0260V1BR-F3Q4T656C-c3fe695acd\/1-3_480.png?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "thumb_480_w": 268,
            "thumb_480_h": 480,
            "thumb_160": "https:\/\/files.slack.com\/files-tmb\/T0260V1BR-F3Q4T656C-c3fe695acd\/1-3_160.png?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "image_exif_rotation": 1,
            "original_w": 370,
            "original_h": 662,
            "permalink": "https:\/\/uncorked.slack.com\/files\/trent\/F3Q4T656C\/1-3.png",
            "permalink_public": "https:\/\/slack-files.com\/T0260V1BR-F3Q4T656C-43d6acc3a9",
            "channels": [
                "C12DB31V4"
            ],
            "groups": [],
            "ims": [],
            "comments_count": 0
        },
        "user": "U026E0ZNR",
        "upload": true,
        "display_as_bot": false,
        "username": "trent",
        "bot_id": null,
        "ts": "1484249748.000012"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "Hi Trent. Not sure if I understand all your questions, but I believe you are on the right track if you tone down the chunkier texture. Have you tried to use colour texture rather than white? This might also support a spray painted effect, since when you spray paint its the same colour flecks that appear. This might be running into coding limitations?\n\nI leave the colour question to all others, but in principle I got nothing against transitional colours going away from brand colours.",
        "ts": "1484251255.000013"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "good to hear that last part on color shifting being fine with you\n\nthe assets we are using for noise are only two separate assets set to white and using “softlight” blending and opacity to soak up the color beneath them, mimicking colored texture in a way. choosing different colors for different noise layers may very well be possible, but i suspect that would require a substantial shift from how it’s been built. let me try some other options before trying to dive into that.",
        "ts": "1484251560.000014"
    },
    {
        "user": "U0261PCRQ",
        "text": "<@U0261PCRQ|kat> has left the channel",
        "type": "message",
        "subtype": "channel_leave",
        "ts": "1484252225.000015"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "Hey Trent. Sounds good. In addition, there’s an email from Scott. Not sure if I understand everything he says, that’s why I would like to encourage you to directly aim questions to him in case his thoughts are not clear to you. But from what I understand, he is saying something similar to what I said in regards to texture but also adds one other approach. (Urgh, this is a little hard only via email\/slack. Looking forward to speaking in person again - especially including the wider team. Thanks for hanging in there Trent)",
        "ts": "1484253109.000016"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "yes! i saw that email as well. i’m following what he’s saying pretty well. what he’s asking for actually sounds closer to what i did for option 2. i’m reading between the lines and cooking up another iteration right now that i intend to respond with to push the conversation forward in this less-than-ideal email format… in person would be so much better, i agree",
        "ts": "1484253349.000017"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "cool, thanks trent",
        "ts": "1484253414.000018"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "is the above image 1-3.png one of the things mentioned in that email from Zara?",
        "ts": "1484253623.000019"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "yea zara attached that splash screen asset as reminder\/reference of the spray paint texture",
        "ts": "1484253701.000020"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "cool",
        "ts": "1484253713.000021"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "i think what’s important here is that i see neither black or white ‘specks’\ntrent, you are working on a version where the specks have the same colour as the paints that are coming in - right?",
        "ts": "1484253933.000022"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "yes. reason being it’s intended to be a constant build up of color, right?",
        "ts": "1484253979.000023"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "oh wait i may have misread that...",
        "ts": "1484254039.000024"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "the texture is blending with the colors below it to take on those colors, but the texture is not taking on the exact color values of that layer",
        "ts": "1484254077.000025"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "well, why not try that too. if i take red spray its red splatter\/specks. adding yellow spray it will be yellow splatter\/specks. maybe worth trying?",
        "ts": "1484254264.000026"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "it was a matter of it feeling like a significant shift in approach to how chris has developed this",
        "ts": "1484254413.000027"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "thinking out loud, so grain of salt: I think what is difficult in really getting some sort of real 'aerosol' effect is that there's rarely, if ever, negative space. Why we can see the paint in the above screenshot is that it's happening on a white background. Is there any world where we introduce SUBTLE edges of negative space to that view port — something along the lines of how vignetting works in photography, but with white — so you could 'fill in' with color specks?",
        "ts": "1484254415.000028"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "All a long winded way of wondering out loud if adding some sort of negative space in that area might unlock the illusion slightly.",
        "ts": "1484254443.000029"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "i’ll ask Chris to get an estimate of how much effort that would take <@U0HPGQ4KH>",
        "ts": "1484254445.000030"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "i’m also wondering if we can get creative with the illusion of what folks are looking for. like if we can make the value of the color of the specs darker just so when they are blended they feel like more paint versus white specs. just throwing things out there, but we do need to be cognizant of fundamentally shifting the way we’re building this and the timeline impact it may have.",
        "ts": "1484254542.000031"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "i think very close to what you’re saying <@U026103R3>, i’m trying to find creative ways to pull on the levers we already have to potentially get closer to this",
        "ts": "1484254592.000032"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "i have not yet exhausted potential solutions",
        "ts": "1484254608.000033"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "cool",
        "ts": "1484254616.000034"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "depending on how all of this goes, i wonder if a work session with Chris, our team, zara, and scott would make sense? Again, thinking out loud, but it'd be more efficient to understand in realtime and real life both the intent and likely the limitations to think through.",
        "ts": "1484254674.000035"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "yes to all",
        "ts": "1484254851.000036"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "i think that would be great <@U0265G76F>. let me work through some of the edits i have going and share those with Scott and Zara. i want to ask more questions of them to understand their intent rather than execute ideas for solutions when they don’t fully understand the boundaries we’re currently playing within. if we determine we need to shift gears that’s fine, but i suspect it doesn’t need to come to that quite yet",
        "ts": "1484254860.000037",
        "reactions": [
            {
                "name": "+1::skin-tone-3",
                "users": [
                    "U0HPGQ4KH"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "totally. even following along word for word, so much is getting lost in translation.",
        "ts": "1484254891.000038"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "if we do that, let's go to dick blick beforehand and buy a bunch of spray cans. Have a spray party.",
        "ts": "1484254959.000039"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "i think that's a great plan, trent. lmk if I\/we can help with anything at all",
        "ts": "1484255016.000040"
    },
    {
        "type": "message",
        "subtype": "file_share",
        "text": "<@U026E0ZNR|trent> uploaded a file: <https:\/\/uncorked.slack.com\/files\/trent\/F3RHUBDFG\/170112_haze_01.mov|170112_Haze_01.mov> and commented: Sharing progress: dialing down movement by stripping out actual drifting of layer and only having them grow to give the sense of paint being pushed out as more is applied through the lifespan of each layer. Adjusting texture values also.",
        "file": {
            "id": "F3RHUBDFG",
            "created": 1484255966,
            "timestamp": 1484255966,
            "name": "170112_Haze_01.mov",
            "title": "170112_Haze_01.mov",
            "mimetype": "video\/quicktime",
            "filetype": "mov",
            "pretty_type": "QuickTime Movie",
            "user": "U026E0ZNR",
            "editable": false,
            "size": 122875281,
            "mode": "hosted",
            "is_external": false,
            "external_type": "",
            "is_public": true,
            "public_url_shared": false,
            "display_as_bot": false,
            "username": "",
            "url_private": "https:\/\/files.slack.com\/files-pri\/T0260V1BR-F3RHUBDFG\/170112_haze_01.mov?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "url_private_download": "https:\/\/files.slack.com\/files-pri\/T0260V1BR-F3RHUBDFG\/download\/170112_haze_01.mov?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "permalink": "https:\/\/uncorked.slack.com\/files\/trent\/F3RHUBDFG\/170112_haze_01.mov",
            "permalink_public": "https:\/\/slack-files.com\/T0260V1BR-F3RHUBDFG-ce80dd436c",
            "channels": [
                "C12DB31V4"
            ],
            "groups": [],
            "ims": [],
            "comments_count": 1,
            "initial_comment": {
                "id": "Fc3QT99HA6",
                "created": 1484255966,
                "timestamp": 1484255966,
                "user": "U026E0ZNR",
                "is_intro": true,
                "comment": "Sharing progress: dialing down movement by stripping out actual drifting of layer and only having them grow to give the sense of paint being pushed out as more is applied through the lifespan of each layer. Adjusting texture values also."
            },
            "reactions": [
                {
                    "name": "raised_hands::skin-tone-3",
                    "users": [
                        "U0HPGQ4KH"
                    ],
                    "count": 1
                }
            ]
        },
        "user": "U026E0ZNR",
        "upload": true,
        "display_as_bot": false,
        "username": "trent",
        "bot_id": null,
        "ts": "1484255975.000041"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I think one other important thing to acknowledge is that the original brief for this was to create an atmospheric haze, the aerosol texture came in a bit later. I think if we’re going whole hog into replicating aerosol I’d like to dig in a little deeper and adjust color values to be less about blending seamlessly and more about showing the distinct, graphic nature of spray paint. This here is still attempting to live in between those two polls of atmospheric and graphic paint effect.",
        "edited": {
            "user": "U026E0ZNR",
            "ts": "1484256015.000000"
        },
        "ts": "1484256005.000042"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "P.S. Every “burst” you see should equate to 15 minutes of activity",
        "ts": "1484256064.000044"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "that's pretty cool.",
        "ts": "1484256304.000045"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "from my perspective, i think we should push them to think about creating something specifically digital for this. Like - yes it's not exactly aerosol because it's NOT aerosol it's a phone. What could be inspired by real-world things like aerosol but be decidedly a digital product?",
        "ts": "1484256373.000046",
        "reactions": [
            {
                "name": "+1::skin-tone-3",
                "users": [
                    "U0HPGQ4KH",
                    "U0XCJ372R"
                ],
                "count": 2
            }
        ]
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "even seeing the above - with the motion sweeps that are uniquely not aeorsol in a good way for me — it's interesting to think about what possibilities could be here that aren't in the real world spraypaint.",
        "ts": "1484256420.000047"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "+1",
        "ts": "1484256597.000048"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "putting that in the email i’m drafting :thumbsup:",
        "ts": "1484256623.000049",
        "reactions": [
            {
                "name": "facepunch::skin-tone-3",
                "users": [
                    "U0HPGQ4KH"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "i'd phrase it in a way that steered a bit about what we may not get to — EXACTLY spray paint. Steer toward possibility vs. what's not possible, even in the framing of how we speak about it.",
        "ts": "1484256766.000050"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "make 'em forget they ever wanted actual spray paint.",
        "ts": "1484256774.000051"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "good call",
        "ts": "1484256793.000052"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "like",
        "ts": "1484257239.000053"
    }
]