[
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Hey <@U0HPGQ4KH> and <@U026PLK4S>, I’ve got a creative direction\/conceptual question on the Haze viz: How important is it for this to follow the same rules as Lines in regards to it being precisely reproducible no matter what way you interact with it? \n\nHaze will always have a new, randomly selected starting point to make it different than the day before, but we’re running into issues with very specific use cases of adding\/subtracting workouts that could potentially get you different end values (of position\/rotation of haze shapes only, not color values) depending on how you played it. Whereas Lines was a very fixed timeline, Haze could potentially deviate from any predetermined pathway, how do you feel about that?",
        "ts": "1484852011.000002"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "For me, I don't mind that at all. One of the aspects I love about Haze is that it's less quantitive than our strokes pattern.",
        "ts": "1484852163.000003"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "I think moving along the color spectrum is more important than shapes\/rotations",
        "ts": "1484852294.000004"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "exactly what i wanted to hear",
        "ts": "1484852327.000005"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "thanks, that saves us a ton of trouble",
        "ts": "1484852339.000006"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "also - peanut gallery ewald question: What ever happened with our last round of Haze presentations?",
        "ts": "1484852491.000007"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "We actually never had plans to do a last round of presentations, we’ve been keeping up to date and getting design feedback from Scott and Zara via email",
        "ts": "1484852558.000008"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "We checked in with Mimi as well to see if they wanted a more formal review or if that casual share via email would suffice.",
        "ts": "1484852601.000009"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "gotcha.",
        "ts": "1484852614.000010"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "latest and greatest feeling good?",
        "ts": "1484852643.000011"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "They both were seeming very happy with where things were moving. It was getting difficult to get a good feedback loop with quality issues happening over Dropbox, but we’re hoping they can view it live in the build coming up to get the full experience and share further thoughts once they aren’t just looking at screen recordings.",
        "ts": "1484852930.000012"
    }
]