[
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "<http:\/\/techcrunch.com\/2014\/06\/23\/invention-machine-quirky-spins-out-wink-a-new-business-focused-on-the-connected-home\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "Invention Machine Quirky Spins Out \"Wink,\" A New Business Focused On The Connected Home",
                "title_link": "http:\/\/techcrunch.com\/2014\/06\/23\/invention-machine-quirky-spins-out-wink-a-new-business-focused-on-the-connected-home\/",
                "author_name": "Sarah Perez",
                "author_link": "https:\/\/techcrunch.com\/author\/sarahintampa\/",
                "thumb_url": "https:\/\/i0.wp.com\/tctechcrunch2011.files.wordpress.com\/2014\/06\/quirky-display.jpg?fit=440%2C330",
                "thumb_width": 440,
                "thumb_height": 293,
                "text": "New York-based “invention machine” Quirky, a company which turns crowdsourced ideas into real-world products you can buy like this popular flexible power strip, these connected milk jugs and egg cartons, and even app-connected air conditioners built in partnership with GE, is now venturing further into the “smart home” space with the spin-out of a separate company it’s calling “Wink.” The new business will focus on developing a platform for so-called “connected devices” – wireless-enabled products that can communicate via the internet with other services, as well as with apps running on your smartphone.\nAccording to a profile on Quirky in today’s New York Times, the company is now fielding around 4,000 new product ideas per week, of which it selects three to take to production. And more recently, Quirky had been noticing that these product ideas were “internet of things” type products – meaning those designed to communicate with a smartphone or the home’s Wi-Fi network.\n\nSo the idea with Wink, here for iOS and Android, is to set up a platform that will allow consumers to control these various devices from an app which will operate as a dashboard of sorts for everything in their connected home. The app works with more practical things than a smart egg crate, as it allows end users to operate things like lights or door locks, for example.\nThe company has lined up 15 companies who will offer nearly 60 Wink-enabled products by July, including GE, Honeywell, Philips, and startups like Rachio, the Times noted. GE has also chosen Wink as its preferred connected platform, the company says.\nThe first big distribution deal for Wink devices is with The Home Depot, which will sell the products in its some 2,000 U.S. stores and online in mid-July. Wink products will also be sold online on <http:\/\/Amazon.com|Amazon.com>.\nAs for Wink the business itself, it will be run as a subsidiary of Quirky, with its own leadership and development teams, and offices in New York and San Francisco. It will be headed by GM Chaz Flexman, previously a partner at leading VC firm Andreessen Horowitz. Brett Worthington, previously of Ingersoll Rand Security Technologies (Nexia Home Intelligence makers) will be VP at Wink, and Nathan Smith is Wink’s head of engineering.\nWink is not without its competition, however, and that could be a challenge. A number of companies big and small are betting on the “connected home” as being one of the next big markets to exploit, thanks to the rise of the smartphone and home wireless networks. Everyone from the mobile carriers to Apple and Google (with HomeKit and Nest, respectively) are starting to move into the home. Smaller companies are also testing the waters, including those we’ve covered here like SmartThings, Revolv, Insteon, ZigBee, Z-Wave, and even small app makers like Shortcut.\nThere are connected devices from competitors emerging in nearly all categories, too, including locks (August, Lockitron), security (Canary, Doorbot), lights (LIFX), home automation (SmartThings, Zonoff, Ninja Blocks, Ube, Berg, Twine, Xively, etc.), garden products (Bitponics, Click &amp; Grow), bathroom appliances (Withings), nursery products (Sproutling), and more.\n\nSo Quirky’s hope to be one of the leading companies in this broader “smart home” space will depend on more than just getting a handful of partners on board – it will also need to ship products that people like and want to buy more of over time – and that means careful product selection and development.\nIn addition, the Wink software may need some tweaking too, it seems, if you go by what some Amazon shoppers think. Several early adopters trying to get the Wink-powered app to work with one of Quirky’s top products, the power strip, have left frustrated reviews.\n“I tried for almost an hour with a Samsung Galaxy S3 and a Note 3 with brightness maxed in a darkened room before the Wink would detect and log into my home network for programming,” wrote one.\n“I hooked one up, downloaded the Wink app, set up the acct [sic] and everything worked perfectly for about a month. Then there was the software update…It has only worked intermittently since,” complained another.\nIf consumers are going to trust Quirky’s Wink to actually control important and even critical “connected” things in their home like lights, air conditioning, locks and plugs, or smoke alarms, Wink will have to get up to speed, and quickly.",
                "fallback": "TechCrunch Link: Invention Machine Quirky Spins Out \"Wink,\" A New Business Focused On The Connected Home",
                "from_url": "http:\/\/techcrunch.com\/2014\/06\/23\/invention-machine-quirky-spins-out-wink-a-new-business-focused-on-the-connected-home\/",
                "id": 1
            }
        ],
        "ts": "1403589639.000002"
    }
]