[
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "Right - the must have seriously been something behind the scenes stinking up Wisconsin for Gary to have bolted.  Maybe it's a simple as he AD didn't get along or something like that, but there had to have been something.",
        "ts": "1418326888.000002"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "But this is totally an par with Rich-Rod, Graham, Sonny, and Leach",
        "ts": "1418327014.000003"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "I heard that Andersen was trying to get Wisconsin to loosen up their academic requirements. And i think their AD is an ass.",
        "ts": "1418327019.000004"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "And OSU announced some $40 Million facilities upgrade yesterday. Probably didn't hurt.",
        "ts": "1418327050.000005"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "right.   Riley wants to give them a double bird for that move too.",
        "ts": "1418327088.000006"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "He bitched about facilities year in and year out - and the answer was always \"we are paying down our debt\"",
        "ts": "1418327158.000007"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "I always wondered why it felt like all the other Pac 12 teams were spending that new TV money, except OSU.",
        "ts": "1418327366.000008"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "The question is, did Riley leaving make them pull the $42m makover out of their ass, or had that been in the works and Riley left knowing it was coming.",
        "ts": "1418327378.000009"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "i think it was in the works",
        "ts": "1418327392.000010"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "but still wasn't Nebraska",
        "ts": "1418327405.000011"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "Have you seen renderings?  Usually when you announce that stuff if it's been in the works you have renderings that you a showing the board of trustees for approval and stuff.   I haven't seen any of that floating on the internets - which makes me think it was an oh shit when Riley left and they pulled it out of their ass once they realized they had to put up to get a decent coach.",
        "ts": "1418327515.000012"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "It sounded familiar when i heard it yesterday, but maybe you're right. \"Mike Goodwin, president and CEO of the Oregon State University Foundation, said that anonymous gifts totaling $25 million have been secured for the project.\"\n<http:\/\/www.osubeavers.com\/ViewArticle.dbml?DB_OEM_ID=30800&amp;ATCLID=209802574>",
        "attachments": [
            {
                "text": "OSU Announces Valley Center Expansion Plans",
                "fallback": "OSU Announces Valley Center Expansion Plans",
                "from_url": "http:\/\/www.osubeavers.com\/ViewArticle.dbml?DB_OEM_ID=30800&ATCLID=209802574",
                "id": 1
            }
        ],
        "ts": "1418327671.000013"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "It sounds to me like this is all post-Riley reaction",
        "ts": "1418329207.000015"
    }
]