[
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "<http:\/\/bgr.com\/2014\/05\/06\/comcast-internet-service-criticism-twc-cablevision-level-3\/>",
        "attachments": [
            {
                "service_name": "BGR",
                "service_url": "http:\/\/bgr.com",
                "title": "Level 3 calls out Comcast, TWC and others for 'deliberately harming' their own broadband service",
                "title_link": "http:\/\/bgr.com\/2014\/05\/06\/comcast-internet-service-criticism-twc-cablevision-level-3\/",
                "author_name": "Zach Epstein",
                "author_link": "https:\/\/bgr.com\/author\/zacharye\/",
                "thumb_url": "https:\/\/i0.wp.com\/boygeniusreport.files.wordpress.com\/2011\/07\/datatunnel110728175527.gif?fit=440%2C330",
                "thumb_width": 440,
                "thumb_height": 290,
                "text": "Level 3, a tier 1 Internet service provider based in Colorado, has called out Comcast, Charter, Time Warner Cable and other top U.S. ISPs for “deliberately harming the service they deliver to their paying customers.”\nIn a thorough post that goes into great detail about the networks that deliver Internet service to homes and businesses across the globe, Level 3′s VP of Content and Media Mark Taylor explained “peering,” a term that has been pulled into the mainstream media recently. Netflix, as we’re sure you have read, has agreed to pay certain ISPs a “ransom” in order to reduce peering congestion and deliver faster streaming video to its subscribers.\n“Level 3 builds a route map of the Internet by connecting its tens of thousands of customers together and allowing them to communicate. So a Level 3 customer in Hong Kong can communicate with a Level 3 customer in Sao Paulo. But to complete the map we also need to fill in interconnection to everyone who isn’t a direct Level 3 customer, so that our customers can also communicate with those who are not our customers,” Taylor explained on Level 3′s blog. “We do that through connections to other networks and their customers. This latter sort of connectivity is often called peering. Peering connections allow for exchanges of traffic between the respective customers of each peer.”\nThe executive went on to explain the process in great detail, and also to explain some issues that might cause peering congestion and slow down Internet service for subscribers.\n“Level 3 has 51 peers that are interconnected in 45 cities through over 1,360 10 Gigabit Ethernet ports (plus a few smaller ports). The distribution of that capacity with individual peers ranges from a single 10 Gigabit Ethernet port to 148 ports,” Taylor wrote.\nHe then said that the average utilization across those interconnected ports is 36%. Utilization at 12 of Level 3′s ports is in excess of 90%, however, which is saturated and causes service slowdowns and packet loss. Level 3 is currently working with six of those 12 partner ISPs to upgrade service and resolve issues.\nThe remaining six peers, however, refuse to work with Level 3 to address the congestion. These ports have been saturated for more than a year according to Taylor, but the ISPs still refuse to work toward a resolution.\n“They are deliberately harming the service they deliver to their paying customers,” Taylor wrote. “They are not allowing us to fulfil the requests their customers make for content.”\nWhich six ISPs are we talking about here? Taylor stops short of naming them, but he still manages to shame them.\n“Five of those congested peers are in the United States and one is in Europe,” he said. “There are none in any other part of the world. All six are large Broadband consumer networks with a dominant or exclusive market share in their local market. In countries or markets where consumers have multiple Broadband choices (like the UK) there are no congested peers.”\nTaylor also noted that the ISPs in question “happen to rank dead last in customer satisfaction across all industries in the U.S.,” and he linked to the American Customer Satisfaction Index, which regularly ranks ISPs including Comcast, Time Warner Cable, Charter, Cox, Verizon and Cablevision at the bottom of customer satisfaction surveys.",
                "fallback": "BGR Link: Level 3 calls out Comcast, TWC and others for 'deliberately harming' their own broadband service",
                "from_url": "http:\/\/bgr.com\/2014\/05\/06\/comcast-internet-service-criticism-twc-cablevision-level-3\/",
                "id": 1
            }
        ],
        "ts": "1399394293.000002"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "<http:\/\/dberkholz-media.redmonk.com\/dberkholz\/files\/2013\/12\/github_new_repos_multiplot_custom.png>",
        "attachments": [
            {
                "from_url": "http:\/\/dberkholz-media.redmonk.com\/dberkholz\/files\/2013\/12\/github_new_repos_multiplot_custom.png",
                "fallback": "1153x817px image",
                "image_url": "http:\/\/dberkholz-media.redmonk.com\/dberkholz\/files\/2013\/12\/github_new_repos_multiplot_custom.png",
                "image_width": 1153,
                "image_height": 817,
                "image_bytes": 113045,
                "id": 1
            }
        ],
        "ts": "1399395621.000004"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Github in 2013",
        "ts": "1399395630.000006"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "So basically everyone's just writing CSS now?",
        "ts": "1399395643.000007"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "and JavaScript",
        "ts": "1399395660.000008"
    },
    {
        "type": "message",
        "user": "U026NAD9A",
        "text": "goodbye Perl",
        "ts": "1399395677.000009"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "I partially blame all those learn to code programs. Loads of new people being introduced to high-level languages. Will be interesting to see if this trend translates to low level langs over time.",
        "ts": "1399395775.000010"
    },
    {
        "type": "message",
        "user": "U02895311",
        "text": "I hope it continues. The more people that can only work with high level languages means less competition for dorks like me that like lower level languages.",
        "ts": "1399395971.000011"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "Agreed. Anyone wanna talk about CoreGraphics or CoreAudio nuances?",
        "ts": "1399396001.000012"
    },
    {
        "type": "message",
        "user": "U026NAD9A",
        "text": "yeah! everyone switch to javascript!~",
        "ts": "1399396004.000013"
    },
    {
        "type": "message",
        "user": "U02895311",
        "text": "Because eventually you always need somebody to write C when performance becomes critical",
        "ts": "1399396011.000014"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": ":feelsgood:",
        "ts": "1399396028.000015"
    },
    {
        "type": "message",
        "user": "U026NAD9A",
        "text": "the more JS\/CSS programmers, the less chance that I'll ever have to write any JS ever again",
        "ts": "1399396031.000016"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Don't think I understood that <@U026NAD9A>",
        "ts": "1399396231.000017"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "<http:\/\/www.nerdist.com\/2014\/04\/nerdist-podcast-eddie-izzard-returns\/>",
        "attachments": [
            {
                "service_name": "Nerdist",
                "title": "Nerdist Podcast: Eddie Izzard Returns",
                "title_link": "http:\/\/www.nerdist.com\/2014\/04\/nerdist-podcast-eddie-izzard-returns\/",
                "text": "The hilarious Eddie Izzard returns to the Nerdist podcast for his own episode! He talks about performing comedy in different languages and foreign countries, beginning his comedy career in the birth of alt-comedy, and his viewew on the strange world of...",
                "fallback": "Nerdist: Nerdist Podcast: Eddie Izzard Returns",
                "thumb_url": "http:\/\/www.nerdist.com\/wp-content\/uploads\/2014\/04\/nerdist513FB.jpg",
                "from_url": "http:\/\/www.nerdist.com\/2014\/04\/nerdist-podcast-eddie-izzard-returns\/",
                "thumb_width": 560,
                "thumb_height": 292,
                "id": 1
            }
        ],
        "ts": "1399398274.000018"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "<http:\/\/www.heliumcomedy.com\/portland\/calendar.php?month=6&amp;day=12&amp;year=2014>",
        "attachments": [
            {
                "text": "Featuring National Headliners Weekly Helium Comedy Club in Portland, OR",
                "fallback": "Featuring National Headliners Weekly Helium Comedy Club in Portland, OR",
                "from_url": "http:\/\/www.heliumcomedy.com\/portland\/calendar.php?month=6&day=12&year=2014",
                "id": 1
            }
        ],
        "ts": "1399398312.000020"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "(Chris Hardwick is coming to town)",
        "ts": "1399398323.000022"
    }
]