[
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "is it software or hardware?",
        "ts": "1403807417.000002"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "or...something silly like BaaS",
        "ts": "1403807442.000003"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "<http:\/\/www.dodocase.com\/products\/google-cardboard-vr-goggle-toolkit>",
        "attachments": [
            {
                "service_name": "DODOcase",
                "title": "Google Cardboard VR goggle toolkit",
                "title_link": "http:\/\/www.dodocase.com\/products\/google-cardboard-vr-goggle-toolkit",
                "text": "Protect your Product Feed with the Google Cardboard VR toolkit from DODOcase. The Product Feed case is handcrafted in San Francisco using traditional bookbinding techniques.",
                "fallback": "DODOcase: Google Cardboard VR goggle toolkit",
                "thumb_url": "http:\/\/cdn.shopify.com\/s\/files\/1\/0046\/6182\/products\/Slice_1_large.jpg?v=1403743368",
                "from_url": "http:\/\/www.dodocase.com\/products\/google-cardboard-vr-goggle-toolkit",
                "thumb_width": 480,
                "thumb_height": 317,
                "id": 1
            }
        ],
        "ts": "1403823192.000004"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "wait this is a real thing <http:\/\/time.com\/2925768\/the-weirdest-thing-at-google-io-was-this-cardboard-virtual-reality-box\/>",
        "attachments": [
            {
                "service_name": "TIME",
                "service_url": "http:\/\/time.com",
                "title": "The Weirdest Thing at Google I\/O Was This Cardboard Virtual Reality Box",
                "title_link": "http:\/\/time.com\/2925768\/the-weirdest-thing-at-google-io-was-this-cardboard-virtual-reality-box\/",
                "author_name": "Jared Newman",
                "author_link": "https:\/\/time.com\/author\/jarednewman\/",
                "thumb_url": "https:\/\/i0.wp.com\/timedotcom.files.wordpress.com\/2014\/06\/googlecardboard.jpg?fit=440%2C330",
                "thumb_width": 440,
                "thumb_height": 293,
                "text": "When Sundar Pichai announced that everyone at the Google I\/O developers conference would get “Cardboard,” his tone was so understated that no one seemed to know whether he was deadpanning or being serious.\nBut sure enough, as we shuffled out of the conference room, clusters of Google staffers were handing out slabs of corrugated cardboard. Further inspection revealed that the cardboard could be unfolded, then folded back into the shape of a virtual reality headset, complete with a pair of magnifying lenses.\nIt turns out that Cardboard is no joke. Once it’s assembled, you just plop an Android phone inside, then load up the companion Cardboard app. From here, you can run several virtual reality demos, complete with head tracking through the phone’s accelerometers and gyroscopes. You can look around a virtual Hall of Mirrors, fly through Chicago with your head as the steering wheel, view YouTube videos as if you’re sitting in a movie theater and explore 360-degree panoramic photos.\nBecause your phone is all boxed up, you can’t reach the touch screen while using Cardboard. This is where things get even weirder: The box includes a metallic ring that snaps to the box through a magnet on the opposite side. Using your phone’s magnetometer, the ring acts as a trigger when you flick it downward, letting you select items as they come into view. (Cleverly, the box also includes rubber bands on each side of where the phone sits, to prevent it from sliding out.)\nIf you want to check Cardboard out yourself, it’s possible to build your own. The only downside is that there’s a bit of latency to the motion controls. It might make you want to hurl.\nGoogle’s Cardboard is hardly the first virtual reality project to make use of the smartphone. Devices like the Durovis Dive are already available for purchase, and Samsung is reportedly working with Oculus VR on a headset powered by Galaxy phones. As The Verge points out, USC professor Mark Bolas came up with another do-it-yourself VR phone cradle a couple years ago.\nDon’t expect Cardboard to become a frontrunner in the race for VR supremacy. Still, it’s a cute idea, and a throwback to the old Google, whose random public-facing projects weren’t always just for commercial gain, but for fun.",
                "fallback": "TIME Link: The Weirdest Thing at Google I\/O Was This Cardboard Virtual Reality Box",
                "from_url": "http:\/\/time.com\/2925768\/the-weirdest-thing-at-google-io-was-this-cardboard-virtual-reality-box\/",
                "id": 1
            }
        ],
        "ts": "1403823734.000006"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "totally real",
        "ts": "1403823927.000008"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "supposedly pretty good too",
        "ts": "1403823931.000009"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "oh my gosh. game changer? or change-gamer?(?) <http:\/\/arstechnica.com\/gadgets\/2014\/06\/chromecast-will-talk-to-smartphones-using-ultrasonic-tones\/>",
        "attachments": [
            {
                "service_name": "Ars Technica",
                "title": "How Chromecast will talk to smartphones without Wi-Fi or Bluetooth",
                "title_link": "http:\/\/arstechnica.com\/gadgets\/2014\/06\/chromecast-will-talk-to-smartphones-using-ultrasonic-tones\/",
                "text": "A bat signal from the streaming stick will let you pass videos to the TV.",
                "fallback": "Ars Technica: How Chromecast will talk to smartphones without Wi-Fi or Bluetooth",
                "image_url": "http:\/\/cdn.arstechnica.net\/wp-content\/uploads\/2014\/06\/sonic-networking-640x353.png",
                "image_width": 453,
                "image_height": 250,
                "from_url": "http:\/\/arstechnica.com\/gadgets\/2014\/06\/chromecast-will-talk-to-smartphones-using-ultrasonic-tones\/",
                "image_bytes": 214852,
                "id": 1
            }
        ],
        "ts": "1403848403.000010"
    }
]