[
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "<http:\/\/qz.com\/304929\/almost-no-one-is-using-the-new-version-of-android\/?utm_content=buffer95819&amp;utm_medium=social&amp;utm_source=twitter.com&amp;utm_campaign=buffer>",
        "attachments": [
            {
                "service_name": "Quartz",
                "service_url": "http:\/\/qz.com",
                "title": "Almost no one is using the new version of Android",
                "title_link": "http:\/\/qz.com\/304929\/almost-no-one-is-using-the-new-version-of-android\/?utm_content=buffer95819&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer",
                "author_name": "Stefan Constantinescu",
                "author_link": "https:\/\/qz.com\/author\/stefanqz\/",
                "thumb_url": "https:\/\/i0.wp.com\/qzprod.files.wordpress.com\/2014\/11\/ap110601049742.jpg?fit=200%2C150",
                "thumb_width": 200,
                "thumb_height": 112,
                "text": "Apple recently had to reveal a rare piece of disappointing news: That adoption of its latest mobile operating system, iOS 8, has been happening more slowly than the previous version last year. But even that is lightning-speed, compared with the adoption rate for Google’s new Android OS release.\nAccording to the latest Android developer stats, Lollipop—the nickname for Android version 5.0—is installed on so few devices that it fails to even register on the charts. That is, it’s running on fewer than 0.1% of handsets.\n\nThis isn’t entirely a surprise. While Apple releases its operating systems on its own, and supports most of its recent devices with each new update, Android trickles out more slowly and haphazardly. It has always taken a while for device makers and mobile operators—which are in charge of distributing new Android releases—to customize and test their specific flavors of Android. In this case, Google’s Nexus 9 users had Lollipop already installed when the new device started shipping on Nov. 3, while other Nexus products gained access to Lollipop on Nov. 12.\nBut that’s when it starts to break down. For LG’s G3 handset, for example, the upgrade was first available only in Poland.\nThere’s no doubt that the ability for companies to use and customize Android relatively freely has helped make it the world’s most popular operating system. But Google can still stand to do much better for its users. For all the talk of Google taking back more control of Android, this seems like meager progress so far. For context, Apple’s iOS 8 adoption—that rare decline—stood at 47% after three weeks.\nAnd think for a second about the plight of app makers. If only small numbers of Android users are on the latest version, what incentive is there to adopt the new features in the OS, or optimize code for it? This is one of many reasons why, despite Android’s dominant market position, still few software developers are building “Android first.”",
                "fallback": "Quartz Link: Almost no one is using the new version of Android",
                "from_url": "http:\/\/qz.com\/304929\/almost-no-one-is-using-the-new-version-of-android\/?utm_content=buffer95819&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer",
                "id": 1
            }
        ],
        "ts": "1417897734.000002"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "I kind of figured this would happen. After all the kit Kat point updates, I bet Samsung etc are whiplashed with ports.",
        "ts": "1417897764.000004"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "I just got my nexus 9 keyboard cover, and so far I hate it so much I might return it",
        "ts": "1417898448.000002"
    }
]