[
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "keyboard nerds: <https:\/\/www.eventbrite.com\/e\/meet-the-keyboardio-model-01-portland-or-at-adx-tickets-17316321584>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "Meet the Keyboardio Model 01: Portland, OR at ADX!",
                "title_link": "https:\/\/www.eventbrite.com\/e\/meet-the-keyboardio-model-01-portland-or-at-adx-tickets-17316321584",
                "text": "TL;DR:  Come meet the Keyboardio Model 01, and hang out with its creators too. About the venue:  Art Design Portland, or ADX for short, is a collaboration hub, makerspace, learning center, and fabrication shop.  In the 14,000-square foot facility, high-profile designers work alongside students, retirees share their knowledge with novice builders, and entrepreneurs collaborate with hobbyists. Everyone is welcome to join and gain access to the woodshop, metal shop, and digital design lab.  Members and non-members alike are welcome to take classes taught by the community.  ADX has incubated over 100 businesses, helped 200 crowd-funded projects reach their goals, and provided a home-away-from-home for thousands of designers, builders, entrepreneurs, hobbyists, designers and artists.  --- As we've been building what's become the Model 01, we've talked to hundreds of you online, at conferences, and at festivals. It's been amazing to watch folks suddenly \"get it\" as they put their hands on a Model 01 in person for the first time. We'll have a few Model 01 prototypes with us for you to try out, as well as a deconstructed Model 01 and a few earlier prototypes. If folks are interested, we can also do a short talk about the adventure of building your own keyboard from scratch, a short talk or Q&amp;A session about turning your hobby project into your day job, going through a hardware incubator or just about anything else folks want to know about. We want to bring that experience to as many people possible, so we're trying something we don't think anyone has ever done during a Kickstarter campaign: a coast-to-coast roadshow. A few days after the campaign launches, we'll be starting off from Somerville, MA, where this whole adventure began and zig-zagging across America on our way to Oakland, CA, where we've been living for the past year. RSVPs are encouraged but not required. (In other words, it's ok to show up, even if you didn't RSVP). Please back our Kickstarter: <http:\/\/keyboard.io\/kickstarter> If you've backed our Kickstarter (or promise to), we'll give you stickers.",
                "fallback": "Eventbrite: Meet the Keyboardio Model 01: Portland, OR at ADX!",
                "thumb_url": "https:\/\/img.evbuc.com\/https%3A%2F%2Fimg.evbuc.com%2Fhttps%253A%252F%252Fcdn.evbuc.com%252Fimages%252F13770309%252F145164517003%252F1%252Foriginal.jpg%3Frect%3D191%252C23%252C1614%252C807%26s%3D0681ef061814bda9fb301dd9c74a33b5?w=1000&s=eb4ecfba69cc6652eb831696e19f8fb8",
                "from_url": "https:\/\/www.eventbrite.com\/e\/meet-the-keyboardio-model-01-portland-or-at-adx-tickets-17316321584",
                "thumb_width": 1000,
                "thumb_height": 500,
                "id": 1
            }
        ],
        "ts": "1436559613.000002"
    }
]