[
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "<http:\/\/techcrunch.com\/2015\/12\/02\/the-formlabs-form-2-brings-the-3d-printing-magic-again\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "The Formlabs Form 2 Brings The 3D-Printing Magic (Again)",
                "title_link": "http:\/\/techcrunch.com\/2015\/12\/02\/the-formlabs-form-2-brings-the-3d-printing-magic-again\/",
                "author_name": "John Biggs",
                "thumb_url": "https:\/\/i2.wp.com\/tctechcrunch2011.files.wordpress.com\/2015\/09\/formlabs-form-2-tabletop1.jpg?fit=200%2C150",
                "thumb_width": 200,
                "thumb_height": 133,
                "text": "Home 3D printing has grown by leaps and bounds over the past half decade. While some of the fluff and excitement has gone out of the technology, it is still the closest thing to magic we have in our world. The idea that we can apparate objects out of thin air, that we can convert bits to atoms is wonderfully heady stuff.\nWhen Formlabs first launched their Form 1 it was a true hack. Designed to bring the price of stereolithographic printing down to manageable levels it had quite a few flaws including exposed optics and a tank system that was susceptible to frustrating failures. It was, in short, imperfect and fairly expensive. But people loved it and the company has gone on to be one of the most important 3D printing organizations in the world. If Makerbot is Canon and the big guys like 3D Systems are Hasselblad, Formlabs is Leica – and the Form 2 is their M-Series.\nFirst, a bit about the technology. The Form 2 uses a special photosensitive resin and a laser system to print objects. A print platform dips itself deep into the resin, a laser draws the shape (actually one layer of the print) and then the platform moves up slightly. It repeats this process until the plate is actually out of the resin and the laser is adhering new layers to the actual object. Repeat this a few hundred times and you have a solid object. The object must then be cured in isopropyl alcohol to complete the process.\nThis process is called stereolithography and has been around for decades. Formlabs took the technology and made it accessible, no mean feat. However the first model was sometimes imprecise and often the prints turned into a big blob of resin at the bottom of the tray.\nThe Form 2 takes everything wrong with the original model and fixes it. Gone is the wonky tank-filling process in which you had to pour resin to a line that you could barely see. Now the system pours its own resin and a stirrer controls the consistency. Gone are the exposed optics of the original, replaced by a glass panel that encases the lasers to ensure precision. There is even a self-leveling system that ensures that your prints don’t come out wobbly or cock-eyed.\nThe new printer also has a larger print area – 5.7 x 5.7 x 6.9 inches – and enough resolution to make you realize that 3D print files are actually models of real objects in digital form and that, with the touch of a button, you can make them, real.\nThe Form 2 is not for the faint of heart, however. While the company worked hard to make it as easy-to-use as possible the system still uses a light sensitive resin that must be cured in isopropyl alcohol, a process that is at once messy and potentially hazardous. This is not the printer you want in a grade school, it’s the printer you want in a college or small office.\n\n\n\nWhat can you build with it? My favorite print appears below: it is a solid, fully detailed triceratops with horns, a snout, toes, and tail. It looks like something you would buy in a museum shop and, quite unbelievably, it’s as solid as anything you can get out of an injection mold. It is a little brittle, but for building models of solid objects it is amazing. I would even argue that this is a perfect system for making molds for less high-tech forms of manufacture.\n\n    \n\t\t            \n\t\t            Formlabs Form 2 Tabletop\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            Formlabs Form 2\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            Formlabs Form 2 w Max\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            Formlabs Form 2 w Max Wide\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            Formlabs Form 2 Resin Bottles\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            Formlabs Form 2 Prints\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            Formlabs Form 2 Platform Wipe\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            Formlabs Form 2 PreForm Desktop App\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            Formlabs Form 2 Laser Curing Open 2\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            Formlabs Form 2 Laser Curing Open\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            Formlabs Form 2 Laser Curing\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            Formlabs Form 2 Open Top\n\t\t            \n\t\t            \n\t\t        \n\t    \n\t         View Slideshow\n\t    \n\t    \n\t        Previous\n\t        Next\n\t        Exit\n\t    \n\t\nThe system comes with a liter of resin and a finish kit including gloves – to protect you against the aforementioned alcohol and resin – a scraper and a special stand that holds up the build platform. This finishing kit is far better than the previous version and can be left on a desk without making it look like you work in a mad scientist’s lab. Extra liters cost $149 and come in multiple shades of grey.\nThe prints stick to the build plate like stalactites and there is a network of supports that touch the prints at specific points to make it easier for the system to “extrude” the shape. Interestingly, the software now adds little “tabs” that stick up and allow you to gain purchase under the print supports to pull the entire thing off in one piece, a feature that I hadn’t seen in the Form 1. Formlabs has also added an excellent interface that allows you to control the entire print using a touchscreen and one button.\nOverall this is a massive improvement to the Form printer. It is usable, fun, and the products are almost perfect if you’re careful when you pull them off the plate. While it is still a prosumer product – you need to be ready to work to get your items looking great – it is one of the best home\/small office 3D printers out there and I would recommend it over any other SLA printer barring true industrial models. Need something that can make things quickly and without much resolution? Grab an filament-based printer like the Makerbot. Need something that makes real objects? This is your printer.\nThe printer costs $3,499 and is shipping now. If this printer does anything it reminds us that 3D printing is truly magic and I would argue that the Form 2 defines the prosumer market in this space. You can’t get this sort of quality, speed, and system design out of lesser printers and it improves upon the Form 1 to a degree that is unparalleled. To quote Ferris Bueller, if you have the means, I highly recommend picking one up.\n\n    \n\t\t            \n\t\t            scaled-5553\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            scaled-5557\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            scaled-5547\n\t\t            \n\t\t            \n\t\t        \n\t    \n\t         View Slideshow\n\t    \n\t    \n\t        Previous\n\t        Next\n\t        Exit\n\t    \n\t\n\n    \n\t\t            \n\t\t            scaled-5560\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            scaled-5559\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            scaled-5569\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            scaled-5568\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            scaled-5565\n\t\t            \n\t\t            \n\t\t        \n\t    \n\t         View Slideshow\n\t    \n\t    \n\t        Previous\n\t        Next\n\t        Exit",
                "fallback": "TechCrunch Link: The Formlabs Form 2 Brings The 3D-Printing Magic&nbsp;(Again)",
                "from_url": "http:\/\/techcrunch.com\/2015\/12\/02\/the-formlabs-form-2-brings-the-3d-printing-magic-again\/",
                "id": 1
            }
        ],
        "ts": "1449086502.000002"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "<http:\/\/www.riken.jp\/en\/pr\/press\/2015\/20151124_2\/>",
        "ts": "1449100649.000004"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "“...the outermost part of the liquid core—where the pressure is about 1.3 million atmospheres, and the temperature about 4,000 K…\"",
        "ts": "1449100780.000005"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "holy fuck",
        "ts": "1449100788.000006"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "that’s an incredible amount of stored energy",
        "ts": "1449100804.000007"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "converting units from GPa... 52 million PSI at core",
        "ts": "1449100912.000008"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "and quite hot",
        "ts": "1449100915.000009"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "<http:\/\/googlecloudplatform.blogspot.com\/2015\/12\/Google-Cloud-Vision-API-changes-the-way-applications-understand-images.html?m=1>",
        "ts": "1449114506.000010"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Oooooooohhhhhhhhhhhshhhhiiiiiiiittttttt",
        "ts": "1449114562.000011"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "that’s awesome",
        "ts": "1449114681.000012"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "\"Our demo robot can roam and identify objects, including smiling faces\"",
        "ts": "1449121723.000013"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "can we have a robot that roams the office identifying things and sighing to itself?",
        "ts": "1449121748.000014"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "Then what would you do all day ",
        "ts": "1449123914.000015"
    }
]