[
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "android wear now has interactive watch faces. It’s like a live wallpaper for your wrist <http:\/\/www.engadget.com\/2015\/08\/20\/android-wear-update-makes-watch-faces-come-to-life\/>",
        "attachments": [
            {
                "service_name": "Engadget",
                "title": "Android Wear update makes watch faces come to life",
                "title_link": "http:\/\/www.engadget.com\/2015\/08\/20\/android-wear-update-makes-watch-faces-come-to-life\/",
                "text": "Google's upcoming Android Wear update should make those watch faces much more useful.",
                "fallback": "Engadget: Android Wear update makes watch faces come to life",
                "image_url": "http:\/\/o.aolcdn.com\/dims-global\/dims\/GLOB\/5\/600\/315\/http:\/\/o.aolcdn.com\/dims-shared\/dims3\/GLOB\/crop\/4000x2670+0+0\/resize\/1200x801!\/format\/jpg\/quality\/85\/http:\/\/hss-prod.hss.aol.com\/hss\/storage\/midas\/13e9d2e50ae4e40524a1aee1942823cf\/202507312\/475030638.jpg",
                "image_width": 476,
                "image_height": 250,
                "from_url": "http:\/\/www.engadget.com\/2015\/08\/20\/android-wear-update-makes-watch-faces-come-to-life\/",
                "image_bytes": 35146,
                "id": 1
            }
        ],
        "ts": "1440177192.000002"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "<https:\/\/vimeo.com\/136764796>",
        "attachments": [
            {
                "service_name": "Vimeo",
                "service_url": "https:\/\/vimeo.com\/",
                "title": "GLASS",
                "title_link": "https:\/\/vimeo.com\/136764796",
                "author_name": "Mediated Matter Group",
                "author_link": "http:\/\/vimeo.com\/mediatedmattergroup",
                "thumb_url": "http:\/\/i.vimeocdn.com\/video\/531398810_295x166.jpg",
                "thumb_width": 295,
                "thumb_height": 166,
                "text": "Glass 3D Printing (G3DP)\n\nAdditive Manufacturing of Optically Transparent Glass developed by the Mediated Matter Group at the MIT Media Lab in collaboration with the Glass Lab at MIT.\n\nAncient yet modern, enclosing yet invisible, glass was first created in Mesopotamia and Ancient Egypt 4,500 years ago. Precise recipes for its production - the chemistry and techniques - often remain closely guarded secrets. Glass can be molded, formed, blown, plated or sintered; its formal qualities are closely tied to techniques used for its formation.\n\nFrom the discovery of core-forming process for bead-making in ancient Egypt, through the invention of the metal blow pipe during Roman times, to the modern industrial Pilkington process for making large-scale flat glass; each new breakthrough in glass technology occurred as a result of prolonged experimentation and ingenuity, and has given rise to a new universe of possibilities for uses of the material. This show unveils a first of its kind optically transparent glass printing process called G3DP.\n\nG3DP is an additive manufacturing platform designed to print optically transparent glass. The tunability enabled by geometrical and optical variation driven by form, transparency and color variation can drive; limit or control light transmission, reflection and refraction, and therefore carries significant implications for all things glass. The platform is based on a dual heated chamber concept. The upper chamber acts as a Kiln Cartridge while the lower chamber serves to anneal the structures. The Kiln Cartridge operates at approximately 1900°F and can contain sufficient material to build a single architectural component. The molten material gets funneled through an alumina-zircon-silica nozzle. The project synthesizes modern technologies, with age-old established glass tools and technologies producing novel glass structures with numerous potential applications.\n\nThe G3DP project was created in collaboration between the Mediated Matter group at the MIT Media Lab, the Mechanical Engineering Department, the MIT Glass Lab and Wyss Institute. Researchers include John Klein, Michael Stern, Markus Kayser, Chikara Inamura, Giorgia Franchin, Shreya Dave, James Weaver, Peter Houk and Prof. Neri Oxman.",
                "fallback": "Vimeo Video: GLASS",
                "video_html": "<iframe src=\"https:\/\/player.vimeo.com\/video\/136764796\" width=\"400\" height=\"225\" frameborder=\"0\" title=\"GLASS\" webkitallowfullscreen mozallowfullscreen allowfullscreen><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "from_url": "https:\/\/vimeo.com\/136764796",
                "id": 1
            }
        ],
        "ts": "1440194293.000004"
    }
]