[
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "<https:\/\/twitter.com\/WorfEmail\/status\/691717381241098245>",
        "attachments": [
            {
                "fallback": "<https:\/\/twitter.com\/WorfEmail|@WorfEmail>: Commander,\n\nThank you for the LinkedIn recommendation. Should I write one for you as well?\n\nWorf",
                "ts": 1453753249,
                "author_name": "Worf Email",
                "author_link": "https:\/\/twitter.com\/WorfEmail\/status\/691717381241098245",
                "author_icon": "https:\/\/pbs.twimg.com\/profile_images\/654554221606404096\/36B4emY6_normal.jpg",
                "author_subname": "@WorfEmail",
                "text": "Commander,\n\nThank you for the LinkedIn recommendation. Should I write one for you as well?\n\nWorf",
                "service_name": "twitter",
                "service_url": "https:\/\/twitter.com\/",
                "from_url": "https:\/\/twitter.com\/WorfEmail\/status\/691717381241098245",
                "id": 1,
                "footer": "Twitter",
                "footer_icon": "https:\/\/a.slack-edge.com\/6e067\/img\/services\/twitter_pixel_snapped_32.png"
            }
        ],
        "ts": "1453844415.000002"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "<https:\/\/medium.com\/@DonRumsfeld\/at-83-i-decided-to-develop-an-app-dadd4e53d342#.d0cuj9hf4>",
        "attachments": [
            {
                "service_name": "Medium",
                "title": "At 83, I Decided to Develop an App",
                "title_link": "https:\/\/medium.com\/@DonRumsfeld\/at-83-i-decided-to-develop-an-app-dadd4e53d342#.d0cuj9hf4",
                "text": "I’ve done business, politics, and war. Now I’m trying my hand at mobile gaming.",
                "fallback": "Medium: At 83, I Decided to Develop an App",
                "image_url": "https:\/\/cdn-images-1.medium.com\/max\/800\/1*ZX0pztrdHw2ZEYA0M0dw2w.jpeg",
                "fields": [
                    {
                        "title": "Reading time",
                        "value": "5 mins",
                        "short": true
                    }
                ],
                "ts": 1453676783,
                "from_url": "https:\/\/medium.com\/@DonRumsfeld\/at-83-i-decided-to-develop-an-app-dadd4e53d342#.d0cuj9hf4",
                "image_width": 601,
                "image_height": 250,
                "image_bytes": 82903,
                "id": 1
            }
        ],
        "ts": "1453844567.000004"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "<https:\/\/twitter.com\/waxpancake\/status\/691683576593559552>",
        "attachments": [
            {
                "fallback": "<https:\/\/twitter.com\/waxpancake|@waxpancake>: Donald Rumsfeld's new iOS game is free-to-play with IAP, the business model of choice for war criminals. <https:\/\/pbs.twimg.com\/media\/CZlaitaUkAAZPdZ.jpg>",
                "ts": 1453745190,
                "author_name": "Andy Baio",
                "author_link": "https:\/\/twitter.com\/waxpancake\/status\/691683576593559552",
                "author_icon": "https:\/\/pbs.twimg.com\/profile_images\/590385501179289602\/qvTvxmCX_normal.png",
                "author_subname": "@waxpancake",
                "text": "Donald Rumsfeld's new iOS game is free-to-play with IAP, the business model of choice for war criminals. <https:\/\/pbs.twimg.com\/media\/CZlaitaUkAAZPdZ.jpg>",
                "service_name": "twitter",
                "service_url": "https:\/\/twitter.com\/",
                "image_url": "https:\/\/pbs.twimg.com\/media\/CZlaitaUkAAZPdZ.jpg",
                "image_width": 598,
                "image_height": 336,
                "image_bytes": 43831,
                "from_url": "https:\/\/twitter.com\/waxpancake\/status\/691683576593559552",
                "id": 1,
                "footer": "Twitter",
                "footer_icon": "https:\/\/a.slack-edge.com\/6e067\/img\/services\/twitter_pixel_snapped_32.png"
            }
        ],
        "ts": "1453844611.000006"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "that guy",
        "ts": "1453844777.000008"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "all proceeds go to charity",
        "ts": "1453844802.000009"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "<http:\/\/blog.chipx86.com\/2016\/01\/26\/a-tribute-to-vmware-workstation-fusion-and-hosted-ui\/>",
        "attachments": [
            {
                "service_name": "ChipLog",
                "service_url": "http:\/\/blog.chipx86.com",
                "title": "A Tribute to VMware Workstation, Fusion, and Hosted UI",
                "title_link": "http:\/\/blog.chipx86.com\/2016\/01\/26\/a-tribute-to-vmware-workstation-fusion-and-hosted-ui\/",
                "author_name": "chipx86",
                "author_link": "https:\/\/blog.chipx86.com\/author\/chipx86\/",
                "thumb_url": "https:\/\/i1.wp.com\/chipx86.files.wordpress.com\/2016\/01\/poker.jpg?fit=200%2C150",
                "thumb_width": 200,
                "thumb_height": 131,
                "text": "Yesterday morning, the Hosted UI team, responsible for VMware’s Workstation and Fusion products, woke up to find themselves out of a job. These products, despite being award-winning and profitable, are probably not long for this world.\nI was not directly affected, in this way at least, as I had already left VMware in 2013 to work on Review Board full-time. However, many of my closest friends were, and a product I spent 9 years of my life on may have seen its last feature.\nI could talk all day about how I think we got here, losing this amazing team and these fantastic products. I could point fingers and lash out at those I blame. I could talk about how furious this all makes me.\nInstead, I’m going to talk about the team and what we built — and I don’t just mean our products.\nLet me tell you about our team\n\nI began working in Hosted UI on August 23rd, 2004, as a bright-eyed 20 year old freshly dropped out of college. Back then, it was a small team full of amazingly bright and passionate people, working days and nights to build a product they believed in.\nThe culture at that time within VMware was just so fun and energizing. People wanted to be there, and were proud of their work. Features were brainstormed over games of foosball or DDR, designs discussed over free lunches and beer bashes. In the evenings, we’d order dinner in and watch Simpsons, or whatever was on.\nCompany culture changed over the years, becoming more corporate and stiff, but not Hosted UI. We’d work all day, with the occasional interruption for YouTube videos or some laughs, and at night we went out and had some more. Poker nights, movie nights, video game nights. Dinners out together, sometimes several times a week.\nMany people came and went over those years. The team changed, though, for a software company, a surprising number remained until the very end. Even those that left kept in touch, joining for poker nights or dinners here or there, coming to the dunkings (if you were getting married, you were going in the pond), birthday celebrations, and reunions. We formed alumni lists and kept in touch. We hung out on IRC outside of work.\n\nThrough deadlines and downtimes, stresses and celebrations, our team worked and played hard. We were dedicated, passionate, and if you’ll allow me, we were damn good at what we did.\nI left this team two years ago, but it hasn’t really felt that way. I still saw them almost every week. Our team didn’t have to be in the same building or even the same company to stay a team.\nHosted UI may no longer exist at VMware, but that’s really VMware’s loss. They lost one of the most dedicated teams they could ever hope for, the kind of team you can’t just hire again.\nWe built some amazing products\nWorkstation\nVMware Workstation was the first VMware product (back then, it was simply known as “VMware.”). At a time when dot-coms dominated the Super Bowl and Amazon was all about books, VMware Workstation was letting pioneers in the Linux world virtualize their Windows desktop so they could run Microsoft Office instead of StarOffice.\nThis product evolved over the years with over 15 major releases, and more features than I can count, running on every flavor of Linux and Windows. It did this without falling prey to the bloat of most long-running products, as we focused not only on making it a more powerful product but also a more usable product.\nWorkstation made it easy to run complex development and testing scenarios, creating and working with several virtual environments all at once across any number of host computers. It integrated your virtual desktops with your host desktop. It let you take snapshots at different moments in the lifetime of your VM, and jump between them at will. It helped you catch defects in your software through remote debugging and CPU\/memory record\/replay capabilities, it helped you test complex network setups with virtual LAN devices, and it worked as a powerful front-end for VMware’s Server, ESXi, and vSphere products. And, in the end, it also helped you simply run your Windows programs on Linux, your Linux programs on Windows, or whatever you wanted.\n\n \nInternally at VMware, Workstation was also seen as an indispensable product, helping other teams test features and devices that would eventually become selling points on the more high-end vSphere product releases. With Workstation’s ease-of-install and ease-of-use, people could get set up in minutes and get right to work.\nWe loved our product. This was our baby. We took input from marketing, management, sales, customers, and so on, but in the end, we were given a lot of creative liberty over the features and design. We were also given time to address technical debt, helping to get our codebase in shape for future challenges.\n\nI don’t know how many awards we received, but I think it was a lot. I do know that we had so many users who loved the product we poured our souls into. That meant a lot, and kept us motivated.\nIt was, let’s say, a challenge getting some parts of the company to really care about the product. Workstation made a lot of money, but not the hundreds of millions the company would have preferred. This, I believe, ultimately led to yesterday’s sad outcome… Still, I’m very proud of what we built.\nFusion\n\nWorkstation was a power user product built for Linux and Windows. In 2007, its sister product, Fusion for Mac, was released. This focused more on consumer usage, helping people run Office and other Windows apps on their Mac.\nAt the time, Apple had just moved to Intel processors, and were touting the ability to dual-boot between Windows and MacOS X, using a feature called Bootcamp. Fusion offered a better way by letting you run Windows and MacOS X at the same time. It was popular amongst students who needed to run Windows software for class on their shiny new MacBooks. It was popular amongst developers who needed to run or test Windows or Linux environments while on the go.\n\nFusion was a very different product in some ways than Workstation, but it was also very closely related. While it didn’t focus on many of the power user features that Workstation offered, it did take many of those features and reimagine them for more casual users. It also shared much of the core code that Workstation used, meaning that features could more easily be ported across and bugs fixed just once.\nFusion was a reimagining of what Workstation could have been, built for a different time and a different audience. Like Workstation, it was also built by a group of very loyal, dedicated, brilliant people, the Fusion segment of Hosted UI.\nWhile I never worked directly on Fusion, I did get to see features I built for Workstation make their way there, and watched as our users got to try them for the first time on the Mac. It wasn’t the product I devoted my time to, but it was one I loved, and one I still use today.\nAnd all the others\nOur small team has built quite a lot over the years. Along with Workstation and Fusion, we’ve also built:\n\nPlayer: A slimmed-down product for simply running and interacting with VMs, without all the UI of Workstation\nVMRC: A browser plugin and SDK for embedding virtual machines in your browser or other applications\nServer: A free product built from Workstation that offered remote VM hosting and management)\nWSX: A web-based service for running VMs natively in your browser from anywhere\nAppCatalyst: A developer-focused, API-driven development and testing service that works with Docker\n\nI’m pretty sure there’s more, but those are the highlights.\nThese, along with Workstation and Fusion, were built by a team typically no larger than about 20 people (at any given point in time).\nWe did good.\nTime for the next adventure\nVMware lost a lot of amazing people, and will be feeling that for some time to come, once they realize what they’ve done. It’s a shame. As for our team, well, I think everyone will do just fine. Some of the best companies in the Silicon Valley are full of ex-VMware members, many former Hosted UI, who would probably welcome the chance to work with their teammates again.\nWorkstation, Fusion, and our other products may survive in maintenance mode, or they may disappear. It’s hard to say at this point what will happen. What I can say is that no matter what happens to them, they had an amazing run, and are something every one of us can be proud of the rest of our careers.\nAnd we can be proud of the team, the friendships, and the strong bonds we built, now and through our next adventures.",
                "fallback": "ChipLog Link: A Tribute to VMware Workstation, Fusion, and Hosted&nbsp;UI",
                "from_url": "http:\/\/blog.chipx86.com\/2016\/01\/26\/a-tribute-to-vmware-workstation-fusion-and-hosted-ui\/",
                "id": 1
            }
        ],
        "ts": "1453852826.000010"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "whoa, I was a happy user of Fusion back in the day when I was regularly testing stuff on Windows",
        "ts": "1453852976.000012"
    }
]