[
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "<http:\/\/www.forbes.com\/pictures\/hehi45edie\/3pxwl96llod6yf538t0iz3j9\/#5d00b9553984>",
        "attachments": [
            {
                "service_name": "Forbes",
                "service_url": "http:\/\/www.forbes.com\/pictures\/hehi45edie\/3pxwl96llod6yf538t0iz3j9\/#5d00b9553984",
                "fallback": "Forbes: ",
                "image_url": "http:\/\/i.forbesimg.com\/media\/assets\/forbes_1200x1200.jpg",
                "from_url": "http:\/\/www.forbes.com\/pictures\/hehi45edie\/3pxwl96llod6yf538t0iz3j9\/#5d00b9553984",
                "image_width": 250,
                "image_height": 250,
                "image_bytes": 170142,
                "service_icon": "http:\/\/i.forbesimg.com\/media\/assets\/appicons\/forbes-app-icon_57x57.png",
                "id": 1
            }
        ],
        "ts": "1469566760.000071"
    },
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "30 Great Moments in the History of Robots",
        "ts": "1469566785.000073"
    },
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "<https:\/\/techcrunch.com\/2016\/07\/22\/7-eleven-delivers-by-drone-in-reno-including-yes-slurpees\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "7-Eleven delivers by drone in Reno including, yes, Slurpees",
                "title_link": "https:\/\/techcrunch.com\/2016\/07\/22\/7-eleven-delivers-by-drone-in-reno-including-yes-slurpees\/",
                "author_name": "Lora Kolodny",
                "thumb_url": "https:\/\/i0.wp.com\/tctechcrunch2011.files.wordpress.com\/2016\/07\/7-eleven_flirtey.png?fit=200%2C150&ssl=1",
                "thumb_width": 197,
                "thumb_height": 150,
                "text": "7-Eleven Inc. and a tech startup called Flirtey have beaten Amazon to the punch in making the first drone delivery to a customer&amp;rsquo;s home in the U.S.\nMost already know 7-Eleven, the convenience store retail chain that boasts about 10,800 stores in North America and 59,500 in total around the world.\nFlirtey is a privately held company based in Reno, Nevada, which builds and operates drones to make deliveries that are needed in humanitarian and health work, retail and food industries.\nRather than adapting existing unmanned aerial vehicles, Flirtey builds its own, develops the software to run them, and creates proprietary packaging and containers to keep items secure during delivery, according to CEO Matt Sweeney.\nDuring the 7-Eleven delivery, which took place in Reno, Nevada on July 10th, Flirtey successfully transported: Slurpees, a chicken sandwich, donuts, hot coffee and candy to the home of the family who placed the order.\nWhile 7-Eleven is thought of as a brick and mortar franchise, the company does actually allow online ordering and delivery through services like Postmates, Tapingo and others. Drones would comprise a futuristic expansion of 7-Eleven&amp;rsquo;s delivery business.\nAnd delivery by drone is something 7-Eleven intends to offer widely in the future, according to 7-Eleven EVP and Chief Merchandising Officer Jesus H. Delgado-Jenkins. He declined to put a specific date on the launch of such a service, citing a shifting regulatory environment.\nDrone delivery could prove especially useful to families with children who cannot easily leave the house when they have an urgent need for items like over the counter medicines or milk, Delgado-Jenkins said.\nTo find customers willing to have their order handled by a flying robot, the companies surveyed households within a one-mile radius of the store from which they planned to deliver.\nFlirtey&amp;rsquo;s CEO Matt Sweeney said, &amp;ldquo;When I moved to the U.S. two years ago, only one company had a 333 exemption to do this and that was in the Arctic!&amp;rdquo;\nHe sees the milestone delivery as a sign of &amp;ldquo;rapid progress&amp;rdquo; not just for his company but the drone industry.\nIndeed, broad changes are ahead for the drones industry in the U.S.\nThe U.S. Federal Aviation Administration is expected to put new rules into effect in late August that allow the operation of small, unmanned aircraft in the national airspace.\nAnd the FAA Reauthorization Act of 2016, which passed both houses this month, requires the FAA to develop drone delivery rules, and to conduct research on &amp;ldquo;BVOS&amp;rdquo; or beyond the visual line of sight flying of drones.",
                "fallback": "TechCrunch Link: 7-Eleven delivers by drone in Reno including, yes,&nbsp;Slurpees",
                "from_url": "https:\/\/techcrunch.com\/2016\/07\/22\/7-eleven-delivers-by-drone-in-reno-including-yes-slurpees\/",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/techcrunch-2013\/assets\/images\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1469578454.000074",
        "reactions": [
            {
                "name": "helicopter",
                "users": [
                    "U0H4SJN11",
                    "U0914MEN7"
                ],
                "count": 2
            }
        ]
    }
]