[
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "<https:\/\/mobunited.wordpress.com\/2016\/12\/28\/leia-organa-a-critical-obituary\/>",
        "attachments": [
            {
                "service_name": "you're always being judged",
                "service_url": "http:\/\/mobunited.wordpress.com",
                "title": "Leia Organa: A Critical Obituary",
                "title_link": "https:\/\/mobunited.wordpress.com\/2016\/12\/28\/leia-organa-a-critical-obituary\/",
                "author_name": "malcolmsheppard",
                "author_link": "https:\/\/mobunited.wordpress.com\/author\/malcolmsheppard\/",
                "thumb_url": "https:\/\/i0.wp.com\/mobunited.files.wordpress.com\/2016\/12\/carrie_fisher_2013.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 95,
                "thumb_height": 149,
                "text": "General Leia Organa. Official portrait, Hall of Darasuum Kote, Coruscant.\nLeia Organa, the politician and revolutionary who led the defeat of the Galactic Empire, died after a short illness. She was 60 years old. Hers was a life laced with controversy concerning everything from her tactics to her very ancestry, but her intelligence, commitment to the Republican cause, and place at the heart of the Rebellion, and later the Resistance against Neo-Imperialism, remains the indisputable core of her legacy.\nEarly Life in the Rebellion\nOrgana was born Leia Amidala Skywalker, and the name presaged the uncertainty with which she would be viewed, even before her parentage became a matter of public record. Her mother, Padme Amidala, organized the Delegation of 2000 which resisted the foundation of the Palpatinian New Order, yet her father, Anakin Skywalker, would become better known as the Imperial war criminal, Darth Vader. Leia&rsquo;s twin brother Luke Skywalker would be separated from her and taught the Jedi legacy by members of its hidden diaspora, but Leia was adopted by Delegation of 2000&rsquo;s Senator of Alderaan, Bail Organa, who never told her about her true ancestry.\nYet he freely shared other secrets, including the networks, irregular forces and war materiel he and other anti-Imperial leaders organized to resist the New Order. By her early teens, Leia Organa demonstrated talents ranging from logistics to sapient asset intelligence analysis. Even as she helped him build the nascent Alliance to Restore the Republic, she found herself drawn to a different aspect of the broad front&rsquo;s efforts. Her critical materialist analysis of the Rebellion drew from Gererrist radical pragmatism and (not knowing the author was her biological mother) Amidala&rsquo;s Interspecies Discourse on Naboo, a text banned throughout the Empire due to COMPNOR&rsquo;s human supremacist policies.\nWhile Leia Organa&rsquo;s letters, doctrines and later, command directives formed the ideological-strategic core of the Alliance, she avoided the leadership roles assumed by her father and Mon Mothma. Indeed, she used the courtesy title Princess (afforded by her adopted parents, as elected officials in Alderaan&rsquo;s post-monarchic democracy) sparingly, and purely for political effect. She became a field operative instead, managing diverse intelligence assets under the cover of diplomatic and sapient-relief travel. Before the Battle of Scarif, her missions shared intelligence with numerous&nbsp;Alliance cells. Her uncanny ability to predict the actions of enemies and allies alike made her essential, but the Alliance treated her warily, concerned she might manipulate its forces for her own ends.\nOperation Rogue One\/Stardust successfully destroyed the Tarkin and Krennic cliques, using high risk methods that would become a hallmark of Organa&rsquo;s tradecraft. While imprisoned, she refined her thoughts on asymmetric warfare. Reconstructed image.\nThese worries may have been justified when Organa prevented Yavin IV Flight Command from properly securing arms and spacecraft related to the extraction of Jyn Erso. She correctly predicted Erso and the Andor faction would act on their own, and made a shuttle, droid and weapons conveniently available. Operation Rogue One remains controversial; critics note that Organa sacrificed the entire volunteer cadre, hundreds of troops and much of the Alliance fleet to acquire Designation Stardust intelligence, and that its ultimate success owed itself to her activation of a Jedi asset, Obi-Wan Kenobi, as she was captured by Imperial forces. Indeed, the coincidences behind her subsequent escape and organization of the defense of Yavin IV have been ascribed to the Force, singular tactical genius or pure luck &ndash; all ideologically fraught options.\nThe Organa Doctrine\nBefore the Battle of Endor, where she would train local insurgents and send Luke Skywalker on an additional unsanctioned mission. Although Organa wears Captain&rsquo;s insignia here, she was often given temporary commissions, and refused formal promotions to remain in the field. Nevertheless, she became&nbsp;General of the Resistance during the New Republic period.\nMost historians now see the Stardust\/DS-class superweapons as relatively minor parts of the Empire&rsquo;s war machine (The Imperial-class Star Destroyer remained the primary engine of its force-projection capabilities), but Organa demonstrated the importance of stymieing these and similar efforts through her landmark analysis of the Empire&rsquo;s ideology and political economy. Later published as The Head of Clay: Elitism, Warlordism and Weakness in the Galactic Empire, her papers proved that as competition for political prestige motivated the Empire&rsquo;s factions, they would necessarily centralize power, organizing capital in progressively less efficient &ldquo;superprojects:&rdquo; initiatives a clique&nbsp;could&nbsp;explain to the Emperor and his inner circle in simple, direct terms, and control through a centralized command structure. Superprojects caught the eye of the inner circle, while more complex proposals (such as Holonet infrastructure improvements) and those requiring cross-clique cooperation (such as maintaining Clone Wars era advanced military technologies) fell by the wayside.\nThe superprojects trend began during the Palpatinian Republic (and possibly earlier, if GAOR clone forces could be considered one of them), reaching an early peak in Stardust\/DS-1 itself, a massive undertaking that consumed 1% of GaDP over nearly two decades. Alliance attacks on superprojects inflicted devastating economic damage and often led to the death and capture of key Imperial influencers, who preferred to personally supervise their work in case a competitor attempted to sabotage or seize control of it. Each attack made the Empire more reliant on successor superprojects to recoup losses and keep systems dependent on its common economy, but each failure prompted peripheral worlds to secede and escape the fallout. Although it would later become famous as a verse in Interstellar People&rsquo;s War, Organa first explained her doctrine&rsquo;s essence&nbsp;to Wilhuf Tarkin himself: &ldquo;The more&nbsp;you tighten&nbsp;your grip,&nbsp;the more star systems&nbsp;will slip through your fingers.&rdquo; Yet the Empire remained locked into the cycle, to the point where the Emperor personally commanded a successor to Stardust\/DS-1 in the hope that this economic necessity would at least create a viable terror weapon.\nThe Organa Doctrine is widely believed to have won the Galactic Civil War. According to Admiral Gial Ackbar (Ret.):\n&ldquo;It was impossible to defeat the massed Imperial Starfleet, so the question was always one of choosing the most effective targets. The Sienar and Kuat combines possessed redundant facilities to the extent that we could barely put a dent in ship production. The Organa Doctrine identified the Empire&rsquo;s critical weakness and through rigorous materialist analysis, showed us where to hit the hardest, and hurt them the most. And as one faction fell with its project, another took its place, eager to please the Emperor with some new, grand mission. It was their trap &ndash; inescapable, embedded within their political praxis.&rdquo;\nCovert Operations, Victory and Controversy\nIn deep cover during Operation Krayt Onyx, pursuing the primary objective of eliminating Jabba Desilijic Tiure. &nbsp;The secondary objective of recovering Captain Han Solo was also achieved.\nThe Organa Doctrine identified the path to victory, but the woman herself remained on the front line, rarely pausing for conferences with Alliance intelligence droids. This may have contributed to the ambiguous reception she received in the post-Imperial era, as she didn&rsquo;t emerge with the political influence accorded leaders like Mon Mothma . While they directed large scale operations (often per Organa&rsquo;s theories and recommendations) …",
                "fallback": "you're always being judged Link: Leia Organa: A Critical&nbsp;Obituary",
                "from_url": "https:\/\/mobunited.wordpress.com\/2016\/12\/28\/leia-organa-a-critical-obituary\/",
                "service_icon": "https:\/\/secure.gravatar.com\/blavatar\/0682203bca109003606664634a93792a?s=114",
                "id": 1
            }
        ],
        "ts": "1483110324.000092"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "That's great. ",
        "ts": "1483111006.000094"
    }
]