[
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Cellbat went down when I tried to place the order…. not promising...",
        "ts": "1455568439.000002"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "although the credit card was charged…..",
        "ts": "1455568545.000003"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "standby...",
        "ts": "1455568548.000004"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "worst of both worlds!",
        "ts": "1455568596.000005"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Just pinged them to see if the order went through on their end. Standby as we await the conclusion of this suspenseful journey.",
        "ts": "1455573113.000006"
    },
    {
        "type": "message",
        "user": "U0H4SJN11",
        "text": "*Standing by*",
        "ts": "1455573188.000007"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "<http:\/\/techcrunch.com\/2016\/02\/15\/mattel-unveils-thingmaker-a-300-3d-printer-that-lets-kids-make-their-own-toys\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "Mattel Unveils ThingMaker, A $300 3D Printer That Lets Kids Make Their Own Toys",
                "title_link": "http:\/\/techcrunch.com\/2016\/02\/15\/mattel-unveils-thingmaker-a-300-3d-printer-that-lets-kids-make-their-own-toys\/",
                "author_name": "Sarah Perez",
                "thumb_url": "https:\/\/i1.wp.com\/tctechcrunch2011.files.wordpress.com\/2016\/02\/thingmaker.jpeg?fit=200%2C150",
                "thumb_width": 200,
                "thumb_height": 133,
                "text": "At New York’s Toy Fair trade show over the weekend, Mattel unveiled its new, $300 3D Printer, the “ThingMaker,” which will allow children to print their own toys at home. The device works in conjunction with a 3D printing app developed in collaboration with Autodesk that offers a simple interface for designing items that can then come to life via Mattel’s ThingMaker as well as with other standard 3D printers already on the market.\nThe accompanying app is actually key to making Mattel’s 3D printing experience more accessible to a wider audience.\nWhile there are affordably priced 3D printers available today, the software that works with them can sometimes have a learning curve that can hinder adoption. With the new application, live now on iOS and Android, the goal was to make it easy enough for anyone to design their own toys – even younger children.\n\nAutodesk was tasked with building this app which early testers, including those at Toyland, have already described as “fast,” “easy to navigate” and “ridiculously intuitive.”\nCalled ThingMaker Design, the app includes a variety of built-in character templates and easy-to-use tutorials that help novices get started. But it also allows for designing characters from scratch, once kids get the hang of things. The toys can be customized with different colors and textures, and will bend and twist in the app so you can get a feel for how they’ll work after they’ve been printed. The creations can be saved as images to the mobile device’s Camera Roll, or uploaded to Google Drive or Dropbox.\nWhen a design is complete, the app lets you export the STL print files wirelessly to your at-home printer, whether Mattel’s or otherwise.\nThe idea isn’t just to print an object and be done, however – instead, kids will print parts that can be assembled to form larger creations, like dolls, robots, dinosaurs, scorpions, skeletons, bracelets or necklaces, for example.\n\n    \n\t\t            \n\t\t            image-1-1\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            image-1-2\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            image-1-3\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            image-2-1\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            image-2-2\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            image-2-3-3mb\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            image-3-2\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            2\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            banner-play\n\t\t            \n\t\t            \n\t\t        \n\t    \n\t         View Slideshow\n\t    \n\t    \n\t        Previous\n\t        Next\n\t        Exit\n\t    \n\t\nWhat’s interesting here is the potential for Mattel to tie into other children’s’ brands it already owns or licenses and bring them to life through 3D printing. That’s something the company says is on the roadmap, saying it will launch “additional design content, including branded options” at a later date. No actual brand names were announced, however, but there were hints that brands like Barbie and Hot Wheels were already being planned.\nThe physical parts are printed in batches then assembled through ball-and-socket joints that snap together. This process can take anywhere from 30 minutes for a small item, up to overnight (e.g. 6 6 to 8 hours) for a larger toy.\nMattel says its ThingMaker 3D will use a hard PLA filament, but also hasn’t yet announced the colors that will be available. According to reports from the Toy Fair, though, there were some two dozen colors on display. A spokesperson said the company may release other materials in the future.\n\nWhen printing starts, the printer’s door will automatically lock for safety’s sake, but kids can watch the process through the clear window on the front. In addition, the printing head will also retract when not in use, which will help to keep kids safe from burning their fingers by accidentally (or intentionally) touching the heated part.\nWhile printing out toys is something that seems like it would appeal to littler kids – Mattel covers itself from a liability standpoint by saying the device is “designed for users ages 13 and up,” USA Today reports. But the simplicity of the app and printer’s design combined with its purpose involving toy printing will likely see parents of younger children bringing the device into their homes.\n\n    \n\t\t            \n\t\t            banner-print\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            3\n\t\t            \n\t\t            \n\t\t        \n\t    \n\t         View Slideshow\n\t    \n\t    \n\t        Previous\n\t        Next\n\t        Exit\n\t    \n\t\n \nIf the name “ThingMaker” rings a bell, it’s because it references Mattel’s original at-home maker device from the 1960’s. Back then, the company worked to inspire kids’ creativity by letting them build toys like flowers or “Creepy Crawlers” by pouring liquid plastic-like material called Plastigoop into molds that were heated up then cooled.\nNow the company says it has reimagined the ThingMaker experience for the 21st century.\n“In today’s digital age, it’s more important than ever for families to transcend the digital world and make their ideas real,” said Aslan Appleman, senior director, at Mattel in a statement. “ThingMaker pushes the boundaries of imaginative play, giving families countless ways to customize their toys and let their creativity run wild.”\nThe printer won’t actually become available for purchase until later this fall, but pre-orders on Amazon are kicking off today.\nAs a toy brand, Mattel has been fairly forward-thinking when it comes to combining play and digital devices. In addition to the ThingMaker, the company also unveiled a new View-Master device at the Toy Fair powered by Google Cardboard.",
                "fallback": "TechCrunch Link: Mattel Unveils ThingMaker, A $300 3D Printer That Lets Kids Make Their Own&nbsp;Toys",
                "from_url": "http:\/\/techcrunch.com\/2016\/02\/15\/mattel-unveils-thingmaker-a-300-3d-printer-that-lets-kids-make-their-own-toys\/",
                "id": 1
            }
        ],
        "ts": "1455575076.000008"
    },
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "that looks awesome",
        "ts": "1455575186.000010"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Yeah!",
        "ts": "1455575195.000011"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "WOW!",
        "ts": "1455575212.000012"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "That's barely more than a dreamhouse",
        "ts": "1455575253.000013"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "ThingMaker should be a ThingWeek sponsor",
        "ts": "1455575282.000014"
    },
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "or 1 lego set",
        "ts": "1455575285.000015"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "WheatThings",
        "ts": "1455575296.000016"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "not sure why I typed that but it popped into my head",
        "ts": "1455575313.000017"
    },
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "<https:\/\/i.ytimg.com\/vi\/DS07TPPu0SE\/maxresdefault.jpg>",
        "attachments": [
            {
                "fallback": "1200x900px image",
                "image_url": "https:\/\/i.ytimg.com\/vi\/DS07TPPu0SE\/maxresdefault.jpg",
                "image_width": 1200,
                "image_height": 900,
                "image_bytes": 240281,
                "from_url": "https:\/\/i.ytimg.com\/vi\/DS07TPPu0SE\/maxresdefault.jpg",
                "id": 1
            }
        ],
        "ts": "1455575406.000018"
    },
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "^ the packaging was no that old, but I definitely had this thingmaker. it’s cute they’re still using the name",
        "ts": "1455575462.000020",
        "reactions": [
            {
                "name": "clap",
                "users": [
                    "U0914MEN7"
                ],
                "count": 1
            },
            {
                "name": "bulb",
                "users": [
                    "U02HAJ6JF"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "CcreeEEEeeeepy crawlerrssss",
        "ts": "1455575485.000021"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "```THIS TOY WAS DESIGNED FOR USE ONLY WITH GENUINE *MATTEL PLASTIGOOP*```",
        "ts": "1455575517.000022"
    },
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "used to have one of the creepy crawlers things growing up. used to fill these little metal trays with the goop and put into the ez bake oven thing and end up with the little rubbery insects. pretty awesome they are doing a 3d printer now. i heard hasbro is also looking to get in on this game",
        "ts": "1455578614.000023"
    }
]