[
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "<https:\/\/www.kitronik.co.uk\/5602-motor-driver-board-with-edge-connector.html>",
        "attachments": [
            {
                "service_name": "Kitronik",
                "title": "Motor Driver Board for the BBC micro:bit",
                "title_link": "https:\/\/www.kitronik.co.uk\/5602-motor-driver-board-with-edge-connector.html",
                "text": "This motor driver board for the BBC micro:bit allows two motors to be driven with forward, reverse &amp; stop control, making it ideal for designs such as buggies.",
                "fallback": "Kitronik: Motor Driver Board for the BBC micro:bit",
                "thumb_url": "https:\/\/www.kitronik.co.uk\/media\/catalog\/product\/cache\/1\/image\/9df78eab33525d08d6e5fb8d27136e95\/5\/6\/5602_large_motor_driver_board_with_edge_connector.jpg",
                "from_url": "https:\/\/www.kitronik.co.uk\/5602-motor-driver-board-with-edge-connector.html",
                "thumb_width": 800,
                "thumb_height": 800,
                "id": 1
            }
        ],
        "ts": "1452708759.000005"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "<@U02F8LF2X> ^^ Let’s make something with this.",
        "ts": "1452708794.000007"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<http:\/\/techcrunch.com\/2016\/01\/13\/google-cardboards-sdk-gets-spatial-audio-support\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "Google Cardboard’s SDK Gets Spatial Audio Support",
                "title_link": "http:\/\/techcrunch.com\/2016\/01\/13\/google-cardboards-sdk-gets-spatial-audio-support\/",
                "author_name": "Drew Olanoff",
                "thumb_url": "https:\/\/i1.wp.com\/tctechcrunch2011.files.wordpress.com\/2016\/01\/pasted-image-0.png?fit=200%2C150",
                "thumb_width": 200,
                "thumb_height": 105,
                "text": "When you think about virtual reality, you probably think about visuals and imagery and immersive far-off places. However, the key to a really fantastic immersive experience is not only what you see, but what you hear. And not just what you hear, but how you hear it.\nGoogle announced today that its Cardboard SDKs for Unity and Android now support spatial audio. I spoke to Nathan Martz, the PM on Cardboard, yesterday about it and he told me about the goal of the SDK:\n\nWe want to make building VR experiences as easy as using Cardboard.\nThat’s a pretty lofty goal, but its what the team is working towards. The spacial audio functionality was worked on mainly by an acquired company, ThriveAudio. What it will do is allow creators to control the direction of sounds in an immersive experience. For example, you will hear someone walking behind you. You’ll hear a plane flying overhead in the far-off distance:\nThe SDK combines the physiology of a listener’s head with the positions of virtual sound sources to determine what users hear. For example: sounds that come from the right will reach a user’s left ear with a slight delay, and with fewer high frequency elements (which are normally dampened by the skull).\nThe SDK lets you specify the size and material of your virtual environment, both of which contribute to the quality of a given sound. So you can make a conversation in a tight spaceship sound very different than one in a large, underground (and still virtual) cave.\nMartz tells me that it’s super important to make the quality of audio fantastic for Cardboard experiences, while also optimizing it to run well on a smartphone.\nAfter learning yesterday that the Cardboard unit has a new focused lead in Clay Bavor, the two year old “20% project” is something the company is taking seriously.",
                "fallback": "TechCrunch Link: Google Cardboard&#8217;s SDK Gets Spatial Audio&nbsp;Support",
                "from_url": "http:\/\/techcrunch.com\/2016\/01\/13\/google-cardboards-sdk-gets-spatial-audio-support\/",
                "id": 1
            }
        ],
        "ts": "1452709730.000008"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "I have some h-bridges you can use for motor drivers",
        "ts": "1452710926.000010"
    }
]