[
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<http:\/\/www.thingiverse.com\/thing:911891>",
        "attachments": [
            {
                "title": "Saturn V Rocket and Gantry  by farscape1",
                "title_link": "http:\/\/www.thingiverse.com\/thing:911891",
                "text": "The Saturn V (spoken as \"Saturn five\") was an American human-rated expendable rocket used by NASA between 1966 and 1973. The three-stage liquid-fueled launch vehicle was developed to support the Apollo program for human exploration of the Moon, and was later used to launch Skylab, the first American space station. The Saturn V was launched 13 times from the Kennedy Space Center in Florida with no loss of crew or payload. The Saturn V remains the tallest, heaviest, and most powerful rocket ever brought to operational status and still holds records for the heaviest payload launched and largest payload capacity to low Earth orbit (LEO) of 118,000 kilograms (260,000 lb).[5][6] The largest production model of the Saturn family of rockets, the Saturn V was designed under the direction of Wernher von Braun and Arthur Rudolph at the Marshall Space Flight Center in Huntsville, Alabama, with Boeing, North American Aviation, Douglas Aircraft Company, and IBM as the lead contractors. Von Braun's design was based in part on his work on the Aggregate series of rockets, especially the A-10, A-11, and A-12, in Germany during World War II. To date, the Saturn V remains the only launch vehicle able to transport human beings beyond low Earth orbit. A total of 24 astronauts were launched to the Moon, three of them twice, in the four years spanning December 1968 through December 1972. THANKS to Wikipedia for description. Here is my 1\/60th scale model of this iconic rocket and the mobile launch platform that I had done for a client. I had started the design\/drawing in March 2014...and will be finished July 2015 The Saturn V at this scale is just over 6 ft tall and the gantry is over 7.5 ft tall !! . This model has moving gantry arms and crane....and each stage can be separated !!! it also has a Lunar lander with folding legs. The design and drawing of this model took over 1200 hours and an estimated 2000 hours to print. This model uses the following colors True Red True Yellow True White True Black Warm Grey Cool Grey Ocean Blue Army Green It was built 99% using 2 Rep2's...and a Z18 The other 1% was Solidscape® MAX2 and a Objet500 Connex",
                "fallback": "Saturn V Rocket and Gantry  by farscape1",
                "image_url": "https:\/\/thingiverse-production-new.s3.amazonaws.com\/renders\/1f\/88\/00\/26\/49\/_2.IMG_20151212_161753_preview_featured.jpg",
                "from_url": "http:\/\/www.thingiverse.com\/thing:911891",
                "image_width": 333,
                "image_height": 250,
                "image_bytes": 92125,
                "id": 1
            }
        ],
        "ts": "1453238519.000002",
        "reactions": [
            {
                "name": "heart_eyes",
                "users": [
                    "U02E3CRMA"
                ],
                "count": 1
            }
        ]
    }
]