[
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Microsoft open sources a simulator for training drones, self-driving cars and more - TechCrunch\n<https:\/\/apple.news\/AoXiUtHYGTUGdCY0nhIAXvg>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "Microsoft open sources a simulator for training drones, self-driving cars and more",
                "title_link": "https:\/\/apple.news\/AoXiUtHYGTUGdCY0nhIAXvg",
                "author_name": "Darrell Etherington",
                "thumb_url": "https:\/\/i2.wp.com\/tctechcrunch2011.files.wordpress.com\/2017\/02\/microsoft-airp-01-lr.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 135,
                "text": "Microsoft has made available a beta version of an advanced virtual world for training autonomous drones, as well as other gadgets that move on their own. The software, which is available on GitHub, recreates conditions like shadows, reflections and other potentially confusing real-world conditions in a highly detailed, highly realistic virtual environment &ndash; without the risk of the real thing.\nMicrosoft says that it hopes to help the &ldquo;democratization of robotics&rdquo; with the move, which will assist individuals, researchers and companies with testing of systems that would otherwise be impossible, or too resource-intensive for them to do on their own.\nWhy test drones and other self-navigating devices in a virtual world instead&nbsp;of the real one? Mainly because simulated testing is vastly more affordable when part of your process is encouraging learning self-navigating software to distinguish between things like shadows and solid, dark-colored walls. If you&nbsp;ask a drone with an advanced onboard brain to fly into&nbsp;something that might be solid or might be immaterial, you could end up with a very smashed, very expensive failure. If you do that in a virtual setting, all you&rsquo;ve lost is a few&nbsp;moments and maybe some electricity for powering your PC.\nOf course, simulation also allows you to increase the volume and speed of your scenario testing and learning, and train up AI systems more efficiently. But for this to be an effective method of educating autonomous flight software, it also has to be highly accurate; Microsoft says its simulator takes advantage of recent advances in graphics processing technology to provide accurate virtual versions of real-world details like shadow, glare from the sun, haze and pooled surface water on roads.\nThe software can also be sued to test autonomous driving systems, Microsoft&rsquo;s Ashish Kapoor notes in the company&rsquo;s blog post, and it should be applicable to other kinds of robots that need to learn how to make their way through their environment.",
                "fallback": "TechCrunch Link: Microsoft open sources a simulator for training drones, self-driving cars and&nbsp;more",
                "from_url": "https:\/\/apple.news\/AoXiUtHYGTUGdCY0nhIAXvg",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/techcrunch-2013\/assets\/images\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1487194882.376415"
    }
]