[
    {
        "type": "message",
        "user": "U3M4RRNQ5",
        "text": "<https:\/\/techcrunch.com\/2017\/03\/03\/the-fossil-q-hybrid-smartwatch-does-wearables-right\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "The Fossil Q Hybrid smartwatch does wearables right",
                "title_link": "https:\/\/techcrunch.com\/2017\/03\/03\/the-fossil-q-hybrid-smartwatch-does-wearables-right\/",
                "author_name": "John Biggs",
                "thumb_url": "https:\/\/i2.wp.com\/tctechcrunch2011.files.wordpress.com\/2017\/03\/img_2828.png?fit=200%2C150&ssl=1",
                "thumb_width": 162,
                "thumb_height": 150,
                "text": "Do you really need a screen? That&rsquo;s the question Fossil is asking with their clever and handsome Fossil Q Hybrid smartwatch, an analog watch that hides all of its smarts behind an understated face.\nThis type of watch has become more common with watchmakers like Skagen and Michael Kors jumping on the bandwagon. Many of the manufactures use movements from MMT and others and most of them do approximately the same thing.\nThis watch tracks your activity and sleep, can wake you with a vibrating alarm, and supports second time zones. It sets itself automatically based on your phone and lasts for months on a battery. In short it does exactly what it says on the tin &ndash; an activity tracker with some smart features &ndash; and looks pretty good.\nFossil is a so-called fashion watch company but it, like all of the brands under the Fossil Group umbrella, is trying to break into the smartwatch space any way it can. This means putting out both hybrid activity trackers and Android Wear devices and while it is unclear just how well these pieces are selling it&rsquo;s good to see that they&rsquo;re trying.\nWhat I think about this watch? I was pleasantly surprised. It has a massive 44mm face and a nice, easily-removable strap. You control the watch via your phone, setting it automatically, and the crown and pushers are all just buttons &ndash; you can&rsquo;t set the watch by hand. The watch app itself is quite basic, allowing you to track steps and your sleep and change settings. It works with iOS and Android and is acceptably accurate at step tracking.\nWhy would you buy this? Maybe you need a nice watch to wear and you don&rsquo;t want to support Apple. Maybe you don&rsquo;t want to recharge your watch often. Maybe you are unsure about smartwatches and want to dip a toe in for $175. Whatever the reason the Q is nicely styled and solid and it looks like a big, nice mechanical watch instead of a robotic chiclet.\n\n    \n\t\t            \n\t\t            img_0853\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            img_0854\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            img_0855\n\t\t            \n\t\t            \n\t\t        \n\t        &nbsp;View Slideshow\n\t    \n\t    \n\t        Previous\n\t        Next\n\t        Exit\n\t    \n\t\nThe bad news? There is no lume on the face so you can&rsquo;t read this at night. The notifications are pretty cool &ndash; it&rsquo;s supposed to tell you when you get social media messages and the like &ndash; but a vague buzzing noise doesn&rsquo;t give much context in this case. I&rsquo;d say this is primarily an activity tracker with some added features and not a fully-featured smartwatch.&nbsp;An initial calibration process suggests that this watch could lose or gain time due to vagaries in the weather, etc. which means Fossil tries to ensure that the hands are always correct.\nAgain, at $175 you&rsquo;re not paying much for a nice watch. I suspect pieces like this one will soon supplant traditional quartz watches in the marketplace &ndash; who doesn&rsquo;t want a little extra in their timepiece? &ndash; and this is a great start. While I wouldn&rsquo;t wear this every day it&rsquo;s definitely a daily wear piece and worth exploring as a solid Apple Watch or Android Wear alternative.\n\n    \n\t\t            \n\t\t            img_8134\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            img_8992\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            img_2828\n\t\t            \n\t\t            \n\t\t        \n\t\t            \n\t\t            img_4626\n\t\t            \n\t\t            \n\t\t        \n\t        &nbsp;View Slideshow\n\t    \n\t    \n\t        Previous\n\t        Next\n\t        Exit",
                "fallback": "TechCrunch Link: The Fossil Q Hybrid smartwatch does wearables&nbsp;right",
                "from_url": "https:\/\/techcrunch.com\/2017\/03\/03\/the-fossil-q-hybrid-smartwatch-does-wearables-right\/",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/techcrunch-2013\/assets\/images\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1488576133.759650"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "This is awesome! One of the things that really makes me excited about the future of health is that we still don't really have much insight into early detection. For example, bad gums are an early detection for health disease, but probably only because we have tons of great data on gum health from dentists. As we begin to track everything about a persons health when they come in for a certain symptom, DL is going to be able to find much better signals <https:\/\/research.googleblog.com\/2017\/03\/assisting-pathologists-in-detecting.html?m=1>",
        "attachments": [
            {
                "service_name": "Research Blog",
                "title": "Assisting Pathologists in Detecting Cancer with Deep Learning",
                "title_link": "https:\/\/research.googleblog.com\/2017\/03\/assisting-pathologists-in-detecting.html?m=1",
                "text": "Posted by Martin Stumpe, Technical Lead, and Lily Peng, Product Manager A pathologist’s report after reviewing a patient’s biological tiss...",
                "fallback": "Research Blog: Assisting Pathologists in Detecting Cancer with Deep Learning",
                "thumb_url": "http:\/\/1.bp.blogspot.com\/-5bPNsF5plzw\/VnJWs-7RbrI\/AAAAAAAARmA\/DaZmn8YUjAk\/s1600-r\/logo_research_at_google_color_1x_web_512dp.png",
                "from_url": "https:\/\/research.googleblog.com\/2017\/03\/assisting-pathologists-in-detecting.html?m=1",
                "thumb_width": 483,
                "thumb_height": 480,
                "service_icon": "https:\/\/research.googleblog.com\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1488576674.799067",
        "reactions": [
            {
                "name": "hospital",
                "users": [
                    "U02F8TTPU",
                    "U0K8ZSHN0"
                ],
                "count": 2
            }
        ]
    },
    {
        "type": "message",
        "user": "U02HAJ6JF",
        "text": "<http:\/\/gizmodo.com\/ubers-secret-app-for-tracking-cops-sounds-creepy-as-hel-1792949962>",
        "attachments": [
            {
                "service_name": "Gizmodo",
                "title": "Uber's Secret App for Tracking Cops Sounds Creepy as Hell",
                "title_link": "http:\/\/gizmodo.com\/ubers-secret-app-for-tracking-cops-sounds-creepy-as-hel-1792949962",
                "text": "Uber’s very bad year just got worse. The New York Times is reporting that the company used secret internal software as well as good old-fashioned cyberstalking to identify law enforcement officials who were investigating Uber’s business practices. The situation is even crazier than it sounds.",
                "fallback": "Gizmodo: Uber's Secret App for Tracking Cops Sounds Creepy as Hell",
                "image_url": "https:\/\/i.kinja-img.com\/gawker-media\/image\/upload\/s--h8Uu7AFr--\/c_fill,fl_progressive,g_center,h_900,q_80,w_1600\/sy1mdnludyfdz11ea2gz.jpg",
                "from_url": "http:\/\/gizmodo.com\/ubers-secret-app-for-tracking-cops-sounds-creepy-as-hel-1792949962",
                "image_width": 444,
                "image_height": 250,
                "image_bytes": 116459,
                "service_icon": "https:\/\/i.kinja-img.com\/gawker-media\/image\/upload\/s---erriNCS--\/c_fill,fl_progressive,g_center,h_200,q_80,w_200\/fdj3buryz5nuzyf2k620.png",
                "id": 1
            }
        ],
        "ts": "1488580908.076659"
    }
]