[
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<@U026PLK4S> <@U0260V1BX> <@U026E0ZNR> <@U0265G76F> Hey Guys - I just shared with you all a doc called \"Questions for Nicole\" and what I'd love is for everyone to take 5-10 minutes today or tomorrow morning and ad any questions you'd like to ask Nicole, the wellness expert",
        "ts": "1450741738.000002"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Katrina needs these to queue up the conversation with her, so the earlier we can get them together the better. They'll also help guide our conversation when we meet. Thanks!",
        "ts": "1450741763.000003"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Also, we've got a plan together for the Jan presentations! For Jan 14 we'll show the Discovery Academy app that Adam and Shawn have been working on. We'll also show scenarios and as much of a feature list as we can, rooted in reasoning and stories from the scenarios\/research.",
        "ts": "1450741880.000004"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "For Jan 26, we'll follow up with high level structure of the app, as well as any visuals we can product to show the dashboard. I've got a google doc with the plan as discussed that I've shared out. Let's all touch base on this and let me know if any questions come up in the meantime.",
        "ts": "1450741924.000005"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "<@U026103R3> Interested to know, when “motion” is referenced in the Jan 26 presentation is that motion applied to our visual comps or motion inspiration that we’ve already collected?",
        "ts": "1450742870.000006"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Great question Trent, and that's something we should really specify with Katrina before I guess and am incorrect, because when I think back to our conversation I don't think I asked that specifically.",
        "ts": "1450743123.000007"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "She'll be in the office tomorrow, I'll make it a point to ask that",
        "ts": "1450743136.000008"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Oh so this is from Katrina directly",
        "ts": "1450743143.000009"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Nah we chatted with her about the plan and these are my notes",
        "ts": "1450743175.000010"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Ah, got it",
        "ts": "1450743197.000011"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "If we need to apply motion to our visual comps I can def do that. Haven’t been thinking too much about it so far though.",
        "ts": "1450743333.000012"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Yea that sounds cool to me, but I think we should bottom out on what Katrina thinks would be the most effective as part of the presentation",
        "ts": "1450743417.000013"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "yeppers",
        "ts": "1450743579.000014"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "I'll make sure to touch base with her tomorrow, but I'll probs come grab you for that convo too :simple_smile:",
        "ts": "1450743616.000015"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "great, do you know around what time she’s supposed to be in the office?",
        "ts": "1450743891.000016"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "i don't specifically, but i think she's planning on being here for a while. i'd guess she'll be in at a similar time to today, which was 1:30",
        "ts": "1450744140.000017"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "ok thanks!",
        "ts": "1450744326.000018"
    }
]