[
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "<http:\/\/fitandfeminist.com\/2016\/03\/25\/adidas-running-shoes-for-women-make-me-sad\/>",
        "attachments": [
            {
                "service_name": "Fit and Feminist",
                "service_url": "http:\/\/fitandfeminist.com",
                "title": "Adidas’ running shoes for women make me sad",
                "title_link": "http:\/\/fitandfeminist.com\/2016\/03\/25\/adidas-running-shoes-for-women-make-me-sad\/",
                "author_name": "Caitlin",
                "author_link": "https:\/\/fitandfeminist.com\/author\/fitandfeminist\/",
                "text": "Earlier this week I heard about a new pair of running shoes that Adidas created specifically for women, which is something you’d think I’d be delighted by, right?  And to a certain extent I am.  The process behind the creation of the PureBoost X represents a radical departure from “shrink it and pink it.” For a long time, sports gear has been designed with the idea of men as the default, so it’s still pretty remarkable when a sports company designs with women specifically in mind.  So props to Adidas for that.\nBut as much as I appreciate what Adidas has done with the PureBoost X, I had to say I was dismayed when I read Zoe McKnight’s review of the shoes, which she wrote about for the Toronto Star earlier this week. She took the shoes out for some training runs – she’s preparing for the 30K Around the Bay Road Race in Hamilton – and she found that the shoes didn’t really work for her, especially when she went for a 24K training run. Which, okay, not every shoe is going to work for everyone on every run, even a shoe that is designed specifically with women in mind.\nThat’s not what got me, though. What got me were the company’s responses to her inquiries after she’d taken them for the test drive.\nWhen I told Adidas about my experience, the company said through a spokesperson that my discomfort wasn’t surprising, since the shoe is really designed for distances between five and 10 kilometres, for women who include running as part of a larger workout routine.\nThe shoe’s marketing implies that it’s meant for a woman who runs so much that she eventually becomes fed up with those pesky shoes meant for men and demands a shoe made for her feet. And yet the company says it’s not meant to be worn for runs longer than six miles.  That’s great if you exclusively run 5Ks and 10Ks, but that’s not really in line with the big trend in women’s running, which is total domination of the half-marathon. Which, if you need a reminder, is 21.1K\/13.1 miles and thus is more than twice the longest distance recommended for the shoe.\nSo if you’re one of the hundreds of thousands of women taking part in a half-marathon this year?  This shoe ain’t for you.\nThe Adidas spokesperson acknowledges that women have been the driver behind the latest boom in running, then goes on to say:\n“It’s moved this big, fundamental shift away from the serious, competitive aspect to much more of a social aspect dominated by female runners,” Wardlaw says.\nThis is where I facepalmed.\nListen, I don’t deny that for a lot of women, running and racing is very much a social thing, something they do with their friends or their family members. I know a lot of women whose only race all year long is the Iron Girl half-marathon in Clearwater, and they run it with their friends or their daughters or their sisters. This is obviously not how I roll, but that’s fine. I know this is a shocking thing to admit out loud, but not everyone has to have the exact same priorities and perspectives in life that I do.\nALL THAT SAID, I cannot be the only female runner who is tired of hearing about how we aren’t really serious runners.  I’m tired of hearing about how we’ve made the sport less competitive. The influx of women into the sport may have made it more inclusive – and thank goodness for that – but less competitive?  Less serious?  Please.\nFurther, I would make the argument that a lot of those social, supposedly less serious female runners?  They actually are quite serious about their running. You don’t run several times a week and follow a training plan if you aren’t serious. It’s just that their seriousness takes a different shape than what we’d historically thought of as serious running.  I mean, you don’t have to run 70+ mile weeks to be a serious runner, and you don’t have to do it in split shorts and a cotton race shirt from 1986.  That’s because seriousness isn’t about external signifiers; it’s about what’s inside your heart and your mind.\nI really wanted to wholeheartedly love what Adidas is doing, because I appreciate when sports apparel companies recognize women’s bodies tend to have different needs than those of men.  That’s why I am like *flings money* at Coeur Sports and would be even if I wasn’t an ambassador, because they get that you can’t put women in tri shorts made for dudes and not expect things to get gnarly and they design their products accordingly.  I want to reward companies that do this with my money! LET ME GIVE YOU MY MONEY.\nBut I can’t do that when the company only meets me halfway.  Don’t tell me about how you’ve made this amazing running shoe that is meant for women, but then turn around and say this amazing running shoe isn’t actually for serious runners because everyone knows women aren’t serious runners.  You can’t woo athletes like me out of one side of your mouth and then insult us out of the other side. It doesn’t work like that.\nAdidas says they have big plans for the future of women’s running. I sure hope those future plans include treating female runners like actual runners.",
                "fallback": "Fit and Feminist Link: Adidas&#8217; running shoes for women make me&nbsp;sad",
                "from_url": "http:\/\/fitandfeminist.com\/2016\/03\/25\/adidas-running-shoes-for-women-make-me-sad\/",
                "id": 1
            }
        ],
        "ts": "1458924979.000037"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "oof",
        "ts": "1458925817.000039"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "this is good to keep in mind as we roll into voice &amp; tone with the copywriter the week after next",
        "ts": "1458925957.000040"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "since we are making a product for women that aren’t serious athletes",
        "ts": "1458925994.000041"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel> standup in the producer room!",
        "ts": "1458926161.000042"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<@U0260V1BX>: <@U0U9WJB7F> if you guys don’t already have the materials that we’ll walk through on the prochange call, you can find them here: <https:\/\/www.dropbox.com\/sh\/c08jbaygdr8jpij\/AABMVJ8V2nehN0NfgYKU-6QUa?dl=0>",
        "attachments": [
            {
                "service_name": "Dropbox",
                "title": "UX_Discoveries",
                "title_link": "https:\/\/www.dropbox.com\/sh\/c08jbaygdr8jpij\/AABMVJ8V2nehN0NfgYKU-6QUa?dl=0",
                "text": "Shared with Dropbox",
                "fallback": "Dropbox: UX_Discoveries",
                "thumb_url": "https:\/\/cf.dropboxstatic.com\/static\/images\/icons128\/folder_dropbox.png",
                "from_url": "https:\/\/www.dropbox.com\/sh\/c08jbaygdr8jpij\/AABMVJ8V2nehN0NfgYKU-6QUa?dl=0",
                "thumb_width": 128,
                "thumb_height": 128,
                "id": 1
            }
        ],
        "ts": "1458926664.000043"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "thanks!",
        "ts": "1458926913.000045"
    }
]