[
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "<@U1A1A9L7N> \/ <@U0HP6TFNX> \/ <@U0XJFPSRL> I chatted with <@U167FL70V> about individual session download and it adds a pretty significant amount of complexity to the backend, both in needing to create a new package structure and knowing what sessions in a package a user already has downloaded. She said that it’s a very reasonable thing to add post-launch, but would prefer to keep the existing package structure for January if at all possible. The edge case I’m most concerned about is someone not on wifi who wants to join a discovery. They will have the option to download the full package over cellular, or we will download automatically when they are back on wifi. As mentioned, none of this is perfect but I think I’d rather see how big our files are (they may be smaller than we think) and how users are interacting with the media and add in the individual session download post-launch if we feel it’s necessary. Let me know what you think.",
        "ts": "1467913288.000052"
    },
    {
        "type": "message",
        "user": "U1A1A9L7N",
        "text": "<@U0260V1BX>: All makes sense to me",
        "ts": "1467913458.000053"
    },
    {
        "type": "message",
        "user": "U1A1A9L7N",
        "text": "Thanks for checking",
        "ts": "1467913472.000054"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel> hey all - planning to nix this week’s weekly digest since it’s a short week and be able to provide more of an update next week. feel free to ping me directly if you have any questions or concerns about this.",
        "ts": "1467923166.000055"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "sounds good from my perspective. Thanks <@U026103R3>",
        "ts": "1467923213.000056"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "Thx for the heads up Abby. Cool with me",
        "ts": "1467923741.000057"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel> can someone let me know if they see katrina and amy walk in the door?",
        "ts": "1467928672.000058"
    },
    {
        "type": "message",
        "user": "U0XJFPSRL",
        "text": "<@U026103R3> I’m on it",
        "ts": "1467928802.000059"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "thank youuuu",
        "ts": "1467928878.000060"
    },
    {
        "type": "message",
        "user": "U0XJFPSRL",
        "text": "<@U026103R3> here",
        "ts": "1467928931.000061"
    }
]