[
    {
        "type": "message",
        "user": "USLACKBOT",
        "text": "Reminder: Hey everyone, if you haven’t yet filled out and submitted your Harvest time sheet from last week, please make sure to do it today by end of day. Thanks!",
        "ts": "1471885200.000140"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "<!channel> Just sent an invite (if you didn’t receive it please PM me) for Wednesday at 5:15…it’s time for team drinks! We’ll be at Century Bar…please try and make it! :slightly_smiling_face:",
        "ts": "1471899422.000141"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Thanks Jenna! \n\nUnrelated question: how do I get access to the latest Compass build? I haven’t received any Crashlytics updates for a while and am wondering if there’s a different outlet to be in on this.",
        "ts": "1471899694.000142"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Hey Trent, we’d like to make sure everyone is getting the builds asap. I’m out today but will jump on it tomorrow, thanks for the reminder. :slightly_smiling_face: Note, you won’t necessarily get a build right away, but that will make sure you’re on the list for all forthcoming. If you need a build to check out something specific or the home screen visualization proto for example, we can request in the compass-dev channel.",
        "ts": "1471899860.000143"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "the last\/only Compass build I received was on 7\/27. has there been more since then? i also need to figure out how we can play with that last OpenGL prototype we received, forgot about that until just now.",
        "ts": "1471900271.000144"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Nah there are newer builds, that was likely alpha so we'll make sure regular builds are going out to everyone. Let's discuss the second point tomorrow, happy to help on that front. ",
        "ts": "1471901503.000145"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "great, thanks Abby",
        "ts": "1471901788.000146"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "I can show you the latest <@U026E0ZNR>",
        "ts": "1471902452.000147"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "+ it’s on a few of the company phones.",
        "ts": "1471902461.000148"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "oh! company phone would be rad",
        "ts": "1471902481.000149"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "np",
        "ts": "1471902618.000150"
    }
]