[
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Hey team. Jumping in here with an article I read yesterday that I think could be a great social component to Compass when it gets to that time. It’s about stickers. I see a stickers as a great way of sending props to fellow tribe members. A 3-day win streak earns you a sticker (that obeys laws of scarcity) that you can save for the perfect moment and then share it with a friend who has done something great (e.g. sticks to their plan to run even though it was rainy outside or they had a group outing the night before). The sticker could be ephemeral and after being sent one time could only be saved or perhaps it could be re-used in tribes outside of the one it originated from (e.g. sticker originated in work tribe, shared to another member of work tribe, that member can then send to someone in there family tribe). <http:\/\/a16z.com\/2016\/06\/17\/stickers\/>   Check it out if you have a moment. Please note: Tribes refers to an organizational structure for social we had discussed during the design sprints",
        "attachments": [
            {
                "service_name": "Andreessen Horowitz",
                "service_url": "http:\/\/a16z.com",
                "title": "The Elements of Stickers",
                "title_link": "http:\/\/a16z.com\/2016\/06\/17\/stickers\/",
                "author_name": "sonala16z",
                "author_link": "https:\/\/a16z.com\/author\/sonala16z\/",
                "thumb_url": "https:\/\/i1.wp.com\/a16z.files.wordpress.com\/2016\/06\/13075779755_0dbec61a5f_k.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 199,
                "thumb_height": 149,
                "text": "Besides invisible messages, bigger and predictive emoji, full-screen effects, and movie\/TV GIFs, Apple recently announced that stickers, too, are finally coming to its most popular app, iMessage. It&amp;rsquo;s no surprise that messaging is the company&amp;rsquo;s most popular app &amp;mdash; if smartphones are like extensions of our fingers, then messaging is like touching people and things.\nWhat is surprising &amp;mdash; especially when compared to the more mature messaging ecosystem in Asia &amp;mdash; is that many people still tend to treat stickers (i.e., the ability to easily incorporate pre-set images into texts) as just-for-fun frivolity, when they&amp;rsquo;re an important visual digital language fully capable of communicating a nuanced range of thoughts. For example, a single sticker could convey very different messages: &amp;ldquo;I&amp;rsquo;m so hungry I could collapse&amp;rdquo; or &amp;ldquo;I miss you&amp;rdquo; or &amp;ldquo;I&amp;rsquo;m sound asleep snoring&amp;rdquo;. Complex feelings, actions, punch lines, and memes are all possible with stickers.\nThey are an acceptable response to &amp;ldquo;end&amp;rdquo; a real-time back and forth conversation (great for punchlines). They are a low-risk way of saying hi and initiating a chat with an acquaintance. And they reduce the social friction of saying something emotional in text form; this is especially&amp;nbsp;helpful in&amp;nbsp;a culture that is known to be less outwardly expressive even to one&amp;rsquo;s own family members and friends (where it is far less awkward to send a virtual-fistbump sticker than it is to tell someone directly that they&amp;rsquo;re a wonderful friend).\nAnd sometimes stickers can convey what words cannot! This form of visual communication has become so popular in Asia &amp;mdash; especially in China&amp;rsquo;s WeChat and Japan&amp;rsquo;s LINE [Line] &amp;mdash; that it is not uncommon to see a deep thread of multiple messages without a single word. They&amp;rsquo;re not just for those crazy young kids. More notably, stickers are commonly used in professional, not just personal, chats as well. Not so frivolous after all. In fact, stickers are so core to the success of Line, that its CEO actually credited them as the &amp;ldquo;turning point&amp;rdquo; for that app. He shared that it took Line Messenger almost four months to find its first two million users &amp;hellip; but after stickers were launched, it took only two days to find the next million. The company now makes over $270M a year just from selling stickers.\nSo why have stickers taken off in these apps? How did they get started, how do they keep users engaged? Here are some elements in the success and spread of stickers as a visual communication medium.\nStickers as trading cards\nIn WeChat, stickers are like Pok&amp;eacute;mon trading cards: you collect them, you keep them, you share them when needed.\nBut this isn&amp;rsquo;t just about statically collecting and preserving a complete &amp;ldquo;set&amp;rdquo;, the way one might trade for and ultimately collect a set of Hall of Famer baseball cards. Stickers do exist in sets, as in the workplace sets launched by Tencent below to be used in office messaging conversations:\n\n&amp;lsquo;Wow cool stickers&amp;rsquo;The &amp;ldquo;trading&amp;rdquo; element, however, is less about statically collecting and more about dynamically custom-curating one&amp;rsquo;s personal collection of stickers. These collections also signal one&amp;rsquo;s &amp;ldquo;sticker street cred&amp;rdquo; in Asian messaging apps &amp;mdash; you can always tell a newbie or non-tech savvy user by their use of the stock stickers only.\nSo where then does the idea of trading come in? That element, I believe, has a lot to do with the way stickers were implemented at launch.\nWhen WeChat first launched stickers, users had two ways of sourcing them: download approved sticker packs from the WeChat sticker gallery, or upload their own gifs and save them in a custom sticker folder. Unsurprisingly, most users did not go through the hassle of uploading their own stickers. But when just-enough users cumulatively did, WeChat soon had millions of crowdsourced, relevant gifs &amp;mdash; already native for chat use given how they were created &amp;mdash; circulating on the WeChat platform.\n&amp;lsquo;from the collection of Connie Chan&amp;rsquo;What happened next is key: WeChat was careful not to make this a static upload\/download activity from centralized sources &amp;mdash; they injected a mechanic where if you received a custom sticker in a chat thread, you could easily save it to your own custom sticker folder, and wait for a great opportunity to use it (e.g., &amp;ldquo;trade it&amp;rdquo;) in another future conversation. Over time, collecting, having, and trading these stickers became a point of pride for savvy users, and saving and reusing them was natural.\nThe delight of collecting stickers becomes most apparent over holidays. In the early years of WeChat, when the winter holidays came around, users began sending each other custom animated gifs related to Christmas, New Year&amp;rsquo;s, or Chinese New Year. It&amp;rsquo;s the messaging-native equivalent of a free Christmas card. Soon, WeChat users would try to one-up each other &amp;mdash; seeing who had the best sticker, the funniest sticker, the most beautiful sticker. It&amp;rsquo;s a mechanic that continually increases the use of stickers as a communication and signaling medium.\nStickers as marketplaces\nThe massive popularity of WeChat stickers and trading-card like behavior led WeChat to create a &amp;ldquo;sticker marketplace&amp;rdquo; for Chinese users in summer 2015. Line actually released a marketplace of its own earlier, in 2014 &amp;mdash; the Line Creators Market, where designers worldwide could submit stickers to be sold on the app.\nIn WeChat, independent artists contribute their sticker creations and users can choose to reward these artists with cash donations, similar to &amp;ldquo;likes&amp;rdquo;, only with token amounts of money tied to them. While the dollar amount can be as small as $0.15, as with all things in China, the numbers add up given massive scale: This year, one artist received over $19K USD of donations for the Chinese New Year sticker set below:\n\nInterestingly, instead of collecting a portion of the proceeds, WeChat allows artists to keep 100% of the proceeds. So what then does WeChat get out of it? More user engagement, and a high-quality variety of stickers that helps the platform go beyond just text and audio chat (and, frankly, their monetization model doesn&amp;rsquo;t center around stickers). For artists, the benefits are obvious: access and distribution, not to mention opportunities for iterative feedback from users.\nThis crowdsourced-curation marketplace model helps WeChat strike the balance of releasing their own &amp;ldquo;official stickers&amp;rdquo; while also allowing more expressive and fun messaging options for users. In the marketplace, users cast their votes for quality stickers with downloads. And as a platform, WeChat reviews new sticker submissions before they hit the marketplace. Algorithms are also in place that utilize usage data to promote the best stickers. Not only does this model open new revenue streams for quality content creators, it also helps discourage overuse of lower quality stickers (such as a 1MB+ huge animated gif or a highly inappropriate one), which could muddy the joy of discovery and ease of use.\nLine, meanwhile, made stickers more central to its strategy, with over 390,000 creators from 156 countries submitting stickers for consideration in the first year of the marketplace alone. Responding to the high volume of submissions, Line soon after released Line Creators Management &amp;mdash; a de facto digital talent-agency like service that helps sticker creators apply for trademarks, sign merchandising deals, and so on. This enables Line to take a portion of the sticke…",
                "fallback": "Andreessen Horowitz Link: The Elements of&nbsp;Stickers",
                "from_url": "http:\/\/a16z.com\/2016\/06\/17\/stickers\/",
                "service_icon": "http:\/\/0.gravatar.com\/blavatar\/028155d40793d8c2f7fd77a3b55ac924?s=114",
                "id": 1
            }
        ],
        "ts": "1466627808.000021"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "Thanks Rob. As we will design very simplified icons for the app, there might be a cool place for ‘minimal design stickers’ for the social part of the app later on.",
        "ts": "1466628574.000023"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Props to Rob for still jamming out ideas for Compass :v:",
        "ts": "1466628783.000024",
        "reactions": [
            {
                "name": "+1::skin-tone-3",
                "users": [
                    "U0HPGQ4KH"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": ":slightly_smiling_face:",
        "ts": "1466628833.000025"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "<@U0261PCRQ> &amp; <@U02613K0X> just looked at the Nike Training Club app and that overhaul update you guys mentioned was released today",
        "ts": "1466631291.000026"
    },
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "ooooo very interested to check it out",
        "ts": "1466631346.000027"
    }
]