[
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel> Katrina and Israel are aware of our all hands meeting today. Katrina will be in after 2pm. Also dev team - Israel has a poll he's going to be sending you that he'd love your responses on ASAP as he's got a meeting at 1pm and is looking for your responses beforehand. ",
        "ts": "1453740738.000004"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "Thanks Abby ",
        "ts": "1453740820.000005"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "Hey Abby. The all hands meeting is not on my calendar. I slacked with Ewald and let him know that Friday turned out to be a bad day for my foot. It still needs elevation above the heart and icing. Therefore decided to WFH today. Bad timing, I know. Please let me know if there is anything that you'd like my feedback on. I continue working on what we looked at on Friday ... Will be available via all channels. ",
        "ts": "1453743358.000006"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Totally understandable Felix, thank you for the head’s up",
        "ts": "1453743423.000007"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Since we’ll all be in this meeting until 2pm I’d say your focus sounds good",
        "ts": "1453743431.000008"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "After that it would be great to connect with Justin on BrandLab Wall",
        "ts": "1453743442.000009"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel> Not a fun reminder, but can everyone make sure they are trying to get their compass hours logged? If you worked the weekend please add that in there as well when time permits. Thank you!",
        "ts": "1453743573.000010"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "Thanks Abby, will do",
        "ts": "1453743624.000011"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "ah, will get on that after the facilitation meeting for sure",
        "ts": "1453743674.000012"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "thanks dude",
        "ts": "1453743861.000013"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "visual design next steps\ninclude historical work that went into the dots around the circle view (matt's design)\nmake sure the header bar is consistent across different directions so they feel like the same exploration\nremove \"active minutes\" label and leave the number so it's arbitrary\non the \"yoga warmdown\" one (matt's design) - make the circles more defined so you can see their relationship more\ntrent's bubble version - show two weeks ago and today to show the comparison OR good day vs bad day\nshow one slide with alllll of the explorations\n\nkeynote notes\nshow process (visual themes, sketching, higher fidelity, etc)\nshow historical examples to show where we started \/ show one slide with alllll of the explorations\nshow where we got with active minutes constraint\nshow the higher level visuals\nput the designs in a phone shell\nleave motion out for now, she'll speak to it",
        "edited": {
            "user": "U026103R3",
            "ts": "1453774186.000000"
        },
        "ts": "1453773486.000014"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "great, this looks like a solid plan. anybody, please let me know if i can contribute to the deck somehow (feel awkwardly removed from it all and cant wait to be back in one piece …)",
        "ts": "1453774360.000016"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "thanks felix! we had a great meeting with Katrina getting her up to speed with our progress and it helped to define the next steps you see above. we’ll let you know if deck help is needed!!",
        "ts": "1453774462.000017"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "thx!",
        "ts": "1453774803.000018"
    }
]