[
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "heading out to look at another rental. will be back this afternoon.",
        "ts": "1478805401.000246"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel> \n\nHey Compass Team - \n\nWe received news this morning from our adidas partners that Chameleon is no longer in the plans. Rather than splitting the focus between a physical product with limited reach, and a digital product with huge reach and potential, they have decided to focus efforts on the All Day application. There are currently no plans to bring Chameleon back into the roadmap, but we believe that's always a possibility. For now however, adidas has chosen to shut down all efforts on the chameleon product and double down on the application. \n\nThis shouldn't have a big impact to our Uncorked team, in that we had a couple of folks working on UX and dev, but minimally. The great news, is that we benefit from having this attention back on the launch product. Longer term, it may mean more third party integrations (e.g. Fitbit, Garmin), but in the short term it means a couple of things:\n\n1. It's super important to remember that a lot of time and effort has gone into this product to date, and that adidas is also getting this message today. We need to be aware of this and extra compassionate to our clients, not just today or this week, but in general.\n\n2. Let's nail the All Day launch! The current plans for launching the 1.0 application are sticking right now, so let's put in a solid effort and make this digital product the best it can be, because we're all counting on it. \n\nPlease feel free to grab me or ping me (as well as Leia, Felix, Evans, or James) with any questions you might have. Thanks everyone.",
        "ts": "1478805486.000247"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "thanks, <@U026103R3>.",
        "ts": "1478805548.000248"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "Also - I know this seems bizarre, but it is not uncommon when you deal with innovation groups in large corporations, sadly.  But even though this is not unusual, it still sucks for folks who have been putting their time and love into something that gets squished. So extra love to all of you (and our Adi peers) who have put heart into chameleon. :heart:",
        "ts": "1478805661.000249",
        "reactions": [
            {
                "name": "heavy_plus_sign",
                "users": [
                    "U02F8TTPU",
                    "U167FL70V",
                    "U026103R3"
                ],
                "count": 3
            }
        ]
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "damn",
        "ts": "1478805812.000250"
    },
    {
        "type": "message",
        "user": "U0WDS9THQ",
        "text": "wow",
        "ts": "1478806923.000251"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "my lg g4 battery just gave up, so I'm out of phone contact until I seek out a new one first thing tomorrow!",
        "ts": "1478838703.000252"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "<@U02F8TTPU> I have a nexus 6 you can use in the meantime ",
        "ts": "1478846224.000253"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "If you need a phone and not a battery",
        "ts": "1478846245.000254"
    }
]