[
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "<!channel> - wanted to share this comm from Christian + Amy:",
        "ts": "1470068157.000100"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "Hi James,\n\nI am assuming you have heard that there is a push out for the All Day launch and we have a very hard date of March 1st.  We are launching at SXSW and can't slip.  It has been communicated to Uncorked dev and design and wanted to follow up with you.  We are not able to add any other features and will have to design to the current plan.  The only addition we are working on is additional content for Discoveries is the same template format.  No changes to the format and there is a team here defining those Discoveries.  Christian and I are traveling next week for work but please reach out with questions, concerns etc.  We do not want our travel to impact schedule in any way.  I will even use slack.  I promise.\n\nHave a good weekend,\nAmy",
        "ts": "1470068158.000101"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "i know that you all have heard from other folks as well, just wanted to make sure you all read the “official” party line.  please let me know if you have comments\/questions.",
        "ts": "1470068197.000102"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "<@U0914MEN7>: Thanks for sending this through :slightly_smiling_face:",
        "ts": "1470068273.000103"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "yes, thanks! It’s good to know that they’re planning on including some more discoveries. Shouldn’t change our current definition, but it could change the way we talk about them.",
        "ts": "1470068306.000104"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "i’m interested to see how they interpret “same template” because our current launch is “all one template” but there’s really 3 different sub-templates. hopefully they stick within the existing parameters.",
        "edited": {
            "user": "U0260V1BX",
            "ts": "1470070394.000000"
        },
        "ts": "1470070387.000105"
    },
    {
        "type": "message",
        "user": "USLACKBOT",
        "text": "Reminder: Hey everyone, if you haven’t yet filled out and submitted your Harvest time sheet from last week, please make sure to do it today by end of day. Thanks!",
        "ts": "1470070800.000107"
    }
]