[
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "<@U026103R3> did we have another meeting on the books with Scott sometime tomorrow or the day after?",
        "ts": "1453332204.000002"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Hey Trent, thanks for checking in on that. We don’t have anything on the books, but I did mention to Scott it would make sense to check in later in the week. The real question becomes when would you guys feel comfortable meeting with him again?",
        "ts": "1453332330.000003"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<@U026PLK4S>: Looking for your input here as well",
        "ts": "1453332338.000004"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "I’m wondering if some time on Friday makes sense",
        "ts": "1453332362.000005"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<@U026E0ZNR>: let me know your thoughts",
        "ts": "1453332418.000006"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I’d easily take friday over tomorrow. i also know we have our weekly creative check in (on thursday)… which i’m not sure what the overlap is, if we’ll touch on our work anyway or talk about other stuff.",
        "edited": {
            "user": "U026E0ZNR",
            "ts": "1453332589.000000"
        },
        "ts": "1453332517.000007"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "good question, I can reach out to Scott and suggest we meet to look at visuals some time on Friday if that’s good for everyone. I  haven’t invited him to the touch base meeting, but I think for that we’ll need to get Amy really up to speed",
        "ts": "1453332653.000009"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "So on tomorrow’s meeting, I’m not sure if we’ll need to show visual progress, but we might be able to in a really quick way that lets Amy in without going into real review or detail",
        "ts": "1453332695.000010"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Update: sounds like I’ll need to push our creative touch base meeting due to a conflict on the adidas side anyway, so maybe I can just kind of combine them",
        "edited": {
            "user": "U026103R3",
            "ts": "1453332827.000000"
        },
        "ts": "1453332787.000011"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Where Scott comes in to talk visuals, and we have the creative touchbase directly after",
        "ts": "1453332801.000012"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "i think that’d be a good call overall",
        "ts": "1453332863.000014"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "lets loop the UX crew in on that round up with scott too, pls!",
        "ts": "1453333156.000015"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "ok no problem",
        "ts": "1453333177.000016"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "thank you",
        "ts": "1453333181.000017"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Ok, <!channel> here’s the tentative plan - visual check in with Scott on Friday at 2pm, creative touch base directly after at 3pm",
        "ts": "1453333416.000018"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Hey guys. Sorry to be late to the party. Was talking with Ewald today, and I really want us to get out of this habit of us working and then presenting to Scott. I’d love to use that time to work with Scott and advance whatever we’ve got. Then, I’m happy to share where we’re at during the creative checkin",
        "ts": "1453334651.000019"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "having us present to scott and ux team, then a creative review seems excessive, when heads down time, and also time with scott seems much more valuable",
        "ts": "1453334693.000020"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<@U026PLK4S> Ok that makes sense, would you prefer I change the meeting with Scott to more of a work session Friday morning?",
        "ts": "1453334741.000021"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "i think our team needs more heads down time, and if we could use friday morning to advance on our end, then the worksession will hopefully be more fruitful",
        "ts": "1453334893.000022"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "yep makes total sense, i think we keep the meeting times as is but focus the visual touch base on work session time with scott",
        "ts": "1453335126.000023"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "that’d be great",
        "ts": "1453335156.000024"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "to that point, we can update the bigger team at the creative touch base if that makes sense",
        "ts": "1453335158.000025"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "cool, in that case <@U0260V1BX> and <@U0HP6TFNX> I might revise that meeting to keep it visuals focused and have you guys get up to speed at the creative touch base",
        "ts": "1453335188.000026"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "mostly so these guys can get head’s down and collaborate, but also so we’re not having the same meeting twice",
        "ts": "1453335205.000027"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "cool?",
        "ts": "1453335216.000028"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "good for me",
        "ts": "1453335317.000029"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "that's fine, I just want to make sure we're all aligned, knowing that we're presenting this stuff next week. I'm feeling a little out of the loop on visuals and want to make sure that the paths we're going down make sense. Especially considering megan and quinn are pretty fresh and haven't seen any version of the visuals.",
        "ts": "1453335523.000030"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "makes total sense, and thanks for keeping an eye on that. let’s keep that update to the creative touch base since that will give Scott the time and platform to put forward his thoughts and feedback before it’s opened up to the larger team. but duly noted, and i’ll keep opportunities for keeping both teams in the loop front of mind as we move forward.",
        "ts": "1453335730.000031"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "also it sounds like a lot of the compass visuals were shown at the design critique today, so part of it may just be unfortunately due to sickness (blah) and being ooo. fortunately megan was there and now should have some visual reference.",
        "ts": "1453335814.000032"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "oh good",
        "ts": "1453335831.000033"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "yep, I saw new visuals that built on the dashboard workshop visuals from before, which was super helpful",
        "ts": "1453335874.000034"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "awesome",
        "ts": "1453335881.000035"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "i'm excited to see the latest",
        "ts": "1453335888.000036"
    }
]