[
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!here|@here> Hey folks! Wanted to let you all know that we have enabled Smart Sync on our dropbox account. This allows you to see all dropbox folders and files on your machine, but also allows you to sync files selectively, rather than the whole folders syncing constantly and taking up valuable space on your hard drive. \n\nIf you use dropbox for desktop, you'll be able to to right click an individual file or folder, choose Smart Sync, and then choose either Local to keep that file synced or Online only so that it does not sync. \n\nIf you have any questions, feel free to grab me! I'd be happy to show you how it works, and want to make sure we all fully understand how it does before we dig in. Lastly, here's an article with more info if it's helpful: <https:\/\/www.dropbox.com\/help\/9293>\n\nAlso if you are not on our dropbox business account and think you should be, come chat with me about it and we'll get you on there.",
        "attachments": [
            {
                "service_name": "Dropbox",
                "title": "Smart Sync - Dropbox Help - Dropbox",
                "title_link": "https:\/\/www.dropbox.com\/help\/9293",
                "text": "Dropbox Help Center -- For your questions regarding Dropbox's Basic service, Dropbox Pro, and Dropbox Business",
                "fallback": "Dropbox: Smart Sync - Dropbox Help - Dropbox",
                "thumb_url": "https:\/\/cfl.dropboxstatic.com\/static\/images\/brand\/glyph@2x-vflJ1vxbq.png",
                "from_url": "https:\/\/www.dropbox.com\/help\/9293",
                "thumb_width": 214,
                "thumb_height": 200,
                "id": 1
            }
        ],
        "ts": "1486489887.000005"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Should this change be currently in effect for us? Not sure I’m seeing the correct options to enable the feature yet",
        "ts": "1486490636.000007"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "I believe it should be yes, if you want i can look over your shoulder and see if I can help.",
        "ts": "1486491000.000008"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Ah I may have it set to admins only right now. I’ll follow up.",
        "ts": "1486491432.000009"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Ok that was the case! I’ve now enabled Smart Sync for everyone on the team. Let me know if you still don’t see the option and I can troubleshoot further.",
        "edited": {
            "user": "U026103R3",
            "ts": "1486491669.000000"
        },
        "ts": "1486491665.000010"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Oh cool! I had to quit\/restart my Dropbox app and Smart Sync showed up. :thumbsup:",
        "ts": "1486491796.000012"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "we good",
        "ts": "1486491802.000013"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Awesome! Thanks for the restart tip Trent!",
        "ts": "1486491843.000014"
    }
]