[
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "<http:\/\/www.liveathos.com\/>",
        "attachments": [
            {
                "text": "Athos is creating the new standard for fitness by changing the way we train the human body.",
                "fallback": "Athos is creating the new standard for fitness by changing the way we train the human body.",
                "from_url": "http:\/\/www.liveathos.com\/",
                "id": 1
            }
        ],
        "ts": "1418926771.000002"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Want this so bad. Hope they have a version that looks good on chubby people.",
        "edited": {
            "user": "U02618EV1",
            "ts": "1418927124.000000"
        },
        "ts": "1418926832.000004"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "I'm going to order some of these ESP8266 chips: <http:\/\/hackaday.com\/2014\/12\/17\/esp-gets-fcc-and-ce\/> $2.80 or so\/ea is pretty awesome for 802.11 wifi",
        "attachments": [
            {
                "service_name": "Hackaday",
                "service_url": "http:\/\/hackaday.com",
                "title": "ESP Gets FCC and CE",
                "title_link": "http:\/\/hackaday.com\/2014\/12\/17\/esp-gets-fcc-and-ce\/",
                "author_name": "Brian Benchoff",
                "author_link": "https:\/\/hackaday.com\/author\/brianbenchoff\/",
                "thumb_url": "https:\/\/i2.wp.com\/hackadaycom.files.wordpress.com\/2014\/12\/esp2.jpg?fit=200%2C150",
                "thumb_width": 200,
                "thumb_height": 81,
                "text": "The ESP8266 Internet of Things module is the latest and greatest thing to come out of China. It’s ideal for turning plastic Minecraft blocks into Minecraft servers, making your toilet tweet, or for some bizarre home automation scheme. This WiFi module is not, however, certified by the FCC. The chipset, on the other hand, is.\nHaving a single module that’s able to run code, act as a UART to WiFi transceiver, peek and poke a few GPIOs, all priced at about $4 is a game changer, and all your favorite silicon companies are freaking out wondering how they’re going to beat the ESP8266. Now the chipset is FCC certified, the first step to turning these modules into products.\nThis announcement does come with a few caveats: the chipset is certified, not the module. Each version of the module must be certified by itself, and there are versions that will never be certified by the FCC. Right now, we’re looking at the ESP8266-06, -07, -08, and -12 modules – the ones with a metal shield – as being the only ones that could potentially pass an FCC cert. Yes, those modules already have an FCC logo on them, but you’re looking at something sold for under $5 in China, here.\nAnyone wanting to build a product with the ESP will, of course, also need to certify it with the FCC. This announcement hasn’t broken down any walls, but it has cracked a window.",
                "fallback": "Hackaday Link: ESP Gets FCC and CE",
                "from_url": "http:\/\/hackaday.com\/2014\/12\/17\/esp-gets-fcc-and-ce\/",
                "id": 1
            }
        ],
        "ts": "1418941992.000006"
    }
]