[
    {
        "type": "message",
        "user": "U02AVBGQC",
        "text": "I know this group seems to mostly be about wearables for fitness, but I'm curious if there's anyone here who has done research into other types of wearable tech, specifically haptic response systems. VR is in desperate need of working, unobtrusive systems to provide that necessary haptic feedback for touch and other sensations of collision, and I'm very interested in solving this problem. Got any leads?",
        "ts": "1410199162.000002"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "sadly I do not. But I'd be interested to see what you find out there",
        "ts": "1410201137.000003"
    },
    {
        "type": "message",
        "user": "U02AVBGQC",
        "text": "My limited amount of research led me to two different paths\/problems - the 'force feedback' often characterized by rumble pads, and actual motion limiting, using some form of mechanical tension (<http:\/\/www.cyberglovesystems.com\/?q=products\/cybergrasp\/overview>). Both serve to solve different problems, either providing a tangible reaction to the kinesthetic senses upon impact, or actually limiting the motion of the hand upon interaction. I find both methods fascinating, but also extremely obtrusive to a truly immersive VR experience, and see much room for simple improvement.",
        "ts": "1410201382.000004"
    },
    {
        "type": "message",
        "user": "U02AVBGQC",
        "text": "Another few researchers were also experimenting with temperature, which is an often-forgotten sensory data point we can easily and readily simulate right now.",
        "ts": "1410201443.000005"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "More wearable tech + fashion. Not sure if I just want something from opening ceremony or I actually like this. Maybe a bit of both. <http:\/\/www.usatoday.com\/story\/tech\/2014\/09\/03\/intel-smart-bracelet-opening-ceremony\/14992131\/>",
        "attachments": [
            {
                "title": "Intel takes wraps off its high-fashion smart bracelet",
                "title_link": "http:\/\/www.usatoday.com\/story\/tech\/2014\/09\/03\/intel-smart-bracelet-opening-ceremony\/14992131\/",
                "text": "SAN FRANCISCO - Chip giant Intel on Wednesday took the wraps off a smart-looking smart bracelet under a partnership with fashion house Opening Ceremony. High-end retailer Barney's will carry the bracelet,",
                "fallback": "Intel takes wraps off its high-fashion smart bracelet",
                "thumb_url": "http:\/\/www.gannett-cdn.com\/-mm-\/ad22e2407076fe22db82c2d6b2df150c416d78dc\/c=0-279-5587-3430&r=x1803&c=3200x1800\/local\/-\/media\/USATODAY\/USATODAY\/2014\/09\/02\/1409699130000-Phase-1-group-shot-lean.jpg",
                "thumb_width": 3200,
                "thumb_height": 1800,
                "from_url": "http:\/\/www.usatoday.com\/story\/tech\/2014\/09\/03\/intel-smart-bracelet-opening-ceremony\/14992131\/",
                "id": 1
            }
        ],
        "ts": "1410226326.000002"
    }
]