[
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<http:\/\/techcrunch.com\/2015\/08\/20\/with-100m-in-funding-carbon3d-will-make-3d-manufacturing-a-reality\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "With $100M In Funding, Carbon3D Will Make 3D Manufacturing A Reality",
                "title_link": "http:\/\/techcrunch.com\/2015\/08\/20\/with-100m-in-funding-carbon3d-will-make-3d-manufacturing-a-reality\/",
                "author_name": "Christine Magee",
                "thumb_url": "https:\/\/i1.wp.com\/tctechcrunch2011.files.wordpress.com\/2015\/08\/carbon3d.jpg?fit=200%2C150",
                "thumb_width": 200,
                "thumb_height": 112,
                "text": "Carbon3D, a startup building 3D printers for manufacturers, has pulled in $100 million in new funding to move 3D printing out of the prototyping phase and into production.\nGoogle Ventures led the Series C round, joined by new investors Yuri Milner, Reinet Investments, and F.I.S., along with existing investors Sequoia Capital, Silver Lake Kraftwerk, and Northgate Capital.\nIf Carbon3D’s printers look like something out of a Terminator movie, it’s because that’s where co-founder Joseph DeSimone drew the inspiration for the technology. The printers are powered by a photochemical process, rather than the layer-by-layer process of traditional 3D printers, which allows them to print functional parts at 100 times the speed of existing printers.\n“This is the first 3D printing tech that really has the potential to break out of the prototyping realm that 3D printing has been relegated to until now,” says Andy Wheeler, who led the Carbon3D investment for Google Ventures. “For one because of the sheer speed, but perhaps even more importantly due to the range of materials.”\nCarbon3D can print everything from a remote control to the arm of a chair by utilizing a variety of materials that a typical 3D printer cannot.\nThe company is already working with a dozen large manufacturers spanning the automotive, aerospace, and consumer electronics industries, including Ford and special effects studio Legacy Effects.\nMany of the parts Carbon3D’s printers are churning out were previously made with injection molding, which gets expensive if you’re only creating a handful of parts. Potentially the most exciting aspect, though, is that this technology makes it possible to create an entirely new range of structures and parts.\nInstead of using steel to build certain high-strength components of an airplane, for instance, Carbon3D would be able to 3D print a lightweight alternative by shaping plastic into a form previously impossible to manufacture.\nCurrently in beta, the company will begin selling its industrial-scale printers to manufacturers later this year.",
                "fallback": "TechCrunch Link: With $100M In Funding, Carbon3D Will Make 3D Manufacturing A&nbsp;Reality",
                "from_url": "http:\/\/techcrunch.com\/2015\/08\/20\/with-100m-in-funding-carbon3d-will-make-3d-manufacturing-a-reality\/",
                "id": 1
            }
        ],
        "ts": "1440092088.000002"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "I recommend watching the lil video in that post. Pretty cool.",
        "ts": "1440092109.000004"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "i didn’t know kraftwerk was into VC now",
        "ts": "1440092171.000005"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "that video is some James Cameron’s the Abyss action though",
        "ts": "1440092219.000006"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "v cool",
        "ts": "1440092390.000007"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "<http:\/\/www.smartkitchensummit.com\/>",
        "attachments": [
            {
                "service_name": "The Smart Kitchen Summit",
                "title": "Welcome",
                "title_link": "http:\/\/www.smartkitchensummit.com\/",
                "text": "The Smart Kitchen Summit: The one and only event looking at the future of the connected kitchen.",
                "fallback": "The Smart Kitchen Summit: Welcome",
                "from_url": "http:\/\/www.smartkitchensummit.com\/",
                "id": 1
            }
        ],
        "ts": "1440120903.000008"
    }
]