[
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "MIT's Amazing New App Lets You Program Any Object <http:\/\/www.rightrelevance.com\/search\/articles\/hero?article=dae76195f4ccf070f5bebbc0f2a39fb4fce50925&amp;query=Internet%20of%20Things&amp;taccount=iot_rr>",
        "attachments": [
            {
                "title": "MIT's Amazing New App Lets You Program Any Object",
                "title_link": "http:\/\/www.rightrelevance.com\/search\/articles\/hero?article=dae76195f4ccf070f5bebbc0f2a39fb4fce50925&query=Internet%20of%20Things&taccount=iot_rr",
                "text": "<http:\/\/fastcodesign.com|fastcodesign.com> - The end goal of the Internet of Things is to make every object in your life programmable. But our smart objects are still pretty dumb. They don't talk to each other, and most are only capable of doing one thing; a smart lightbulb for instance can dim and brighten but it can't tell your TV to change the channel for you. The result of three years of research at MIT's Fluid Interfaces Lab, Valentin Heun's Reality Editor aims to address these problems. It's an augmented reality app that lets you link the smart objects around you together, just by drawing connections with your finger between them. An example here will be helpful in understanding the concept. Let's imagine you have a smart thermostat, and you want it to raise the heat in your house when you get out of bed in the morning. Provided you also had a smart bed—more on that in a minute—you could just look at your thermostat through the Reality Editor smartphone app. A Minority Report style overlay would then pop up, giving you options. You'd then trace your finger from a virtual circuit that raises the temperature of your thermostat to a circuit on your bed that can detect when you climb in or out. Of course, there are no smart beds. Yet. But there's no reason there couldn't be, and the Reality Editor is trying to make that, and all sorts of other smart objects, possible. \"Imagine a future where everything around you can be controlled,\" Heun says. Right now, companies like Amazon and Google, which are designing objects for the smart home, use artificial intelligence and big data to try to anticipate users' needs: in the case of the smart thermostat Nest, what temperature someone likes, for example. But Heun says this is reductive, because the Internet of Things should actually empower users to have more control over the world around them, not take it away.",
                "fallback": "MIT's Amazing New App Lets You Program Any Object",
                "thumb_url": "http:\/\/e.fastcompany.net\/multisite_files\/fastcompany\/imagecache\/slideshow_large\/slideshow\/2015\/12\/3054389-slide-s-3-mits-new-app-allows-you-to-program-any-object.gif",
                "from_url": "http:\/\/www.rightrelevance.com\/search\/articles\/hero?article=dae76195f4ccf070f5bebbc0f2a39fb4fce50925&query=Internet%20of%20Things&taccount=iot_rr",
                "thumb_width": 750,
                "thumb_height": 422,
                "id": 1
            }
        ],
        "ts": "1449867880.000002"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "program any object… that someone has written an adapter for.",
        "ts": "1449868588.000004"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "lol",
        "ts": "1449868723.000005"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "ANY OBJECT",
        "ts": "1449869682.000006"
    }
]