[
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "<http:\/\/mjg59.dreamwidth.org\/40505.html>",
        "ts": "1457710253.000011"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "Aw, no preview... ^^ I stayed in a hotel with Android lightswitches and it was just as bad as you'd imagine",
        "ts": "1457710416.000012"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "(Not me personally, the title of the story)",
        "ts": "1457710450.000013"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "I outfitted my whole apartment with hue bulbs and regret it every day ",
        "ts": "1457711850.000014"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "Rilly? Why?",
        "ts": "1457712625.000015"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "We hate our hue bulbs because the color state doesn't persist when you turn it off at the switch",
        "ts": "1457712788.000016"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "<http:\/\/qz.com\/637326\/amazon-echo-home-alone-with-npr-on-got-confused-and-hijacked-a-thermostat\/>",
        "attachments": [
            {
                "service_name": "Quartz",
                "service_url": "http:\/\/qz.com",
                "title": "Amazon Echo, home alone with NPR on, got confused and hijacked a thermostat",
                "title_link": "http:\/\/qz.com\/637326\/amazon-echo-home-alone-with-npr-on-got-confused-and-hijacked-a-thermostat\/",
                "author_name": "Ian Kar",
                "author_link": "https:\/\/qz.com\/author\/ikqz\/",
                "thumb_url": "https:\/\/i2.wp.com\/qzprod.files.wordpress.com\/2016\/03\/ap_1603022305383756.jpg?fit=200%2C150&quality=80&strip=all&ssl=1",
                "thumb_width": 200,
                "thumb_height": 112,
                "text": "Next time you listen to NPR, you might want to turn off your Amazon Echo.\nEarlier this month, NPR’s Weekend Edition ran a story on its Listen Up segment about Amazon Echo and how the voice-activated assistant was helping customers extend the power of the internet into their homes.\nBut, ironically, the radio program triggered Amazon Echos in the homes of a few listeners.\nThe show’s host, Rachel Martin, explained in an update on the story:\nListener Roy Hagar wrote in to say our story prompted his Alexa to reset his thermostat to 70 degrees. It was difficult for Jeff Finan to hear the story because his radio was right next to his Echo speaker, and when Alexa heard her name, she started playing an NPR News summary. Marc-Paul Lee said his unit started going crazy too and wrote in to tell us this – let’s just say we both enjoyed the story. So Alexa, listen up – we want you to pledge to your local member station. You hear me? Lots and lots of money. Did you get that, Alexa?\nRandom things, like TV programs, have a tendency to set off Echo’s voice functions. It seems like it’s something that Amazon customer support knows about—and it annoys them too.\nYet the new internet-enabled speaker has stuck a chord with techie consumers, and is making its way into the mainstream. Echo added API integration so owners can call an Uber or activate their Spotify playlists by just commanding their device. Amazon also announced two new Echo models—the Tap, a portable Bluetooth speaker, and the Dot, which lets you add Echo’s voice-activation technology to your old speakers.\nThis post was updated to note that Listen Up is a segment of Weekend Edition.",
                "fallback": "Quartz Link: Amazon Echo, home alone with NPR on, got confused and hijacked a thermostat",
                "from_url": "http:\/\/qz.com\/637326\/amazon-echo-home-alone-with-npr-on-got-confused-and-hijacked-a-thermostat\/",
                "id": 1
            }
        ],
        "ts": "1457733359.000017"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "we live in an amazing time",
        "ts": "1457733419.000019"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "<@U02918BKW> sometimes the hub stops working and so my light switch stops working ",
        "ts": "1457733491.000020"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Using the app to turn in the lights when I come home from dinner is goofy ",
        "ts": "1457733516.000021"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Siri integration only sort of works ",
        "ts": "1457733521.000022"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Lack of room groupings ",
        "ts": "1457733532.000023"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "i love my hue!",
        "ts": "1457733615.000024"
    },
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "My favorite was when i was on my xbox one watching tv, and the kinect listens to commands like “Ok Xbox” and there was an xbox commercial where they were showing that off, and he says “Ok Xbox, launch titanfall” and of course thats what my xbox did and lauched the game killing the show i was watching",
        "ts": "1457733944.000025"
    }
]