[
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "doesnt look like we have a channel for cool hardware other than this one, but this is wicked cool and I ordered it for a new 3d printer im building <http:\/\/reprap.org\/wiki\/Diamond_Hotend>",
        "ts": "1455058141.000020"
    },
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "someone said that you can mix up to 15 color combinations with it, since the firmware supported dictating up to that many patterns, apparently it works pretty well from what ive read",
        "ts": "1455058242.000021"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "that's crazy cool",
        "ts": "1455058386.000022"
    },
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "Yeah, I really wanted to add a second head to my printer and attempts worked fairly well but the loss of space and sometimes the second head caught the print and pulled off the bed on those first few layers, getting them the exact same height… found this thing and im sold. at the least you get 3 colors into one head pretty solid, seen some videos on the mixing and it did appear that they mixed into new colors pretty well. Will be pretty sweet to play with",
        "ts": "1455058642.000023"
    },
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "going to build this printer <http:\/\/www.thingiverse.com\/thing:1313682> had make some changes to some of the parts since I couldn’t find the glass and heated bed they called for. but going with 300x300 bed with about 400mm on the z. will need to do some modeling for the mounts, but one of the features here was you will be able to swap out the print head for a laser or engraver easily. Have my laser cutter just waiting to be used on something like this. Hopefully the build goes well. Orderd everything last night now the slow wait from china begins",
        "attachments": [
            {
                "title": "Proto3DC- Convertible printer by NGR923",
                "title_link": "http:\/\/www.thingiverse.com\/thing:1313682",
                "text": "3DC is a simple, economic and covertible machine with a large working area, You can use it for milling, engraving or 3d printing. This project is all Open source. The working area is x=365mm y=255mm z=280mm using 490 mm rod for x and 370 mm rod for y and z. You can buy it from <http:\/\/www.ebay.it\/itm\/331769464422?ssPageName=STRK:MESELX:IT&amp;_trksid=p3984.m1555.l2649> 8\/02\/2016 Fixed,optimized and uploaded all new parts; Items needed list: Proto 3DC è un progetto di ProtoLAB, una stampante open source con un area di lavoro di 365x255x280 mm facilmente convertibile in fresa cnc, taglio laser o stampante 3d in pochi minuti. La struttura ha due assi movimentati tramite barre filettate (y e z) che garantisco precisione e rigidità della struttura e uno comandato da cinghia e puleggia (asse x). La stampante viene venduta su commissione e può essere interamente personalizzata. Il kit base comprende: n°6 motori nema 17 da 2,5A; n°4 barre trapezoidali D8mm L300mm+ chiocciole; n°4 barre liscie in acciaio inox D8mm L370mm; n°2 barre liscie in acciaio inox D8mm L500mm; n°2 barre liscie in acciaio inox D10mm L400mm; n°12 cuscinetti lineari LM8UU; n°4 cuscinetti lineari LM10UU; n°1 Estrusore E3D v6 lite; n°2 microswitch per finecorsa meccanico; n°1 sensore di prossimità; n°1 puleggia gt2 20 denti; n°1 cinghia gt2 passo 2mm largh. 6mm; n°2 giunti elastici 5-8 mm n°2 giunti rigidi 5-8 mm n°4 cuscinetti volventi 8x22 n°1 ruota dentata mk8 in acciaio n°1 scheda Arduino DUE a 32bit compatibile: n°1 RAMPS FD per Arduino DUE ; n°6 driver DRV8825; n°1 Alimentatore 220v-12v 30A;",
                "fallback": "Proto3DC- Convertible printer by NGR923",
                "image_url": "https:\/\/thingiverse-production-new.s3.amazonaws.com\/renders\/ea\/dc\/36\/79\/b3\/2e857d0459e6718c8203149173376d1a_preview_featured.jpg",
                "from_url": "http:\/\/www.thingiverse.com\/thing:1313682",
                "image_width": 333,
                "image_height": 250,
                "image_bytes": 69885,
                "id": 1
            }
        ],
        "ts": "1455058855.000024"
    }
]