[
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "<http:\/\/gizmodo.com\/the-internet-of-things-is-still-hackable-as-hell-1789152847>",
        "attachments": [
            {
                "service_name": "Gizmodo",
                "title": "The Internet Of Things Is Still Hackable as Hell",
                "title_link": "http:\/\/gizmodo.com\/the-internet-of-things-is-still-hackable-as-hell-1789152847",
                "text": "This warning is as true now as it’s ever been: beware of cheap internet-connected gadgets.",
                "fallback": "Gizmodo: The Internet Of Things Is Still Hackable as Hell",
                "image_url": "https:\/\/i.kinja-img.com\/gawker-media\/image\/upload\/s--3TN6Pm3A--\/c_fill,fl_progressive,g_center,h_450,q_80,w_800\/tkhetdgoxo0cqx0tewjx.jpg",
                "from_url": "http:\/\/gizmodo.com\/the-internet-of-things-is-still-hackable-as-hell-1789152847",
                "image_width": 444,
                "image_height": 250,
                "image_bytes": 12975,
                "service_icon": "https:\/\/i.kinja-img.com\/gawker-media\/image\/upload\/s---erriNCS--\/c_fill,fl_progressive,g_center,h_200,q_80,w_200\/fdj3buryz5nuzyf2k620.png",
                "id": 1
            }
        ],
        "ts": "1479504549.000192"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "<https:\/\/techcrunch.com\/2016\/11\/18\/intel-layoffs\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "Intel is laying off a major portion of its wearables group",
                "title_link": "https:\/\/techcrunch.com\/2016\/11\/18\/intel-layoffs\/",
                "author_name": "Brian Heater",
                "thumb_url": "https:\/\/i0.wp.com\/tctechcrunch2011.files.wordpress.com\/2016\/09\/gettyimages-515552466.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 133,
                "text": "According to sources close to the company, Intel is about to step back from wearables in a big way.\nIn 2014, the company purchased Basis, a little-known producer of some truly excellent fitness watches. The acquisition was clearly a piece of a much larger puzzle for Intel, as it folded the brand into NDG &mdash; the New Devices Group &mdash; a new wing designed to make&nbsp;a big play for the booming wearables market, while hitting back against rival chipmaker, Qualcomm.\nIn June 2015, Intel&nbsp;picked up Recon, makers of wearable heads-up displays for cyclists, snowboarders and the like. Here&rsquo;s what Recon co-founder,&nbsp;Dan Eisenhardt had to say at the time:\nIntel is an ideal partner for Recon. Intel&rsquo;s CEO, Brian Krzanich, made his commitment to wearable technology very clear shortly after assuming his current role in 2013. He reaffirmed that commitment in his keynote speech at the Consumer Electronics Show this January. Brian and his team, including New Technology Group head Josh Walden, share our vision for the potential of smart eyewear in the consumer and enterprise markets, and this deal reflects that shared vision.\nThis summer, however, cracks began to show in the company&rsquo;s wearable plans. In June, Intel&nbsp;recalled Basis Peak devices due to overheating concerns &mdash; effecting, according to the company, roughly 0.2 percent of users. Rather than replacing the units, the company simply stopped sales of the device altogether. Intel took it a step further and shut down the Peak&rsquo;s software support (including cloud storage), effective by year&rsquo;s end.\n\nIt was clear at the time that this would prove a big setback for Intel&rsquo;s wearable dreams. After all, the Basis acquisition hadn&rsquo;t produced much for the company beyond the release of the Titanium, a snazzed up version of the Peak that looked a bit better with a business suit.\nNow, according to sources close to the company, Intel is planning to take a major step back from its investment in the space &mdash; or possibly even exit wearables altogether. The changes will include a large number of layoffs in NDG, along with the larger New Technologies Group into which it was folded back in April of last year &mdash; a move already viewed at the time by some as an early sign of Intel&rsquo;s displeasure with its wearables division.\nThe company has already informed a number of employees about the changes, with many expected to lose their jobs before year&rsquo;s end. Reports thus far have been varied, but all point to a large job loss for those in the NDG and the possible shut down of the group altogether.\n\nAlong with the layoffs, the move likely means that much of NDG&rsquo;s work will never see the light of day, including Basis Ruby, an unannounced fitness watch, which, at the very least, might have helped buoy the company following the unceremonious death of the Peak.\nWe&rsquo;ve reached out to Intel and will update the story as soon as we hear back.",
                "fallback": "TechCrunch Link: Intel is laying off a major portion of its wearables&nbsp;group",
                "from_url": "https:\/\/techcrunch.com\/2016\/11\/18\/intel-layoffs\/",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/techcrunch-2013\/assets\/images\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1479526873.000194"
    }
]