[
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "<http:\/\/venturebeat.com\/2017\/01\/10\/inside-project-ara-googles-revolutionary-modular-phone\/>",
        "attachments": [
            {
                "service_name": "VentureBeat",
                "title": "The dream of Ara: Inside the rise and fall of the world’s most revolutionary phone",
                "title_link": "http:\/\/venturebeat.com\/2017\/01\/10\/inside-project-ara-googles-revolutionary-modular-phone\/",
                "text": "It looked nothing like an iPhone, or anything Apple might dare to make.On September 10, 2013, the day Apple unveiled the iPhone 5S, Dutch designer Dave Hakkens uploaded a video to YouTube to promo",
                "fallback": "VentureBeat: The dream of Ara: Inside the rise and fall of the world’s most revolutionary phone",
                "image_url": "http:\/\/1u88jj3r4db2x4txp44yqfj1.wpengine.netdna-cdn.com\/wp-content\/uploads\/2017\/01\/Ara-final-edit-copy.jpg",
                "from_url": "http:\/\/venturebeat.com\/2017\/01\/10\/inside-project-ara-googles-revolutionary-modular-phone\/",
                "image_width": 352,
                "image_height": 250,
                "image_bytes": 389582,
                "service_icon": "http:\/\/1u88jj3r4db2x4txp44yqfj1.wpengine.netdna-cdn.com\/wp-content\/themes\/vbnews\/img\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1484689601.000002"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "from DF: “One of the modules that we were working on was basically like a tiny aquarium for your phone,” said the source. “It was a little tiny biome that would go inside of a module and it would have a microscope on the bottom part, and it would have live tardigrades and algae — some people call them water bears. They are the tiniest living organism. We had this idea to build a tardigrade module and we’d build a microscope with it. So you’d have this app on your phone and you could essentially look at the tardigrades up close and watch them floating around.” Brooklyn-based art, design, and technology agency Midnight Commercial conceived the idea, and was commissioned by Google to build it, demonstrating the depth of what developers could create.",
        "ts": "1484689624.000004"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "if that part is true, this project genuinely deserved to die",
        "ts": "1484689665.000005"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "haha! <@U0260V4K1> I thought the exact.same.thing when I read that",
        "ts": "1484689901.000006"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "“If that was the best reason for putting together a modular phone, than what a stupid idea”. I always thought it was made for emerging markets. Like the incubators built using automobile parts",
        "ts": "1484689966.000007"
    },
    {
        "type": "message",
        "user": "U3M4RRNQ5",
        "text": "haha, I appreciate their attempt to think outside the box",
        "ts": "1484690112.000008"
    },
    {
        "type": "message",
        "user": "U3M4RRNQ5",
        "text": "but what a dumb thing to work on before the tech has even been proven to be practical",
        "ts": "1484690132.000009"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "so glad it’s dead. Android developer nightmare.",
        "ts": "1484690456.000010"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "I would have loved to be in the meetings where someone was like “I don’t care about technical feasibility, no one is leaving this room until we figure out how to get fish in this damn phone!\"",
        "ts": "1484690669.000011"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "that module is probably one of the easier things they could have done",
        "ts": "1484690724.000012"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "(forgetting the fact that I know very little about optics)",
        "ts": "1484690739.000013"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "but to try to build an app that will work on any phone. and any phone may or may not have the components your app needs to run is a nightmare.",
        "ts": "1484690764.000014"
    },
    {
        "type": "message",
        "user": "U0261PCRQ",
        "text": "working on samsung phones is bad right now because they don’t react how you expect them to. Having a phone that has a camera one second and doesn’t the next, ugh.",
        "ts": "1484690801.000015"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "Internet of tardigrades ",
        "ts": "1484691526.000016"
    }
]