[
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "<http:\/\/hackaday.com\/2017\/04\/03\/california-looks-to-compel-iot-security\/>",
        "attachments": [
            {
                "service_name": "Hackaday",
                "service_url": "http:\/\/hackaday.com",
                "title": "California Looks to Compel IoT Security",
                "title_link": "http:\/\/hackaday.com\/2017\/04\/03\/california-looks-to-compel-iot-security\/",
                "author_name": "Charles Alexanian",
                "author_link": "https:\/\/hackaday.com\/author\/calexanian\/",
                "thumb_url": "https:\/\/i1.wp.com\/hackadaycom.files.wordpress.com\/2017\/03\/california-iot-security-legislation-featured.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 107,
                "text": "There is a bill going through committee in the state of California which, if passed, would require a minium level of security for Internet of Things&nbsp;devices and then some.&nbsp;California SB 327 Information privacy: connected devices&nbsp;in its original form calls for connected device manufacturers to secure their devices, protect the information they collect or store, indicate when they are collecting it, get user approval before doing so, and be proactive in informing users of security updates:\nrequire a manufacturer that sells or offers to sell a connected device, defined as any device, sensor, or other physical object that is capable of connecting to the Internet, directly or indirectly, or to another connected device, to equip the device with reasonable security features appropriate to the nature of the device and the information it may collect, contain, or transmit, that protect it from unauthorized access, destruction, use, modification, or disclosure, and to design the device to indicate when it is collecting information and to obtain consumer consent before it collects or transmits information, as specified. The bill would also require a person who sells or offers to sell a connected device to provide a short, plainly written notice of the connected device&rsquo;s information collection functions at the point of sale, as specified. The bill would require a manufacturer of a connected device to provide direct notification of security patches and updates to a consumer who purchases the device.\nThis is just a proposal and will change as it finds its way through committee. Currently there a really no methods of punishment outlined, but recent comments have suggested individual prosecutors may have latitude to interpret these cases as they see fit.&nbsp;Additionally it has been suggested that the devices in question would be required to notify in some way the user when information is being collected. No language exists yet to clarify or set forth rules on this matter.\nThe security&nbsp;community has been sounding the cry of lackluster (often lack of) security on&nbsp;this growing army of IoT hardware and we&rsquo;ve all known one day the government would get involved. Often this type of action requires a&nbsp;major event where people were in some way harmed either physically or financially that would push this issue. Denial of service attacks have already occurred and hijacking of webcams and such are commonplace. Perhaps what we saw in September finally pushed this into the limelight.\nAny reasonable person can see the necessity of some basic level of security such as eliminating default passwords and ensuring the security of the data. The question raised here is whether or not the government can get this right. Hackaday has previously argued that this is a much deeper problem than is being addressed in this bill.\nThe size of California&rsquo;s economy (relative to both the nation and the world) and the high concentration of tech companies make it likely that standards imposed if this law passes will have a large effect on devices in all markets.",
                "fallback": "Hackaday Link: California Looks to Compel IoT Security",
                "from_url": "http:\/\/hackaday.com\/2017\/04\/03\/california-looks-to-compel-iot-security\/",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/hackaday-2\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1491249951.553116"
    }
]