[
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "Need advice on fleas. I've never had to worry about them with Salem before because she's a completely indoor cat, but last night I was on my bed and one jumped on a piece of paper in front of me. I'm really not sure where it came from but I freaked out because I know how much of a pest fleas can be. I went to the neighborhood store and got flea spray and put it on Salem (she really didn't like it). Normally I would use the drops but they didn't have any at the store I went to. I also vacuumed. I haven't noticed her itching so am not sure if they were on her yet or not. \n\nAny suggestions or thoughts? Should I get some drops and put them on? Do I need to do anything to the house? <@U0HP6TFNX> or anyone else?",
        "edited": {
            "user": "U1HKQRLMR",
            "ts": "1489423592.000000"
        },
        "ts": "1489423495.633186"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "Old flea meds have stopped working, (frontline and advantage??)",
        "ts": "1489423650.692413"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "Vets know about it and have a new flea treatment that is working - I forget what it's called ",
        "ts": "1489423675.701869"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "Me, I'd do a topical from the vet and then Asses if you have a problem in the house after that",
        "edited": {
            "user": "U0HP6TFNX",
            "ts": "1489423737.000000"
        },
        "ts": "1489423718.718185"
    },
    {
        "type": "message",
        "user": "U0HS41J3Y",
        "text": "agree with megan! a trip the vet to get the proper meds is definitely necessary!",
        "ts": "1489423772.738813"
    },
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "Oy",
        "ts": "1489423887.783817"
    },
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "I got something called Adams but that's good to know. Did they become immune to the old medicines or something?",
        "ts": "1489423913.793241"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "So apparently there is some prescription meds that a vet can give for dogs. It works for cats but doesnt come in the right dosage for cats. Some vets are confident enough to trim back the dosage for cats and apply it to them.",
        "ts": "1489426521.790466"
    },
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "I called Banfield and they are going to give me this dropper stuff called Shield Protect or something. Then I need to thoroughly clean my house.",
        "edited": {
            "user": "U1HKQRLMR",
            "ts": "1489426616.000000"
        },
        "ts": "1489426605.821054"
    }
]