[
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel> I was able to set up a call with Linda today but the only time that worked for everyone on their end is 1:30pm. Justin - I see you and Jason have a meeting at that time but it would be great to have one or both of you on this call with Melissa and I if possible.",
        "ts": "1443631181.000002"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "yeah - I just pushed Jason and my meeting back",
        "ts": "1443631507.000003"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "awesome, thanks!",
        "ts": "1443631515.000004"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "thanks for setting that up <@U026103R3>!",
        "ts": "1443631614.000005"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "no problem at all",
        "ts": "1443631623.000006"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel> we're in the echo chamber for our all when y'all are ready",
        "ts": "1443644683.000007"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "sweet",
        "ts": "1443644690.000008"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel>: I shared with the design team the example docs Linda passed along. Hang tight for a brief descriptions of those docs from Linda",
        "ts": "1443647977.000009"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "\"I put everything that should be helpful in a folder for you and your team and shared it with you. Included are briefs for Americanas and L'Oreal Elvive.  Note that they are not super cleaned up, but should give an idea of the type of information we get from the client before the workshop.\n\nAlso there are the insights kickoff docs I put together for each workshop for the analysts.  There are some redundancies here with the brief, and it's what I use to drive the conversation around hypotheses and data gaps. I've included the ones for the workshops next week, as well as some others.:",
        "ts": "1443648076.000010"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Let me know if anyone else is interested in those docs and I can share them your way",
        "ts": "1443648162.000011"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "awesome!",
        "ts": "1443648287.000012"
    }
]