[
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "THIS: <https:\/\/www.pinterest.com\/filipedferreira\/styling\/>",
        "attachments": [
            {
                "service_name": "Pinterest",
                "title": "STYLING",
                "title_link": "https:\/\/www.pinterest.com\/filipedferreira\/styling\/",
                "text": "Pinterest is a visual discovery tool that you can use to find ideas for all your projects and interests.",
                "fallback": "Pinterest: STYLING",
                "thumb_url": "https:\/\/s-media-cache-ak0.pinimg.com\/custom_covers\/200x150\/548102285838832310_1384909206.jpg",
                "from_url": "https:\/\/www.pinterest.com\/filipedferreira\/styling\/",
                "thumb_width": 200,
                "thumb_height": 150,
                "id": 1
            }
        ],
        "ts": "1445966684.000002"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "<@U02F9CXTL> want to make sure you have this: <https:\/\/drive.google.com\/a\/google.com\/folderview?id=0B37N5no581ZQRDFsQjg0SldVeVk&amp;usp=sharing>",
        "ts": "1445977109.000004"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "new brandlab logos",
        "ts": "1445977114.000005"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<@U0260V4K1>: <@U02F9CXTL> <@U0260V1BX> <@U02F8LF2X> <@U02E3CRMA> Hey Team! Just a head's up but I thought it would be helpful to have physical to do lists so we all know what's on our plate for this upcoming presentation. So you'll see those hit lists for each person on the wall in the design room. Check them out when you get a chance, feel free to add anything that may not be there, and if you could check stuff off as it's completed that would be killer.",
        "ts": "1445991217.000006"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Thank you Abby!",
        "ts": "1445991263.000007"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "thanks abby!",
        "ts": "1445991471.000008"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "no problem!",
        "ts": "1445991697.000009"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "Only 2 of the presentation in stock at blick. Buying them and going to order 4 more on amazon prime",
        "ts": "1445994034.000010"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "*presentation books",
        "ts": "1445994050.000011"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Thanks Melissa!",
        "ts": "1445996933.000002"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Also FYI were confirmed with Josh for our call tomorrow ",
        "ts": "1445996974.000003"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<@U0260V1BX> which kind? I drive past Blick in the morning and could grab some.",
        "ts": "1445997056.000004"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "Out in Beaverton, so they might have them...",
        "ts": "1445997096.000005"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "Already ordered! Up to <!channel> if we'd rather get our hands on them sooner ",
        "ts": "1445997137.000006"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "I mean if it's Amazon prime I think hats fine",
        "ts": "1445997164.000007"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "We wouldn't be doing anything with them tomorrow anyways (I think, and please correct me if I'm wrong)",
        "ts": "1445997197.000008"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "Ive got 2 anyway. Were just putting our trust in amazon. Which is usually fine",
        "ts": "1445997243.000009"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "yeah - I think we’ll be fine",
        "ts": "1445997398.000010"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "thanks for getting this together <@U0260V1BX>",
        "ts": "1445997416.000011"
    },
    {
        "type": "message",
        "user": "U02F9CXTL",
        "text": "2 is better then 0! Thanks <@U0260V1BX>!",
        "edited": {
            "user": "U02F9CXTL",
            "ts": "1445998149.000000"
        },
        "ts": "1445997607.000012"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "i live across from a collage if that’s something they might carry",
        "ts": "1445998470.000014"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "(idk)",
        "ts": "1445998473.000015"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Think we're good <@U06DFL7BP> but thank you for offering!",
        "ts": "1445999654.000016"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "OK",
        "ts": "1445999674.000017"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "For future reference, if we need it: <https:\/\/mckenziechris.wordpress.com\/2015\/07\/13\/how-to-use-sketchup-with-google-cardboard-on-android\/>",
        "attachments": [
            {
                "service_name": "Doors Marked Pull",
                "service_url": "http:\/\/mckenziechris.wordpress.com",
                "title": "How to Use Sketchup with Google Cardboard on Android",
                "title_link": "https:\/\/mckenziechris.wordpress.com\/2015\/07\/13\/how-to-use-sketchup-with-google-cardboard-on-android\/",
                "author_name": "Chris McKenzie",
                "author_link": "https:\/\/mckenziechris.wordpress.com\/author\/mckenziechris\/",
                "thumb_url": "https:\/\/i0.wp.com\/mckenziechris.files.wordpress.com\/2015\/07\/two-sided-faces1.png?fit=200%2C150",
                "thumb_width": 200,
                "thumb_height": 136,
                "text": "Near the end of this year, one of my students brought Google Cardboard to our English class. When class was over, a few students and I were trying it out. Cardboard had been on my to-try list for a while, and now, but after trying it out that day, I ordered it right away.\nOne of the first things I thought of doing was getting it to work with Sketchup. I also teach an ICT course, and my students use Sketchup to design 3D buildings and rooms. I suppose I could argue that there is some pedagogical value in having the students experience their work in a more realistic fashion, but who would I be kidding? I really only wanted to import Sketchup models into a virtual reality environment because it’d be cool and fun.\nI came across 3d model viewer for cardboard. There is a bit of documentation with it, but I found that I still had to tinker around and figure some things out myself, so I thought I’d make a set of instructions to help out others.\nThe viewer isn’t perfect. At times, there are gaps in the models. At other times, the shapes themselves can be distorted. I also found that flat shapes tend to flicker and not show up well, if at all. You will also notice that the app flipped everything horizontally. I have come across a possible fix for this in the comments for the app, but it seems a bit annoying to do. I may try it out at some point, though. I’m still playing around with with the app, so I’ll update this post as I learn more or as the app updates and works even better.\nYou may have trouble using this app with large files. I found that a 50 mb file is about the largest that will load on my phone, and even that can be hit or miss. You’ll need to try out different file sizes of your own to see what you phone’s limit is.\nI am running Sketchup Pro 2015 on a Mac. The app is 3d model viewer v .54, and it is running on a Nexus 5 running Lollipop.\nUnfortunately, I am not an expert with the app or with Sketchup, so I may not be able to answer questions.\nIf anyone has any tips to make things work even better, please let me know.\nFinally, I would like to thank the developer of 3d model viewer, Hedgefundapps.\nInstructions\n1. Download 3d model viewer for your Android phone.\n2. Open Sketchup, and open or create a model. For the better results, try not to layer 2D shapes on top of each other. For instance, if you have a 2D carpet, it will not show up well if it is resting directly on the floor. In the sample model in the videos below, I had a floor drawn directly on top of a circular moat. In order for the floor to show, I had to give it a very slight bit of height to make it three dimensional instead of two dimensional.\n3. In Sketchup, go to “File”, “Export”, and “3D model”. Make sure you are exporting an .obj file. Before you click, “Open”, or “Okay”, or whatever the button says, you need to do one more thing or else the textures won’t show up. You need to go to “Options”. (It may be called something else in different versions. I’m not sure.) Then make sure you check “Export two-sided faces”. Now most of your textures should show up fine. Go ahead and export the file.\n\n\n4. Now, go to the folder on your computer that contains the .obj file. In that folder you should see an .obj file, an .mtl file, and a folder with any textures (in .png and .jpg formats) that may be associated with the model. The .skp files may or may not be there, depending on where you’ve exported your .obj to. I don’t think the .skp files are needed from now on, either.  It will look something like the image below.\n\n5. What you need to do now is move your .obj and .mtl files into the same folder as all of the texture files. Everything needs to be in one folder.\n6. I’m not sure if everyone needs to do this step, but without it, my models would not show any texture. If your models do not show any texture, the developer says to do the following: “If textures aren’t loading check that the paths in the .mtl file contain no special characters.Try toggling the smoothing option.” However, I’ve found that a different step seems to work for me:\n6a. Use a text editor to open the .mtl file.\n6b. Look for any parts that say, “map_Kd” followed by the folder and texture name.\n\n6c. Because the .mtl file is in the same folder as the textures, I don’t think you need to have the folder name anymore. When I got rid of the folder names, the textures worked much better in the app. So, for instance, I changed the line from “map_Kd Castle3\/Vegetation_Grass_Artificial_Yellow.png” to “map_Kd Vegetation_Grass_Artificial_Yellow”. Then, go through and change this whenever you see a “map_Kd” line. The find\/replace function really helps here.\n\n7. Now you need to upload the entire folder into the “3Dmodels” folder on your phone. I like using AirDroid to transfer files, but you can use whatever works for you. The image below shows what the folders now look like on my phone.\n\n8. On your phone, run “3d model viewer”, and put your phone into your Google Cardboard set.\n9. To use the viewer, aim the crosshairs at the menu items, and let the crosshairs sit on the on-screen button for a second in order to select it. I like to turn off the backgrounds because I find them distracting. Then, move the crosshairs over the folder and then the file name to open the model. Sometimes the model can take a while to open.\n10. When you are in the model, you can look at the feet to turn on walking, and you can look at them again to turn off walking. Or, you can use the magnet on the side of Google Cardboard to toggle walking on and off. In some places on the screen, you will see up and down arrows. Move the crosshairs over those to move your point-of-view up and down.\n11. When you want to go to the menu, look down at your feet to see the “menu” button.\nVideos for Comparison\nI’ve created three videos so that you can see how a simple model I made looks in Sketchup and how it looks when run in the 3d model viewer program. I’ve also created a third video to show you what the “Diorama” mode looks like in the program. Keep in mind that even though the second and third videos show only 2D images, the model viewer does show your model in 3D when you look at it in Google Cardboard.\nHave fun!\nRecording of the Original Castle Model\n\n3d model viewer on Android Phone\n\n3d model viewer in Diorama Mode",
                "fallback": "Doors Marked Pull Link: How to Use Sketchup with Google Cardboard on&nbsp;Android",
                "from_url": "https:\/\/mckenziechris.wordpress.com\/2015\/07\/13\/how-to-use-sketchup-with-google-cardboard-on-android\/",
                "id": 1
            }
        ],
        "ts": "1446008441.000018"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "Some general info about viewing 3D models in general in there as well.",
        "ts": "1446008466.000020"
    }
]