[
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "i’ll skip stand up today. you know where to find me during the day :slightly_smiling_face:",
        "ts": "1463415797.000080"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "cool",
        "ts": "1463418045.000081"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!here|@here>: stand up",
        "ts": "1463418048.000082"
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "Still waiting on train",
        "ts": "1463418372.000083"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "its cool, we wrapped super quick.  <@U0J6TE0CA> feel free to swing by when in if you have any quesitons or needs.  otherwise, i think you can just jump in.  <@U02E3CRMA> lets connect when ya get a minute just so you dont have to rely on your inbox to catch up :slightly_smiling_face:",
        "ts": "1463418423.000084"
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": ":+1:",
        "ts": "1463418451.000085"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!here|@here>: in lieu of standup, wanted to share out the latest project ebb\/flow updates that I share live:\n - we’ve got final stakeholder, final creative feedback coming our way by noon.  more to come on this!\n - we’re only working with one verison of YT trends now (client hasnt seen yet, I’ll send in reply to our response to their feedback)\n - client will NOT be in office on Thursday for Beta.  Beta will now either be handled as a GVC or live video record.\n - Super good news!  IonTank is planning to have wall built, motors programmed, screens calibrated, screens positioned and a version of software running on head node all before we arrive!  While this is ambitious it positions us well for Beta.  \n - AE\/Dev workflow: We will try to use CSS3 for Top Sweep animations. We should be able to achieve a vast majority of the desired animation. what we cars most about is the relationship between shapes, how the move, when they move, ramp etc. if we ever see an object thats moving, scaling and rotating all at same time, we can stagger them so it moves and scales and then rotates. which i think give you the flexibility you need in bodymoving\/css3 and snapsvg.\n- booking travel for Bryan, Peter, Joel, Jason and Justin for Bet ain Pittsburg 6\/12-6\/17",
        "ts": "1463420703.000086"
    },
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "Alpha not beta",
        "ts": "1463420819.000087"
    },
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "for thursday",
        "ts": "1463420835.000088"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "coorect <@U0EL0GLEL> sorry, silly typo",
        "ts": "1463420846.000089"
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "Thanks for the update Dennis! And documenting this in Trello",
        "ts": "1463421005.000090"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!here|@here>: we have client feedback on creative.  gonna start an email chain for visibility and try to get us together tomorrow AM.",
        "ts": "1463422218.000091"
    }
]