[
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "was just thinking more about the sweep or transition action. And this system would support that quite well. I will add an object to the template system to support that. Since all the cubbies exist on one template display buffer, some form of animation could be done across the full breadth of the cubby displays. These animations could be a video file that runs, or we could test doing some css animations. I think we have decent flexibility here. The display really is just a web page running some fancy javascript",
        "ts": "1457116905.000002"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "nice!",
        "ts": "1457116934.000003"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "I think this could be SUPER useful for things like “quiet” modes too",
        "ts": "1457116950.000004"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U0260V4K1>: and @joel I just got off the phone with planar to update em on what we're doing and talk about resources they have at their disposal that we may be able to tap into. Would either of you have time to go to beavetron for an hour on Wednesday morning with me?  We can suspect that for 20 min they will try to sell us on something but I think they'll help us evaluate our equipment, show us lab and talk testing options. ",
        "ts": "1457119369.000005"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U02E3CRMA>:  \/\\\/\\",
        "ts": "1457119383.000006"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "yeah, I can do that. we ave all-hands that day, so it would be great to plan around that, but generally: yeah, that sounds terrific.",
        "ts": "1457119632.000007"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Ok I'll add to calendar this wknd. Will def be back for all hands. ",
        "ts": "1457119695.000008"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "I’m in",
        "ts": "1457120966.000009"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "FWIW, I doubt we’ll get the sell job based on past experiences with them. We can always head it off by dropping that we’re sending a ~$100K order their way. :simple_smile:",
        "ts": "1457121044.000010"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": ":simple_smile:",
        "ts": "1457121491.000011"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Agree but just got the sell on something on  a 30 min call. All good. ",
        "ts": "1457121763.000012"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "ha",
        "ts": "1457121861.000013"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "at least they know we’re worth selling to?",
        "ts": "1457121871.000014"
    }
]