[
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "<http:\/\/firstround.com\/article\/Spotifys-Design-Lead-on-Why-Side-Projects-Should-be-Stupid>",
        "attachments": [
            {
                "title": "Spotify’s Design Lead on Why Side Projects Should Be Stupid",
                "title_link": "http:\/\/firstround.com\/article\/Spotifys-Design-Lead-on-Why-Side-Projects-Should-be-Stupid",
                "text": "Tobias van Schneider lives his life like one big side project. Today, he designs and builds new products for Spotify in New York, but he couldn’t have predicted that when he dropped out of school at age 15 to work as an apprentice in a computer shop in Austria. He couldn't have predicted that when he applied to graduate schools and design schools and was told repeatedly that he didn't have enough training or talent to build a career. He couldn't have predicted that even when he turned his side passion for visual and product design into a full-time job by opening up his own studio. He didn't know what to expect. But from that point on, side projects have marked his path like bread crumbs, leading him to where he is today. As van Schneider was growing up, teaching himself new skills after work and on weekends, the idea of “side projects” became a foundational myth in the tech world. Products like Gmail, Craigslist, and even Post-Its can trace their roots back to work discovered and developed on the side. As a result, hackathons and other strategies have become standard practice at large companies and even startups to bottle this spirit and keep technical talent engaged. This is great, van Schneider says, but not if it becomes a cliche. His argument: In order for side projects to truly succeed, they have to be stupid. Here’s what he means, and how it can help your company stay creative and competitive: ",
                "fallback": "Spotify’s Design Lead on Why Side Projects Should Be Stupid",
                "thumb_url": "http:\/\/frcs3.s3.amazonaws.com.global.prod.fastly.net\/library\/mainImage\/tobias-hero.jpg",
                "from_url": "http:\/\/firstround.com\/article\/Spotifys-Design-Lead-on-Why-Side-Projects-Should-be-Stupid",
                "thumb_width": 1800,
                "thumb_height": 634,
                "id": 1
            }
        ],
        "ts": "1403210947.000002"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Nice read. Been following Tobias for some time and his stuff is fresh.",
        "ts": "1403211405.000004"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Bull or Coaster",
        "ts": "1403211432.000005"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "is still pretty stupid...",
        "ts": "1403211447.000006"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "YES.",
        "ts": "1403211462.000007"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "So either my machine doesn't feel like cooperating today or InDesign CC 2014 suuuuuuucks.",
        "ts": "1403211551.000008"
    }
]