[
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "40min documentary on Zeldman and the early days of web design <http:\/\/vimeo.com\/104641191>",
        "attachments": [
            {
                "service_name": "Vimeo",
                "service_url": "https:\/\/vimeo.com\/",
                "title": "Jeffrey Zeldman: 20 years of Web Design and Community",
                "title_link": "http:\/\/vimeo.com\/104641191",
                "author_name": "lynda.com",
                "author_link": "http:\/\/vimeo.com\/lyndavimeo",
                "thumb_url": "http:\/\/i.vimeocdn.com\/video\/487242703_295x166.jpg",
                "thumb_width": 295,
                "thumb_height": 166,
                "text": "Watch more documentaries like this at <http:\/\/lynda.com\/vimeo|lynda.com\/vimeo>.\n\nWho is Jeffrey Zeldman? The \"Miles Davis of web design\"? \"Godfather of the web\"? Or simply \"your friend on the Internet\"? For people who make websites, Zeldman is all of these and more. He's been a guiding voice in web design since the earliest days of the Internet, leading the charge in the fight for web standards. He's an educator whose businesses—A List Apart, An Event Apart, and A Book Apart—are extensions of his basic instinct to share his best ideas. He's also a community leader that other designers look to for inspiration. This film is an intimate portrait of a man who has helped shape the web but isn't recognized by most of the people who use it everyday. Learn how he evolved his influential mailing list, how he convinced Netscape and Internet Explorer to support HTML and CSS, and what he's doing to pass the torch to the next generation.",
                "fallback": "Vimeo Video: Jeffrey Zeldman: 20 years of Web Design and Community",
                "video_html": "<iframe src=\"\/\/player.vimeo.com\/video\/104641191\" width=\"400\" height=\"225\" frameborder=\"0\" title=\"Jeffrey Zeldman: 20 years of Web Design and Community\" webkitallowfullscreen mozallowfullscreen allowfullscreen><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "from_url": "http:\/\/vimeo.com\/104641191",
                "id": 1
            }
        ],
        "ts": "1409851865.000002"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "thanks for sharing this. No time to watch now, of course, but will check it out",
        "ts": "1409853484.000004"
    }
]