[
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "<http:\/\/anna.vc\/post\/112863438962\/how-to-think-using-visual-analogies>",
        "attachments": [
            {
                "service_name": "Anna Vital",
                "service_url": "http:\/\/anna.vc\/post\/112863438962\/how-to-think-using-visual-analogies",
                "text": " How To Think Visually Using Visual Analogies Most research in cognitive science explores how we see things but little research is done on how we understand what we see. Understanding is the ultimate test of how good your visualization is. So how can you make people understand? Show something familiar and analogize. If you know nothing else about visualization but pick the right analogy you are more than half way there. This is what a professional designer does - and there is no substitute for analogies. How do you choose the right analogy? In this grid I organized analogies from the abstract down to the more detailed. I grouped them by similarity in shape. The goal is to enable you to quickly see the possibilities and “try them on” your information. With time you’ll be able to do all of this in your head. But for now this is a shortcut.  Let’s start simple and abstract. Charts, graphs, and diagrams Let’s start with circular shapes.  (Most things in the universe are round!) 1. Pie Chart. The most popular and criticized. As Edward Tufte says, “…the only thing worse than one pie chart is lots of them”.  The father of modern infographics, Otto Neurath, also rejected pie charts in favor on the more semantic iconographics. Pie charts are best used when divided into two segments:  pie I’ve eaten and pie I have left.  With two segments you can still easily compare the slices in size - something that becomes difficult with more than two, hence the criticism.  Once you have three or more segments you have a comparison problem - our eyes are not used to comparing segments of a circle. We also are bad at comparing different pie charts. That leaves very few cases where a pie chart still works. Example: I used it in “What Do 7 Billion People Do” graphs and in How Startup Funding Works showing the founder equity pie. 2. Venn Diagram. Here is another popular and misused analogy. One thing it does well - show overlap of two to three things. What it does not do well is show how large that overlap is. This diagram is better used when all you need to show is the overlap and nothing else, no data.  Example: I used it to visualize “The Anatomy Of determination” as a composition of 3 qualities: willfulness, discipline and ambition. 3. Concentric diagram. This is an onion sliced sideways. In the middle is the most important thing, or the purpose of something. The importance should decrease going outward with every layer. Example: I used it in ",
                "fallback": "Anna Vital: ",
                "image_url": "http:\/\/41.media.tumblr.com\/529745a561e0db531c9ab8d0e277923f\/tumblr_nkpo963N3I1s95gluo1_r6_500.png",
                "from_url": "http:\/\/anna.vc\/post\/112863438962\/how-to-think-using-visual-analogies",
                "image_width": 123,
                "image_height": 250,
                "image_bytes": 160795,
                "id": 1
            }
        ],
        "ts": "1448408763.000002"
    }
]