[
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "i agree with the sentiment of the article, if not the finer points. and as a macintosh fan girl i am mostly fascinated with Tog (as a human, who can totally own apple nostalgia) and Donald Norman (as a true, respected, expert) ganging up on Apple in such a brutal and public way.",
        "ts": "1447335602.000002"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "so maybe this is totally my personal version of TMZ.",
        "ts": "1447335646.000003"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": ":thinking_face:",
        "ts": "1447335666.000004"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "I'm with you on being fans of both tog and Norman (which is a little why I found this article so surprising) - but I think their underlying thesis that Mac was\/is this oasis of easy, accessible, discoverable computing holds up",
        "ts": "1447337380.000005"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Just on its face, when one considers the depth to which iOS and its design patterns have infiltrated not just design culture, but culture at large, seems to indicate they got something right. Especially given that it's only existed for 7 years.  ",
        "ts": "1447337553.000006"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "But the idea that Mac OS is somehow more usable - including for the disabled -that iOS just seems laughable. I'd wager that  given 100 people new Mac and iOS, 100 of them will be able to more, more quickly on iOS than in Mac. ",
        "ts": "1447337692.000007"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Almost every interaction the article points to as being intuitive, or obvious - undo, menu functions, etc - are actually neither, and I'd submit only seem that way because we've had 30 years to get used to them. ",
        "ts": "1447337784.000008"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Anyway. I don't really have an opinion on the article and it totally did not keep me awake last night. ",
        "ts": "1447337834.000009"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": ":sunglasses:",
        "ts": "1447337838.000010"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "lol",
        "ts": "1447337920.000011"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "in other news... john maeda is on my flight to SFO",
        "ts": "1447337950.000012"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "random note - I do think the lack of affordances in the newer mobile interaction paradigms is a massively faulty solution and thusly makes Mac OS more obvious at a basic level. 'intuitive' may be semantically pushing it, but can't we all agree that shake-to-undo is a travesty?",
        "ts": "1447338250.000013"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Well yes, shake to undo is among the multitude of travesties on iOS. ",
        "ts": "1447338429.000014"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Which is this is part of why I was so let down by this article. ",
        "ts": "1447338448.000015"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": ":relaxed:",
        "ts": "1447338480.000016"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "There is SO MUCH to critique on not just iOS, but mobile interaction models in general",
        "ts": "1447338488.000017"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "But I think that by asserting \"Apple is destroying design\" the article undermines nearly all of its credibility. Which is tough given the authors",
        "ts": "1447338555.000018"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "yes. but apple lead the way. and I do think with iOS7 they prioritized for over function to the detriment of all of us",
        "ts": "1447338578.000019"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "we cannot blame apple for the decline of western civilization... but I hesitate to hold them up as the design leaders in our industry as I did... for... years.",
        "ts": "1447338688.000020"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Id agree with that. But still feel that on the whole, iOS - even version 7 - is a stunning display of highly functional design. When you step back and consider the complexity of activity it allows us to relatively simply, it's a miracle it works at all",
        "ts": "1447338688.000021"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Which again, isn't to say there are miles of road for very serious critique. ",
        "ts": "1447338714.000022"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Because there are. ",
        "ts": "1447338720.000023"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "I guess I see this article as a bit of a warning. and I hope Apple listens... because they are trending downward.",
        "ts": "1447338808.000024"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "And I'd assert that Apple is in fact leading the way in helping us to navigate some really very complex personal and social changes in the way people relate to, interact with, and understand what a computer is",
        "ts": "1447338816.000025"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "they did. but I think that came to fruition 3-5 years ago. now they risk eroding that value. and nothing recently has evolved our understanding of computing. (um... iPad pro?)",
        "ts": "1447338935.000026"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Oh, I agree, the trend is really worrying. I'd just have hoped that someone with Normans background could have taken a step back and addressed the issue in a less \"I figured all this out 30 years ago\"\/\"kids these days\" way",
        "ts": "1447338975.000027"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "lol. get off his lawn!",
        "ts": "1447339002.000028"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "True, but just the fact the we can say \"they only fundamentally changed computing 3 years ago, what about now?\" Says a lot about how quickly we expect them to evolve their thinking. ",
        "ts": "1447339053.000029"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "ok. takeoff. :blush::airplane_departure:",
        "ts": "1447339053.000030"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Dammit!",
        "ts": "1447339060.000031"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "More conversation about design!!!",
        "ts": "1447339070.000032"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Okay - well have fun at BL, and thanks again for not just sharing, but for the conversation!",
        "ts": "1447339103.000033"
    },
    {
        "type": "message",
        "user": "U02F9CXTL",
        "text": "Cool fella - \n<http:\/\/motionographer.com\/2015\/09\/17\/watching-glean-keane-draw-in-virtual-reality-is-amazing\/>",
        "attachments": [
            {
                "service_name": "Motionographer",
                "title": "Watching Glean Keane draw in virtual reality is amazing",
                "title_link": "http:\/\/motionographer.com\/2015\/09\/17\/watching-glean-keane-draw-in-virtual-reality-is-amazing\/",
                "text": "Legendary animator Glen Keane is famous for his work on Disney classics like Beauty and the Beast, Aladdin and Pocahontas. Despite his notoriety as a traditional animator earned by spending thousan…",
                "fallback": "Motionographer: Watching Glean Keane draw in virtual reality is amazing",
                "thumb_url": "http:\/\/i1.wp.com\/motionographer.com\/wp-content\/uploads\/2015\/09\/GlenKeane-FullRev.jpg?resize=1200%2C670",
                "ts": 1442495588,
                "from_url": "http:\/\/motionographer.com\/2015\/09\/17\/watching-glean-keane-draw-in-virtual-reality-is-amazing\/",
                "thumb_width": 1200,
                "thumb_height": 670,
                "id": 1
            }
        ],
        "ts": "1447369472.000002"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Just watched this video with a student in class today to influence a cool idea he’s doing for his experimental project.",
        "ts": "1447371626.000004"
    }
]