[
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "<!channel>: Has anyone messed around with this prototyping tool\n\n<http:\/\/www.invisionapp.com\/>\n\nWe need to send out some design homework for interns and I'm looking for a replacement for Field Test.",
        "ts": "1424196980.000002"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I think this is the one Melissa was telling me about a while back. She may know some things about it.",
        "ts": "1424197045.000003"
    },
    {
        "type": "message",
        "user": "U02F9CXTL",
        "text": "Its pretty rad. Only used it once though.",
        "ts": "1424197206.000004"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Not sure if it's hitting the same needs for what you're looking for, but when I did some research into prototyping software, I found I most enjoyed <http:\/\/pixate.com|pixate.com>, it's a layer based prototyping tool that you can essentially assign transitions\/gestures to individual assets that you place into your project... rather than drawing hit zones on top of static comps. Worth a look, I'd say.",
        "ts": "1424197312.000005"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I think it's smartphone app specific though.",
        "edited": {
            "user": "U026E0ZNR",
            "ts": "1424197389.000000"
        },
        "ts": "1424197339.000006"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Awesome. Thanks guys. I think I want to keep it as simple and basic as possible, which probably means static comps + hot spots. That's what was great about Field Test.",
        "ts": "1424197958.000008"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Invision is probably a safe bet then. I think I may have actually used it myself in my search. It's pretty straightforward. I just remember feeling limited for what I wanted to do with it. But for comp-based prototyping I think it's a nice tool.",
        "ts": "1424198305.000009"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Perfect. Looks like they have a killer help section too. I just want these kids to be able to create cool stuff without getting too into the weeds.",
        "ts": "1424198533.000010"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Don't give them Quartz Composer then.",
        "ts": "1424198612.000011"
    },
    {
        "type": "message",
        "user": "U02HCCTFL",
        "text": "I've used invision a ton in the past. Great tool",
        "ts": "1424198617.000012"
    }
]