[
    {
        "type": "message",
        "user": "U1A1A9L7N",
        "text": "<https:\/\/techcrunch.com\/2016\/06\/16\/zeiss-vr\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "Zeiss made a really premium Google Cardboard headset",
                "title_link": "https:\/\/techcrunch.com\/2016\/06\/16\/zeiss-vr\/",
                "author_name": "Brian Heater",
                "thumb_url": "https:\/\/i1.wp.com\/tctechcrunch2011.files.wordpress.com\/2016\/06\/p6150200.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 150,
                "text": "Google Cardboard&amp;rsquo;s biggest appeal has always been its accessibility. Heck, they send the headsets out with the newspaper. Zeiss is taking things in a different direction with the One Plus (not to be confused with the less spacey OnePlus), a $129 VR headset for smartphones that features a premium build and, naturally, the company&amp;rsquo;s high-end optics.\nThe wearable features a tray that accommodates smartphones between 4.7 and 5.5 inches, courtesy of an adjustable system that holds the handset in place. The One Plus&amp;nbsp;also features a lot of padding, making it comfortable for long, battery draining sessions.\nThe key, of course, are those lenses, which offer up a sharp image without requiring any focal adjustment. They also do a solid job of removing the distortion around the edges of the images that you often get with similar devices. It&amp;rsquo;s certainly one of the better Google Cardboard experiences I&amp;rsquo;ve had thus far.\n The headset ships with a cube that offers a neat augmented reality experience (which utilizes the phone&amp;rsquo;s unobstructed camera, serving as a sort of proof of concept for app developers. The One Plus&amp;nbsp;is compatible with Android and iOS devices, and the company is talking up a DJI app that offers a first-person experience from the drone. The company is also working on compatibility with Google&amp;rsquo;s Daydream.\nIt&amp;rsquo;ll hit retail in August.",
                "fallback": "TechCrunch Link: Zeiss made a really premium Google Cardboard&nbsp;headset",
                "from_url": "https:\/\/techcrunch.com\/2016\/06\/16\/zeiss-vr\/",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/techcrunch-2013\/assets\/images\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1466110740.000021"
    }
]