[
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "<http:\/\/www.fastcodesign.com\/3062242\/terminal-velocity\/virgin-americas-new-app-puts-a-travel-agent-in-your-pocket>\n\nAlways loved the pacing and design of the website. Seems like they captured more of that in the mobile app experience too. The choose a seat page is p great.",
        "attachments": [
            {
                "service_name": "Co.Design",
                "title": "Virgin America's New App Puts A Travel Agent In Your Pocket",
                "title_link": "http:\/\/www.fastcodesign.com\/3062242\/terminal-velocity\/virgin-americas-new-app-puts-a-travel-agent-in-your-pocket",
                "text": "The airline's new app by Work &amp; Co launches in beta this week.",
                "fallback": "Co.Design: Virgin America's New App Puts A Travel Agent In Your Pocket",
                "image_url": "http:\/\/b.fastcompany.net\/multisite_files\/fastcompany\/imagecache\/slideshow_large\/slideshow\/2016\/07\/3062242-slide-1-virgin-americas-new-app-puts-a-travel-agent-in-your-pocket.jpg",
                "ts": 1469703600,
                "from_url": "http:\/\/www.fastcodesign.com\/3062242\/terminal-velocity\/virgin-americas-new-app-puts-a-travel-agent-in-your-pocket",
                "image_width": 416,
                "image_height": 250,
                "image_bytes": 36334,
                "service_icon": "http:\/\/www.fastcodesign.com\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1469715695.000071"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "Interesting that they just launched that considering the acquisition. Maybe some of their tech will find its way to Alaska",
        "ts": "1469716667.000073"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Didn't work and co do their site? ",
        "ts": "1469717188.000074"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Yeah - they did the app too",
        "ts": "1469719252.000075"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "I'm not sure how much of this is going to get to Alaska though. From what I know this was a major push my w&amp;co + some people at Virgin just to get it out because they'd put so much into it. ",
        "ts": "1469719327.000076"
    },
    {
        "type": "message",
        "user": "U1A1A9L7N",
        "text": "Alaska def needs some brand love ",
        "ts": "1469719443.000077"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "ah, that makes sense justin",
        "ts": "1469722946.000078"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Apparently Alaska feels like they 100% do NOT need brand help, and that people LOVE the Alaska brand as much, if not more than Virgin. ",
        "ts": "1469723004.000079"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "i actually really do like alaska but from a branding perspective it’s not even close, they’d be dumb to flush all that great virgin work down the toilet",
        "ts": "1469723107.000080"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "<https:\/\/blog.alaskaair.com\/alaska-airlines\/who-is-the-eskimo\/>",
        "attachments": [
            {
                "service_name": "Alaska Airlines Blog",
                "service_url": "http:\/\/blog.alaskaair.com",
                "title": "The story of the Eskimo: Who is on the tail of Alaska Airlines’ planes?",
                "title_link": "https:\/\/blog.alaskaair.com\/alaska-airlines\/who-is-the-eskimo\/",
                "author_name": "Halley Knigge, Staff Writer & Level 16 Pokémon Trainer",
                "author_link": "https:\/\/blog.alaskaair.com\/author\/ashknigge\/",
                "thumb_url": "https:\/\/i1.wp.com\/alaskaairblog.files.wordpress.com\/2016\/01\/alaska-airlines_t3_0400.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 133,
                "text": "To five-year-olds in Kotzebue, Alaska (and Internet surfers round the world), the question of just whose face adorns the tails of Alaska Airlines 737s is a heated one. It is an oft-asked&amp;nbsp;question about the Seattle-based airline, but the truth is anything but simple.\n\n&amp;ldquo;When I was a little kid, we all thought it was our own grandfathers,&amp;rdquo; says former Kotzebue mayor Maija Lukin. &amp;ldquo;We all thought it was our tata. Even if it didn&amp;rsquo;t remotely look like our grandfathers.&amp;rdquo;\nWhile the argument of whose grandfather served as inspiration for Alaska&amp;rsquo;s iconic paint scheme may be&amp;nbsp;lighthearted, its meaning is profound. For residents of Kotzebue, a 3,200-person city some 30 miles north of the Arctic Circle, and the 15 other cities inaccessible by road that Alaska serves throughout the state, air service is vital. In Barrow, North America&amp;rsquo;s northernmost city, residents joke that before construction on the city&amp;rsquo;s new hospital was completed in 2013, if you were sick, &amp;ldquo;you didn&amp;rsquo;t call the hospital &amp;ndash; you called Alaska Airlines.&amp;rdquo;\nClick to enlarge map\nAlaska Airlines is embedded into the fiber of the communities it serves in the harsh, breathtaking state of Alaska in a way that can&amp;rsquo;t be replicated in the 71 destinations it serves in the lower 48. In Alaska, the airline brings the mail, the groceries and the medicine. And because it is so vital, the face on the tail represents more than just a logo. It means safety, family, community, home &amp;ndash; and, more often than not, a grandfather, uncle or family friend.\n&amp;ldquo;When I see that face, I feel proud. I feel like I&amp;rsquo;m home,&amp;rdquo; says Sallee Baltierra, a concierge in Alaska&amp;rsquo;s Anchorage Board Room airport lounge. &amp;ldquo;I love to see that Eskimo on the tail in other cities that we fly to, from Liberia, Costa Rica to Nashville, Tennessee. It makes me feel like there&amp;rsquo;s a little piece of home there waiting for me.&amp;rdquo;\n\nLooking back\nAlaska&amp;rsquo;s iconic Eskimo first appeared in the skies in the early 1970s, but the airline&amp;rsquo;s history goes back much further.\nThe company was born in 1932 when Linious &amp;ldquo;Mac&amp;rdquo; McGee started flying his three-passenger Stinson from Anchorage to Bristol Bay. Two years later, McGee Airways merged with Star Air Service and became the largest airline in the state, with 22 airplanes. After another decade, and several more mergers, the airline found the name that stuck: Alaska Airlines.\nThe Eskimo first appeared in 1972, when Alaska adopted a four-logo paint scheme &amp;ndash; a totem pole, to represent the native culture of Southeast Alaska; a gold miner, to represent the booming gold rush days in Alaska; Russian spires, to represent early Russian heritage in the state of Alaska; and a native Alaskan adorned in a traditional qulittaq (parka with ruff) to represent the Arctic region and its people. Indigenous Alaskans in the Arctic, traditionally of Inupiat or Yupik descent, commonly refer to themselves as Eskimo.\n&amp;ldquo;I am from Northwest Alaska. For many of us from that part of the world, there has been a sense of pride and a feeling that Alaska Airlines is acknowledging our identity with the display of the Eskimo on the tail of their aircraft,&amp;rdquo; says Helvi Sandvik, a director of the Alaska Air Group board and president of NANA Development Corp., an Alaska Native corporation.\nInfographic:&amp;nbsp;Alaska by the decades\nThese four liveries adorned Alaska&amp;rsquo;s jets from 1972 until 1976, when the company adopted the Eskimo tail fleet-wide, and updated the face to be less stern.\nThe adoption of the four-logo scheme was a bold move for an airline in 1972, and a drastically different look for the 50-year old company.\n&amp;ldquo;I remember this distinctly,&amp;rdquo; recalls Alaska retiree and company archivist Ron Suttell, of the first time he saw the Eskimo. &amp;ldquo;I was a freight agent in Juneau and I was just getting off shift one night. I went over to a familiar airport watering hole after work and looked over at where the airplanes were parked. It created quite a stir.&amp;rdquo;\n       The Eskimo was first introduced in 1972 as one of a set of four liveries featuring iconic images from the state of Alaska. The earliest design featured a stern Eskimo and the word Alaska written in black block letters.                             \nSuttell started at the company in 1971, during a turbulent period for the airline. It struggled with a messy operation (late bags, delayed and canceled flights), a poor reputation and a cash flow problem.\nThe introduction of the four logos, and with them, the Eskimo, heralded big changes for the airline: new leadership, better financial oversight and a renewed focus on its operation and its customers.\n&amp;ldquo;Putting such a bold visual statement on our airplanes was really pretty astounding at the time, but it didn&amp;rsquo;t take long to grow on you that what we were doing was really exciting,&amp;rdquo; said Suttell. &amp;ldquo;That was really the start of the journey to becoming the airline we are today.&amp;rdquo;\nWith the exception of a few color tweaks, the smiling Eskimo from 1976 has remained more or less unchanged for four decades, although discerning eyes will notice that many of the tails don&amp;rsquo;t quite match. In the early days, airplane liveries were hand-painted, and tales abound of maintenance employees who would give the Eskimos they painted a signature twist to set them apart when spotted.\nIn January 2016, Alaska unveiled its first major brand update in a quarter century, smoothing and modernizing the Eskimo for the digital age and adding invigorating pops of color around his ruff.\n&amp;ldquo;It&amp;rsquo;s not meant to be a massive change,&amp;rdquo; said Sangita Woerner, Alaska&amp;rsquo;s vice president of marketing. &amp;ldquo;It&amp;rsquo;s the same person, the same symbol &amp;ndash; but he is bigger, bolder and more impactful.&amp;rdquo;\n       The Eskimo was first introduced in 1972 as one of a set of four liveries featuring iconic images from the state of Alaska. The earliest design featured a stern Eskimo and the word Alaska written in black block letters.       The other three designs were retired after several years, and the face on the tail was given a smile and applied to the rest of Alaska&amp;rsquo;s fleet.          From the mid-1990s on, Alaska jets featured the airline&amp;rsquo;s most recognizable livery, still flying on many of its jets today.       In early 2015, a handful of Alaska jets were repainted with an interim refreshed design. The letters in the wordmark were smoothed out and the extended leg of the &amp;ldquo;K&amp;rdquo; in Alaska was lowered.          In January 2016, Alaska Airlines revealed the most substantial updates to its brand in a quarter century, streamlining its wordmark and adding pops of color around its iconic Eskimo tail design.       \nBut who is it?\nMore than 40 years after the Eskimo first appeared, Alaska&amp;rsquo;s reservations agents still take calls on weekend nights from groups of giggling friends who want to know: &amp;ldquo;Hey, we have a bet going &amp;ndash; who IS that guy on the tail?&amp;rdquo;\nCommon theories over the years have included Jimi Hendrix, Abraham Lincoln, Bob Marley, a lion and Johnny Cash.\nBut two of the most popular involve two very real people: native Alaskans Chester Seveck and Oliver Amouak.\nSeveck was an Eskimo dancer and reindeer herder in Kotzebue, who used to greet incoming Alaska Airlines flights with his wife. While residents of Kotzebue and many of Alaska&amp;rsquo;s customers and employees firmly believe that Seveck&amp;rsquo;s face adorns Alaska&amp;rsquo;s jets, many others believe it is Amouak, an Inupiat Eskimo who was hired by Alaska in the late 1950s to perform in a traveling stage show called &amp;ldquo;It…",
                "fallback": "Alaska Airlines Blog Link: The story of the Eskimo: Who is on the tail of Alaska Airlines&#8217;&nbsp;planes?",
                "from_url": "https:\/\/blog.alaskaair.com\/alaska-airlines\/who-is-the-eskimo\/",
                "service_icon": "https:\/\/secure.gravatar.com\/blavatar\/f36513d676489d9b6ae10b0466918ba5?s=114",
                "id": 1
            }
        ],
        "ts": "1469725616.000081"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "If anyone wants to know how thoroughly Alaska thinks about design ",
        "ts": "1469725631.000083"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "(no one even remembers who is on the tail image)",
        "ts": "1469725654.000084"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": ":neutral_face:",
        "ts": "1469725777.000085"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "for years i actually thought it was abe lincoln",
        "ts": "1469726459.000086"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "^ same lol",
        "ts": "1469726473.000087",
        "reactions": [
            {
                "name": "raised_hands",
                "users": [
                    "U0914MEN7"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U1A1A9L7N",
        "text": "Flying with an airline for me is definitely about the experience and service more than their visual branding, but Virgin has a great brand experience which says even more",
        "ts": "1469727760.000088"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I love Alaska Air.",
        "ts": "1469728770.000089"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "A small part of me thought the guy on the tail was Bob Ross, even though I know it’s not",
        "ts": "1469728790.000090"
    },
    {
        "type": "message",
        "user": "U1A1A9L7N",
        "text": "happy clouds",
        "ts": "1469728856.000091"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "<http:\/\/vecg.cs.ucl.ac.uk\/Projects\/projects_fonts\/projects_fonts.html>",
        "ts": "1469735500.000092"
    },
    {
        "type": "message",
        "user": "U1LL9K6BC",
        "text": "\"happy clouds\" sounds like an airline slogan in addition to bob ross ",
        "ts": "1469736087.000093"
    },
    {
        "type": "message",
        "user": "U1LL9K6BC",
        "text": "<http:\/\/www.fastcoexist.com\/3062107\/world-changing-ideas\/the-la-river-is-now-a-temporary-art-museum>",
        "attachments": [
            {
                "service_name": "Co.Exist",
                "title": "The L.A. River Is Now A Temporary Art Museum",
                "title_link": "http:\/\/www.fastcoexist.com\/3062107\/world-changing-ideas\/the-la-river-is-now-a-temporary-art-museum\/13",
                "text": "UnderLA makes the hidden nature of the city's water source more visible.",
                "fallback": "Co.Exist: The L.A. River Is Now A Temporary Art Museum",
                "image_url": "http:\/\/d.fastcompany.net\/multisite_files\/fastcompany\/imagecache\/slideshow_large\/slideshow\/2016\/07\/3062107-slide-5-the-la-river-is-now-a-temporary-art-museum.jpg",
                "ts": 1469529000,
                "from_url": "http:\/\/www.fastcoexist.com\/3062107\/world-changing-ideas\/the-la-river-is-now-a-temporary-art-museum\/13",
                "image_width": 375,
                "image_height": 250,
                "image_bytes": 60011,
                "service_icon": "http:\/\/www.fastcoexist.com\/favicon.ico",
                "id": 1
            }
        ],
        "edited": {
            "user": "U1LL9K6BC",
            "ts": "1469740035.000000"
        },
        "ts": "1469740026.000094"
    }
]