[
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "Thanks Trent",
        "ts": "1471531867.000270"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "Some smart home stuff. Logitech buttons. Looking like European Wall Switches. Wonder if you smartly can find them in between couch cushions. <http:\/\/www.logitech.com\/en-us\/product\/pop-home-switch>",
        "attachments": [
            {
                "title": "POP Home Switch Simple smart home control for the whole family",
                "title_link": "http:\/\/www.logitech.com\/en-us\/product\/pop-home-switch",
                "text": "Simple smart home control for the whole family",
                "fallback": "POP Home Switch Simple smart home control for the whole family",
                "from_url": "http:\/\/www.logitech.com\/en-us\/product\/pop-home-switch",
                "service_icon": "http:\/\/www.logitech.com\/apple-touch-icon.png",
                "service_name": "logitech.com",
                "id": 1
            }
        ],
        "ts": "1471532020.000271"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "<https:\/\/techcrunch.com\/2016\/08\/17\/logitech-pop-review\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "Logitech’s Pop really is the solution for smart home chaos",
                "title_link": "https:\/\/techcrunch.com\/2016\/08\/17\/logitech-pop-review\/",
                "author_name": "Darrell Etherington",
                "thumb_url": "https:\/\/i0.wp.com\/tctechcrunch2011.files.wordpress.com\/2016\/08\/logitech-pop-family.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 133,
                "text": "Smart home technology offers a lot of potential to make things generally easier, but in practice, it can add a lot of complexity and confusion to a person&amp;rsquo;s life &amp;ndash; especially if you really dive in. Logitech&amp;rsquo;s new Pop Home Switch tries to reverse the trend, delivery light-switch level simplicity for even the most sophisticated smart home setup. And it succeeds, turning connected home workflows into concerts you conduct, instead of noisy, confusing conflicts you have to endure.\nVideo review\n\t\n\t\t\n\t\t\nSmart homes kinda suck\nMy connected home began with a set of Phillips Hue lights, which quickly expanded into more Hue bulbs, and then to LIFX, a Harmony-managed home theater setup, a connected doorbell, Sonos speakers, some Belkin WeMo gadgets and more. Mixing lighting systems was probably my first mistake, but by the time Logitech&amp;rsquo;s Pop arrived for me to review, I was cycling through a variety of apps and remotes whenever I had to turn on the home theater setup to watch a movie &amp;ndash; or even when I wanted to do something as simple as go to bed.\nPart of my predicament was self-made, admittedly. There are ways to consolidate these various devices, including through my Harmony smart remote and Hub from Logitech, as well as through HomeKit with Siri on my iPhone. But in the end, due either to difficulty of setup, or inconsistencies in performance, or trouble executing the workflow consistently, all of these other options fell short.\nPop, plain and simple\n\nPop&amp;rsquo;s clear-eyed simplicity avoids any potential pitfalls, and has resulted in a smart home setup I finally feel comfortable with. Installing the hub involves only opening the app and plugging a small (by hub standards) brick directly into an available power outlet, and then following steps provided directly in the app itself. You connect the hub to your Wi-Fi network, it scans for compatible smart home devices (all of mine worked, though I had to add my Harmony hub manually to properly import my home theater activities and devices).\nWith everything automatically detected, it was easy to mix and match their states and activities and then assign those to specific Pop buttons. Adding Pops to the app involves only tapping a big &amp;lsquo;+&amp;rsquo; icon in the app, then pressing the button once to start the pairing via Bluetooth LE. There aren&amp;rsquo;t even any dialog boxes you need to click &amp;ndash; it just works. The starter pack comes with two white Pops, but additional units are sold separately for $39.99 and come in grey (&amp;ldquo;alloy), pink (&amp;ldquo;coral&amp;rdquo;) and teal, and the various colors make it easier to tell which button is which at a glance.\nBased on my experience, two Pop buttons is plenty for the average city apartment, which typically doesn&amp;rsquo;t have more than two rooms. Additional Pops are better for larger houses, since you&amp;rsquo;ll probably use about one per room. Each Pop supports up to three distinct recipes, since you can single press, double press, or long press to trigger three separate command combinations. Three commands for a room seems to cover the bases, although for some rooms like a central living\/entertainment space, having two can really extend the flexibility of what you can do.\n\nThe real Easy button\nThe Pop buttons themselves are extremely sleek, but stay just on the fair side of being too small. They&amp;rsquo;re big enough in terms of surface area that they stand out, meaning you&amp;rsquo;re unlikely to misplace them too easily. And they com with mounting tape pads, letting you stick them up in a convenient location. A replaceable watch-style cell battery will keep them running for up to five years without worry, too. Other solutions like the Philips Hue Tap use kinetic energy to forego batteries altogether, but I&amp;rsquo;ve found with that the charge can occasionally deplete to the point where you need to tap it a few times to get it to respond, so Logitech&amp;rsquo;s battery solution is probably better overall.\nUltimately what I like about the Pop is that from setup to operation, they&amp;rsquo;re dead simple, set-it-and-forget it style devices. I can now turn on and off my sleeve-mounted AC unit, start a movie, listen to my Sonos, and control the Philips lights with a switch (and let others control it without having them install an app) without having to dive through layers of software UI, or hunt down five different remotes.\nConversational interfaces, like the ones offered by Amazon Alexa and Apple&amp;rsquo;s Siri, might be the future of connected home control, but there are still too many issues with triggering those commands, and with accurate understanding to make those consistently reliable. Logitech&amp;rsquo;s idea to shoot instead for the simplest possible physical interface &amp;ndash; a button &amp;ndash; is a smart, sane intermediary step that turns all the latent potential of your smart home gadgets into tangible benefit.",
                "fallback": "TechCrunch Link: Logitech&#8217;s Pop really is the solution for smart home&nbsp;chaos",
                "from_url": "https:\/\/techcrunch.com\/2016\/08\/17\/logitech-pop-review\/",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/techcrunch-2013\/assets\/images\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1471532487.000273"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "<https:\/\/www.wired.com\/2016\/08\/john-maeda-automattic\/>",
        "attachments": [
            {
                "service_name": "WIRED",
                "title": "John Maeda’s Next Gig? Design Kingpin of the Open Web",
                "title_link": "https:\/\/www.wired.com\/2016\/08\/john-maeda-automattic\/",
                "text": "A bellwether of the design industry moves on to the next big thing.",
                "fallback": "WIRED: John Maeda’s Next Gig? Design Kingpin of the Open Web",
                "image_url": "https:\/\/www.wired.com\/wp-content\/uploads\/2016\/08\/JohnMaeda-660x495.jpg",
                "image_width": 333,
                "image_height": 250,
                "from_url": "https:\/\/www.wired.com\/2016\/08\/john-maeda-automattic\/",
                "image_bytes": 29767,
                "service_icon": "https:\/\/www.wired.com\/wp-content\/themes\/Phoenix\/assets\/images\/apple-touch-icon.png",
                "id": 1
            }
        ],
        "ts": "1471539429.000275"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "interesting",
        "ts": "1471539516.000277"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "having tried to wrangle design at automattic, I'm not sure this is actually much news… Seems like a PR move to me",
        "ts": "1471540269.000278"
    },
    {
        "user": "U0914MEN7",
        "text": "<@U0914MEN7|james> has left the channel",
        "type": "message",
        "subtype": "channel_leave",
        "ts": "1471540413.000279",
        "reactions": [
            {
                "name": "thinking_face",
                "users": [
                    "U02AUNA0P",
                    "U0J6TE0CA",
                    "U0B9N0HF0",
                    "U0HPGQ4KH"
                ],
                "count": 4
            },
            {
                "name": "micdrop",
                "users": [
                    "U02E3CRMA",
                    "U0HPGQ4KH"
                ],
                "count": 2
            }
        ]
    },
    {
        "type": "message",
        "user": "U1A1A9L7N",
        "text": "Understanding both user and business needs\/goals is part of making a useful and meaningful product. Quick little write-up: <https:\/\/medium.com\/@joshuantaylor\/designers-shouldn-t-code-they-should-study-business-dc3e7e203d39#.zcyhx84de>",
        "attachments": [
            {
                "service_name": "Medium",
                "title": "Designers shouldn’t code. They should study business.",
                "title_link": "https:\/\/medium.com\/@joshuantaylor\/designers-shouldn-t-code-they-should-study-business-dc3e7e203d39#.zcyhx84de",
                "text": "Increasingly, more and more companies are looking for great design leadership these days. They are being told that their company needs a…",
                "fallback": "Medium: Designers shouldn’t code. They should study business.",
                "fields": [
                    {
                        "title": "Reading time",
                        "value": "3 min read",
                        "short": true
                    }
                ],
                "ts": 1454954530,
                "from_url": "https:\/\/medium.com\/@joshuantaylor\/designers-shouldn-t-code-they-should-study-business-dc3e7e203d39#.zcyhx84de",
                "service_icon": "https:\/\/cdn-static-1.medium.com\/_\/fp\/img\/apple-touch-icon-ipad-retina.Akq8aSfZqfW1fceMxKqBZA.png",
                "id": 1
            }
        ],
        "ts": "1471544842.000280"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "+1000",
        "ts": "1471544987.000282"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": ":thinking_face::thinking_face::thinking_face::thinking_face:",
        "ts": "1471545023.000283"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "While I think craft is important to great design and technology, it’s not everything. I kind of hate how the term craft has become equivalent with “good design” in our industry.",
        "ts": "1471545122.000284"
    },
    {
        "type": "message",
        "user": "U1A1A9L7N",
        "text": "Understanding the business side of a project has always been a part of my process within this area of design (product design)",
        "ts": "1471545176.000285"
    },
    {
        "type": "message",
        "user": "U1A1A9L7N",
        "text": "Not sure how you can really create something solid without it",
        "ts": "1471545190.000286"
    },
    {
        "type": "message",
        "user": "U1A1A9L7N",
        "text": "Designers are capable of a lot more than just making gradients :slightly_smiling_face:",
        "ts": "1471545216.000287"
    }
]