[
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "<http:\/\/a16z.com\/2016\/12\/07\/mental-health-tech\/>",
        "attachments": [
            {
                "service_name": "Andreessen Horowitz",
                "service_url": "http:\/\/a16z.com",
                "title": "How Software Can Heal the Mental Health System",
                "title_link": "http:\/\/a16z.com\/2016\/12\/07\/mental-health-tech\/",
                "author_name": "htidnam",
                "author_link": "https:\/\/a16z.com\/author\/htidnam\/",
                "thumb_url": "https:\/\/i2.wp.com\/a16z.files.wordpress.com\/2016\/12\/chart.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 69,
                "text": "The U.S. mental health is under tremendous strain. Depression is now the leading cause of disability in the U.S. One in four Americans suffered from a diagnosable mental disorder in the last year, most of which were moderate to severe. We spend ~$200 billion dollars annually on mental health treatment &mdash; more than on any other medical condition. And yet we still have problems getting people the help they need.\nThe overwhelming need &mdash; and giant lag &mdash; in the system boils down to two things: coordinating care in our current health care framework, and getting the right treatment conveniently.\nSounds simple, but as obvious and innocuous as those problems sound, they aren&rsquo;t being addressed, and they have significant and far-reaching consequences: Mental health affects everything from economic productivity to other chronic medical conditions. The average monthly medical cost of a person with diabetes, for example, is $811; that cost skyrockets to $1775 for a person with diabetes and a mental health condition. Estimates place the additional healthcare costs from people in the U.S. with such mental health co-morbidities at ~$300 billion.\nDepression is now the leading cause of disability in the United States\nWhat makes this problem particularly challenging is that unlike most medical specialities, where the mainstay of treatment is a provider treating a patient with a pill or procedure, in mental health treatments like psychotherapy, the interaction with a medical professional is often the treatment itself. So maintaining consistently high quality among mental health providers is especially important. Unfortunately, today&rsquo;s minimal and manual outcome tracking makes that hard.\nThe great mental health challenge we&rsquo;re facing right now isn&rsquo;t just one of developing new therapies; it&rsquo;s one of scalability and convenience. And that&rsquo;s precisely where software can play a role in healing and protecting our mental health &mdash; for the treatment itself, as well as the overall mental health support infrastructure.\nAbout that infrastructure problem&hellip;\n&ldquo;We&rsquo;ll call you back in a month to set up an appointment.&rdquo; You&rsquo;ve probably heard this yourself too many times. We certainly did when calling a well-known mental health institution recently. (It took us two months to get an appointment with a psychiatrist. And that doctor ended up being out of network.) We aren&rsquo;t alone. One recent study of 360 psychiatrists resulted in only a 26% appointment rate, and getting that first appointment took an average of 25 days.\nAs anyone who has had this problem knows, appointment timing (and subsequent diagnosis) matters. Due to the existing infrastructure, up to 60% of adult Americans currently go undiagnosed &mdash; and therefore never seek mental health treatment. The main infrastructure goal should be to find mental health patients early, get them appropriate care, and track and update treatment based on progress.\nWhy is this so hard? Some of the problems with recognition and treatment stem from the fact that we actually have two separate medical systems: one for primary care (that&rsquo;s more generalized), and one for mental health care (that&rsquo;s more specialized). Simply put, psychiatrists and other mental health professionalists are more highly trained in spotting mental health diseases than primary care physicians (PCPs) are. And even when PCPs identify those in need, they don&rsquo;t always have appropriate referrals or providers for their patients. As a result, PCPs end up directly treating patients with mental health issues themselves &mdash; 80% of psychotropic drugs are prescribed by PCPs rather than psychiatrists.\nTo break the barriers between the primary care and mental health care worlds, we need to establish frequent feedback and communication. One approach for doing this is the &ldquo;collaborative care&rdquo; model for mental health care, developed with the American Psychiatric Association. By having a depression care manager (often a nurse) &ldquo;quarterback&rdquo; the patient&rsquo;s mental health journey &mdash; led by a PCP but coordinating and collaborating closely with mental specialists (and communicating with patients) along the way &mdash; the collaborative care model merges the two separate worlds. Over 70 trials have shown that this approach has positive health and economic benefits.\nAnother example of such an approach is the &ldquo;integrated care&rdquo; model, which often physically co-locates a primary care and mental health specialist &mdash; like next door to each other, as in VA hospitals. So when a PCP suspects a patient may have mental health issues during a routine visit, they can immediately do a &ldquo;warm hand-off&rdquo; to the mental health specialist next door. This immediate assessment ensures that patients don&rsquo;t fall through the cracks.\nSounds great. Unfortunately, these models are labor intensive and expensive. Enter software, which can greatly help to make the overall system cheaper and more efficient, by adopting, scaling, and automating the system coordination while retaining the human touch. Only now, that touch is more focused on true care as opposed to coordination. One example of such a company is Omada Health [disclosure: we&rsquo;re&nbsp;investors], which took an existing, effective evidence-based program (the Diabetes Prevention Program) and digitized and scaled the treatment so it would be less labor-intensive and expensive. They did this by keeping human coaches at the core, and then automating away the less central parts of the program through an online curriculum, self-weigh-ins (over 10,000,000 user weigh-ins!), and more. Not only did this reduce costs and massively increase the coach:user ratio, more crucially, it showed comparable effectiveness and results to the original program.\nWe&rsquo;re now seeing similar efforts to digitize collaborative care for the mental health world, led by companies like Quartet Health and Lyra Health among others. For example, software can crunch through electronic medical record and insurance claims data to automatically surface patients at risk for mental health disorders. Software tools can also help find the appropriate mental health provider; establish personalized treatment plans; open lines of communication between the PCP, patient, and mental health provider; and continuously update the patient&rsquo;s course of treatment based on their progress.\nThe great mental health challenge we&rsquo;re facing right now isn&rsquo;t just one of developing new therapies; it&rsquo;s one of scalability and convenience.\nBut what about treatment?\nThere are multiple forms of psychotherapy, most of which are high touch and focus on discussions between the patient and the therapist &mdash; and thus are difficult to scale. The most well-studied is cognitive behavioral therapy (CBT), which involves highly structured behavioral exercises and therefore lends itself well to digitization by software.\nSoftware-based approaches to CBT aren&rsquo;t really new. Studies on computerized cognitive behavioral therapy (CCBT) date back to 1990, and have been distributed &mdash; via CDs! &mdash; in 200 countries, including the UK and Australia. What&rsquo;s changed since then is internet + mobile, which creates the ideal conditions for delivering software-based CBT. This has led to an explosion of mental health technology companies in the past few years, from internet-based CBT to more recently, mobile CBT.\nWhile automated approaches relative to in-person therapies have generated healthy skepticism about efficacy, studies show promising results. A review of the research literature showed that software-based CBT is quite effective in treating depression and other mental health illnesses. Even more compelling are the recent results of a nation-wide multi-year study in the UK surveying different types of psychotherapies for the treat…",
                "fallback": "Andreessen Horowitz Link: How Software Can Heal the Mental Health&nbsp;System",
                "from_url": "http:\/\/a16z.com\/2016\/12\/07\/mental-health-tech\/",
                "service_icon": "http:\/\/0.gravatar.com\/blavatar\/028155d40793d8c2f7fd77a3b55ac924?s=114",
                "id": 1
            }
        ],
        "ts": "1481154161.000012"
    }
]