[
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<http:\/\/www.thisiscolossal.com\/2014\/06\/sheets-of-glass-cut-into-layered-ocean-waves-by-ben-young\/>",
        "attachments": [
            {
                "service_name": "Colossal",
                "title": "Sheets of Glass Cut into Layered Ocean Waves by Ben Young",
                "title_link": "http:\/\/www.thisiscolossal.com\/2014\/06\/sheets-of-glass-cut-into-layered-ocean-waves-by-ben-young\/",
                "text": "Self-taught artist Ben Young is a man of many exceptional talents from surfing and skateboarding to repairing furniture and working full-time as a qualified boat builder. He's also spent the last decade exploring the art of sculpting with glass, an endeavor that's become increasingly r",
                "fallback": "Colossal: Sheets of Glass Cut into Layered Ocean Waves by Ben Young",
                "image_url": "http:\/\/www.thisiscolossal.com\/wp-content\/uploads\/2014\/06\/glass-12.jpg",
                "ts": 1403778137,
                "from_url": "http:\/\/www.thisiscolossal.com\/2014\/06\/sheets-of-glass-cut-into-layered-ocean-waves-by-ben-young\/",
                "image_width": 533,
                "image_height": 250,
                "image_bytes": 162768,
                "id": 1
            }
        ],
        "ts": "1455200759.000002"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Dang",
        "ts": "1455203311.000004"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Sounds like a unique UI and UX. Just downloaded the app, so will follow with thoughts <http:\/\/qz.com\/613700\/its-here-quartzs-first-news-app-for-iphone\/>",
        "attachments": [
            {
                "service_name": "Quartz",
                "service_url": "http:\/\/qz.com",
                "title": "It’s here: Quartz’s first news app for iPhone",
                "title_link": "http:\/\/qz.com\/613700\/its-here-quartzs-first-news-app-for-iphone\/",
                "author_name": "Zachary M. Seward",
                "author_link": "https:\/\/qz.com\/author\/zachseward\/",
                "thumb_url": "https:\/\/i1.wp.com\/qzprod.files.wordpress.com\/2016\/02\/quartz-app-featured-image.png?fit=200%2C150&quality=80&strip=all",
                "thumb_width": 200,
                "thumb_height": 88,
                "text": "We just released our first news app for iPhone, which you can download from the App Store right now. Tap or click here to get it.\nThe app, exclusive to iPhone, is a whole new way to experience Quartz. We put aside existing notions about news apps and imagined what our journalism would be if it lived natively on your iPhone. It wouldn’t be a facsimile of our website. It would be something entirely different, with original writing, new features, and a fresh interface.\n\nQuartz for iPhone has all of that. It’s an ongoing conversation about the news, sort of like texting: We’ll send you messages, photos, GIFs, and links, and you can tap to respond when you’re interested in learning more about a topic. Each session lasts just a few minutes, so it’s perfect for the train, elevator, grocery store line, or wherever you have a spare moment to catch up on the news.\n\nSome of our messages will also reach you through fun and relevant notifications throughout the day. You can pick what you want: haikus about how the stock market is performing, important developments in the global economy, etc. These are notifications you will actually enjoy receiving. And we won’t buzz you unless it’s really important; most alerts will just quietly light up your phone.\n\nThere are other treats to enjoy without even opening the app. On the Today screen, you can view our most compelling Atlas chart of the moment. And if you own an Apple Watch, add our complication to your watch face to see how the US markets are faring — in the form of an emoji. We make it easy to stay up-to-date on investor sentiment without doing any work at all. It’s just there.\nThis is a new kind of business news app, just as <http:\/\/qz.com|qz.com> has strived to be a new kind of business news website. We’re excited to add Quartz for iPhone to the roster of ways in which you can get our reporting, perspective, and voice.\nThe editorial approach\nThe app’s interface may resemble an automated assistant, but here’s the secret about our little news bot: It’s actually written by humans! Smart journalists who want to keep you informed and entertained. We’ve assembled a global group of Quartz writers and editors, led by Adam Pasick, to give the app its voice.\nOur intent is to take a similar approach to other platforms where this kind of media could live. This is a big and broad endeavor for Quartz as we experiment with new formats. Internally, we refer to the project as Jasper, which is a form of the mineral quartz.\nDesign and development\nWe started tinkering with concepts and prototypes for an app about a year ago. Quartz has long focused on the open web, and we were never interested in recreating our website as a native app. We still aren’t. But mobile has developed a lot in the last few years, and we saw some new opportunities worth exploring.\nSam Williams developed the app, and Daniel Lee designed it. We drew influence from all sorts of places, but were particularly inspired by Jonathan Libov’s “Futures of Text” and apps with conversational UIs like Lark and Lifeline. Other trends, like the rise of bots and messaging, gave us confidence in the direction.\nThis is actually Quartz’s second iPhone app, albeit the first one that’s strictly about the news. Last year we released Flags, a custom keyboard to easily type all of the world’s flags in emoji. We plan to keep experimenting with how a news organization can serve readers on their most personal devices.\nAdvertising\n\nMINI is the launch sponsor of Quartz for iPhone. Advertising is integrated with the rest of the app beautifully, unobtrusively, and in parallel with the editorial experience. You can engage with the ads just as you would any other content.\nSupport and feedback\nThe app is for iPhones only, and you need to be running iOS 9.0 or higher to install it. Report any bugs you encounter to <mailto:support@qz.com|support@qz.com>. And we’re looking forward to your feedback on the app as we work on the next version and also turn our attention to Android. Please send any thoughts to <mailto:hi@qz.com|hi@qz.com>.\nHere, again, is the link to download the app. Thank you!",
                "fallback": "Quartz Link: It&#8217;s here: Quartz&#8217;s first news app for iPhone",
                "from_url": "http:\/\/qz.com\/613700\/its-here-quartzs-first-news-app-for-iphone\/",
                "id": 1
            }
        ],
        "ts": "1455203335.000005"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "It's neat. Don't know if I'll keep using it. Did you ever use lark?",
        "ts": "1455203708.000007"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "No. Similar? ",
        "ts": "1455203820.000008"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Similar interaction. Texting with a fitness tracking bot",
        "ts": "1455203941.000009"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Which is work I expect to do, reporting my shit",
        "ts": "1455203981.000010"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Lark - Personal Weight Loss Coach &amp; 24\/7 Nutritionist by LARK\n<https:\/\/appsto.re\/us\/c1bz2.i>",
        "attachments": [
            {
                "service_name": "App Store",
                "title": "Lark - Personal Weight Loss Coach &amp; 24\/7 Nutritionist on the App Store",
                "title_link": "https:\/\/appsto.re\/us\/c1bz2.i",
                "text": "Read reviews, compare customer ratings, see screenshots, and learn more about Lark - Personal Weight Loss Coach &amp; 24\/7 Nutritionist. Download Lark - Personal Weight Loss Coach &amp; 24\/7 Nutritionist and enjoy it on your iPhone, iPad, and iPod touch.",
                "fallback": "App Store: Lark - Personal Weight Loss Coach &amp; 24\/7 Nutritionist on the App Store",
                "image_url": "http:\/\/is3.mzstatic.com\/image\/thumb\/Purple5\/v4\/aa\/23\/e2\/aa23e2a4-3e27-9bcf-cb75-bf81da694563\/source\/1200x630bf.jpg",
                "image_width": 476,
                "image_height": 250,
                "from_url": "https:\/\/appsto.re\/us\/c1bz2.i",
                "image_bytes": 21901,
                "id": 1
            }
        ],
        "ts": "1455203985.000011"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Quartz feels like work I shouldn't have to do ",
        "ts": "1455203994.000013"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Yeah, from my admittedly little interaction with the app, it seems like there is something there, but it's not fully fleshed out. I think it could be an interesting feature integrated into Slackbot in the future? News discovery tool of sorts. ",
        "ts": "1455204361.000014"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Perhaps I'm not the target audience. I doff want to discover news I want to read it :)",
        "ts": "1455204982.000015"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "We've been using lark quite a bit for compass... I love the interface\/input but the voice is a total failure IMO. I feel like I'm texting with my mom, if my mom were more annoying.",
        "ts": "1455206340.000016"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "Nice example of good UI, bad UX",
        "ts": "1455206378.000017"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "Wow quartz is basically identical",
        "ts": "1455206572.000018"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "Wtf problem were they trying to solve with this app",
        "ts": "1455206634.000019"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Ever wish you could text a newspaper ",
        "ts": "1455206676.000020"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "Ever get sick of choosing which article you want to read?",
        "ts": "1455206708.000021"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "The notifications don't go to the story either. :upside_down_face:",
        "ts": "1455207565.000022"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "That's the worst part IMO! I think it could be an interesting UX sitting on the train and wanting to refine search \"show me articles on the NH primaries from the primaries\" w\/o voice input, but it damn well better go to the story afterwards ",
        "ts": "1455211052.000023"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "These guys just pinged me about doing a potential screener here. Seems relevant to some of our environmental work: <http:\/\/www.parallel.studio\/#home>",
        "ts": "1455226940.000024"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "let me know if there’s any interest",
        "ts": "1455226944.000025"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Will cross post in <#C028L147V>.",
        "edited": {
            "user": "U026NB2U2",
            "ts": "1455226961.000000"
        },
        "ts": "1455226950.000026"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "Large-scale lighting installations? Looks interesting...",
        "ts": "1455229557.000028"
    }
]