[
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "<https:\/\/www.wired.com\/2016\/09\/apple-google-adobe-microsoft-join-forces-make-typographic-history>",
        "attachments": [
            {
                "service_name": "WIRED",
                "title": "Tech Giants Team Up to Fix Typography’s Biggest Problem",
                "title_link": "https:\/\/www.wired.com\/2016\/09\/apple-google-adobe-microsoft-join-forces-make-typographic-history",
                "text": "Imagine a font that looks great on any device, in any orientation, on any platform...",
                "fallback": "WIRED: Tech Giants Team Up to Fix Typography’s Biggest Problem",
                "image_url": "https:\/\/www.wired.com\/wp-content\/uploads\/2016\/09\/Fonts-HP-660x660.jpg",
                "image_width": 250,
                "image_height": 250,
                "from_url": "https:\/\/www.wired.com\/2016\/09\/apple-google-adobe-microsoft-join-forces-make-typographic-history",
                "image_bytes": 25681,
                "service_icon": "https:\/\/www.wired.com\/wp-content\/themes\/Phoenix\/assets\/images\/apple-touch-icon.png",
                "id": 1
            }
        ],
        "ts": "1474643867.000086"
    },
    {
        "type": "message",
        "user": "U243UT96G",
        "text": "wow, this is huge",
        "ts": "1474664101.000088"
    },
    {
        "type": "message",
        "user": "U243UT96G",
        "text": "i wonder if this could be a game-changer for asian language fonts?  thinking it thru, i think it might",
        "ts": "1474664379.000089"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "i’d be curious to know if you have any resources handy on high level info about on-screen asian language typography <@U243UT96G>. no need to go searching for any if you don’t. i attended a brief lecture in design school about japanese typography and as nerdy and over our heads as it seemed, i was super into it. i’d love revisiting the topic at this point",
        "ts": "1474664770.000090"
    },
    {
        "type": "message",
        "user": "U243UT96G",
        "text": "i don't have anything off the top of my head, but i did a little bit of work for WSJ Japan and at that point I was astounded at how limited web typography is in asian fonts.  Because the font sets are SO huge it really limits your palette, and even being able to serve embedded fonts doesn't solve the core issue of huge font sets on the web.  so being able to minimize the base size of fonts seems like a huge win for japanese\/chinese.",
        "ts": "1474664946.000091"
    },
    {
        "type": "message",
        "user": "U243UT96G",
        "text": "i always also found it interesting that japanese\/chinese websites follow the western model of left-to-right horizontal display, whereas the printed word is almost always right-to-left vertical.  I find japanese websites really hard to read for this reason",
        "ts": "1474665047.000092"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "oh damn that would be difficult to read",
        "ts": "1474665163.000093"
    },
    {
        "type": "message",
        "user": "U243UT96G",
        "text": "I think most japanese\/chinese ppl are just used to it at this point, but i've always wondered if there could be a whole different UX approach based on traditional asian type layout",
        "ts": "1474665234.000094"
    },
    {
        "type": "message",
        "user": "U243UT96G",
        "text": "also i think that asians are more drawn to iconography (see: emojis) because their written language is already highly visually symbolic",
        "ts": "1474665305.000095"
    },
    {
        "type": "message",
        "user": "U243UT96G",
        "text": "going back to the original article that melissa posted, i would be interested to learn if the same relational logic they are using to render different styles of fonts could be used to render chinese characters out of component parts.  mapping characters that share components such as  木、森、林, as variations on a single glyph, as opposed to loading them as separate glyphs",
        "ts": "1474665514.000096"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "thanks for all that insight, i find all of it so fascinating. in regards to component parts I still don’t fully know _how_ these variable fonts work based off that article, but it looks like this link may have more info?? <https:\/\/medium.com\/@tiro\/https-medium-com-tiro-introducing-opentype-variable-fonts-12ba6cd2369#.umjwgfdfn>",
        "attachments": [
            {
                "service_name": "Medium",
                "title": "Introducing OpenType Variable Fonts",
                "title_link": "https:\/\/medium.com\/@tiro\/https-medium-com-tiro-introducing-opentype-variable-fonts-12ba6cd2369#.umjwgfdfn",
                "text": "Version 1.8 of the OpenType font format specification introduces an extensive new technology, affecting almost every area of the format. An OpenType variab…",
                "fallback": "Medium: Introducing OpenType Variable Fonts",
                "image_url": "https:\/\/cdn-images-1.medium.com\/max\/1200\/1*jNGTUj2PX2PXHv6sYUrXCg.png",
                "fields": [
                    {
                        "title": "Reading time",
                        "value": "23 min read",
                        "short": true
                    }
                ],
                "ts": 1473845461,
                "from_url": "https:\/\/medium.com\/@tiro\/https-medium-com-tiro-introducing-opentype-variable-fonts-12ba6cd2369#.umjwgfdfn",
                "image_width": 259,
                "image_height": 250,
                "image_bytes": 184708,
                "service_icon": "https:\/\/cdn-static-1.medium.com\/_\/fp\/img\/apple-touch-icon-ipad-retina.Akq8aSfZqfW1fceMxKqBZA.png",
                "id": 1
            }
        ],
        "ts": "1474666024.000097"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "another question, do you think it would be perceived as weird or just out of the ordinary if an asian language user was to encounter a site with traditional text flow from right to left? it would be more natural obviously but would it be unexpected with how prevalent the left to right reading is online?",
        "ts": "1474666296.000099"
    },
    {
        "type": "message",
        "user": "U243UT96G",
        "text": "^^ much more in-depth, thank you!",
        "ts": "1474666299.000100"
    },
    {
        "type": "message",
        "user": "U243UT96G",
        "text": "i think it would be perceived as weird, at first, as almost everything is when it's \"new\"",
        "ts": "1474666342.000101"
    },
    {
        "type": "message",
        "user": "U243UT96G",
        "text": "i almost feel like everything else on the browser would have to be flipped too - position of the scrollbar, the way tabs are laid out, back\/fwd buttons etc.  it would be a cool experiment!",
        "ts": "1474666410.000102"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "ooooo that’s interesting thinking about back\/forward buttons needing to be flipped. i never would have thought that might be an issue",
        "edited": {
            "user": "U026E0ZNR",
            "ts": "1474666494.000000"
        },
        "ts": "1474666487.000103"
    },
    {
        "type": "message",
        "user": "U243UT96G",
        "text": "opposite world asian browser.  i like it",
        "ts": "1474666514.000105"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Uncorked Original™",
        "ts": "1474666558.000106"
    }
]