[
    {
        "type": "message",
        "subtype": "file_share",
        "text": "<@U0B9N0HF0|rob> uploaded a file: <https:\/\/uncorked.slack.com\/files\/rob\/F2LBD1QHX\/machine-learning-for-designers.pdf|machine-learning-for-designers.pdf>",
        "file": {
            "id": "F2LBD1QHX",
            "created": 1475780869,
            "timestamp": 1475780869,
            "name": "machine-learning-for-designers.pdf",
            "title": "machine-learning-for-designers.pdf",
            "mimetype": "application\/pdf",
            "filetype": "pdf",
            "pretty_type": "PDF",
            "user": "U0B9N0HF0",
            "editable": false,
            "size": 17880089,
            "mode": "hosted",
            "is_external": false,
            "external_type": "",
            "is_public": true,
            "public_url_shared": false,
            "display_as_bot": false,
            "username": "",
            "url_private": "https:\/\/files.slack.com\/files-pri\/T0260V1BR-F2LBD1QHX\/machine-learning-for-designers.pdf?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "url_private_download": "https:\/\/files.slack.com\/files-pri\/T0260V1BR-F2LBD1QHX\/download\/machine-learning-for-designers.pdf?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "permalink": "https:\/\/uncorked.slack.com\/files\/rob\/F2LBD1QHX\/machine-learning-for-designers.pdf",
            "permalink_public": "https:\/\/slack-files.com\/T0260V1BR-F2LBD1QHX-f24f18eb58",
            "channels": [
                "C028ZDVTF"
            ],
            "groups": [],
            "ims": [],
            "comments_count": 0
        },
        "user": "U0B9N0HF0",
        "upload": true,
        "display_as_bot": false,
        "username": "rob",
        "bot_id": null,
        "ts": "1475780872.000133"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Nothing really new here, but I thought this was a great summary article <http:\/\/blog.invisionapp.com\/design-positive-change\/?utm_campaign=blog-post-social&amp;utm_content=38989178&amp;utm_medium=social&amp;utm_source=twitter>",
        "attachments": [
            {
                "service_name": "InVision Blog",
                "title": "Using design to effect positive change - InVision Blog",
                "title_link": "http:\/\/blog.invisionapp.com\/design-positive-change\/?utm_campaign=blog-post-social&utm_content=38989178&utm_medium=social&utm_source=twitter",
                "text": "Whether you're designing a product, new technology, app, or an entire business, the connection to the humans you're impacting is paramount to what you put out into the world.",
                "fallback": "InVision Blog: Using design to effect positive change - InVision Blog",
                "thumb_url": "http:\/\/s3.amazonaws.com\/blog.invisionapp.com\/uploads\/2015\/10\/positivechange-02.jpg",
                "ts": 1446057009,
                "from_url": "http:\/\/blog.invisionapp.com\/design-positive-change\/?utm_campaign=blog-post-social&utm_content=38989178&utm_medium=social&utm_source=twitter",
                "thumb_width": 800,
                "thumb_height": 500,
                "service_icon": "http:\/\/blog.invisionapp.com\/wp-content\/uploads\/2014\/03\/favicon.png",
                "id": 1
            }
        ],
        "ts": "1475780952.000134"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "As an addendum to the machine learning for designer O’Reilly book <https:\/\/www.oreilly.com\/ideas\/artificial-intelligence-making-a-human-connection>",
        "attachments": [
            {
                "service_name": "O'Reilly Media",
                "title": "Artificial intelligence: Making a human connection",
                "title_link": "https:\/\/www.oreilly.com\/ideas\/artificial-intelligence-making-a-human-connection",
                "text": "Genevieve Bell explores the meaning of “intelligence” within the context of machines and its cultural impact on humans and their relationships.",
                "fallback": "O'Reilly Media: Artificial intelligence: Making a human connection",
                "image_url": "https:\/\/d3tdunqjn7n0wj.cloudfront.net\/1400x933\/ur_chariot_crop-6dbe8ea95e90e89a52f32ae9995a6344.jpg",
                "ts": 1474920000,
                "from_url": "https:\/\/www.oreilly.com\/ideas\/artificial-intelligence-making-a-human-connection",
                "image_width": 375,
                "image_height": 250,
                "image_bytes": 436902,
                "service_icon": "https:\/\/www.oreilly.com\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1475781848.000136"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "<https:\/\/www.eventbrite.com\/e\/2016-wemake-celebratesa-design-conference-on-the-process-of-making-tickets-24752931685?ref=ebapi>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "2016 WeMake Celebrates—A Design Conference on the Process of Making",
                "title_link": "https:\/\/www.eventbrite.com\/e\/2016-wemake-celebratesa-design-conference-on-the-process-of-making-tickets-24752931685?ref=ebapi",
                "text": "PROCESS IS GOLDENFRIDAY, OCTOBER 14th \/ SATURDAY, OCTOBER 15th 2016WeMake Celebrates design-in-action with our second annual design conference on the process of making. Two days of creative dialogue with inspiring design thinkers known locally, nationally, and internationally. This curated group of diverse speakers have been chosen from the design and maker communities because they are forging their own creative paths and making a mark in their respective industries.Day 1\/ FRIDAY, OCTOBER 14THCreative Dialogue on the Process of Making 6 Keynote Speakers, Panels, Demos, and more!Gather at THE ARMORY for a full day of creative dialogue with a diverse panel of makers, designers, and illustrators. WeMake Celebrates sets the stage with local, national, and international design thinkers to talk about process and what inspires creativity. * We'll celebrate into the night with an after party too!IF YOU'RE ORDERING MORE THAN ONE TICKET, PLEASE ENTER IN INFORMATION OF ALL ATTENDEES. THANK YOU!Day 2\/ SATURDAY, OCTOBER 15thHands-on Experiences and Fun had by all!Day two will host creative workshops and hands-on making. WORKSHOP 1\/ KATE BINGAMAN BURT &amp; ZACH SCHOMBURG Objects \/ Belongings: Writing and Drawing About Our STUFFWORKSHOP 2\/ CHRISTINE HERRINFrom Hand to Digital \/Storytelling &amp; Book Making sponsored by AdobeWORKSHOP 3\/ MARK CANESOWordPlay \/ Lettering, Logos and AmbigramsWORKSHOP TICKETS ON SALE NOW!KEYNOTE SPEAKERS INCLUDE:JEAN JULLIENImmediately following last November’s terrorist attack in Paris, Jean posted a powerful image on Instagram of a peace symbol made with the Eiffel Tower. The world spread the image as a form of solidarity. Before this quick burst of social media fame, Jean’s character-driven illustrations were already well-known with an instantly recognizable signature style seen on the cover of Juxtapoz, in The Guardian, and in The New York Times.Originally from Nantes, Jean studied at Central Saint Martins and later at the Royal College of Art. He now resides and works in East London, his practice ranges from illustration to photography, video, costumes, installations, books, posters and clothing to create a coherent yet eclectic body of work.websiteinstagramfacebookLOTTA NIEMINENFrom Finland to Japan to New York, Lotta is changing the design world quickly and colorfully. Her charming illustrations and designs have graced the pages of The New York Magazine, Gloss, Le Monde and the children’s book Walk This World. Her work appears everywhere – on Finnish home goods, global packaging, a window display for Hermès and Goggle’s new calendar app. In 2014, Lotta was nominated for Forbes Magazine’s annual 30 Under 30 list in the Art &amp; Style category, which is just one on a long list of honors her playful, unique style has earned.websiteinstagramtwitterANDY BESTAndy is a nomad who is capturing the beauty of the natural world to share with the settled. He takes his cameras, his dog and his camper to remote forests, snow-covered peaks and seemingly-empty deserts.  He has captured the Northern Lights dancing in over Iceland’s tundra, the blue eyes of a sled dog in the Yukon and most of the West’s iconic vistas includingThe Seven Wonders of Oregon. His client list includes: Toyota, Sony, The North Face, Outside Magazine, Columbia Sportswear, Nike, Keen, Adidas and more.Andy’s manifesto “Work hard and love others” echoes in his work, lifestyle and passion. websitetwitterinstagramvimeoBOWEN AMESBowen Ames lives and works; the specifics are kaleidoscopic. Independently he is a multi-faceted designer working in several mediums from product design to social engagement. His career began in fine art at The Guggenheim Museum, and eventually moved into the world of design. His client list includes: Google, Microsoft, HP, Nau, Nike, Adidas, Yves Saint Laurent, Atlantic Records, and Travel Oregon to name a few. He is the recipient of an Effie Award for excellence in advertising and was recently invite to The White House as a technology and innovation advisor specializing in small business development and entrepreneurship. Currently Bowen is the the art director of device engagement at Amazon.websiteinstagram BIBI McGILLBibi McGill was born and raised in Denver, CO and began playing guitar at the age of 12. After graduating from the University of Colorado with a degree in Music: Scoring and Arranging, Bibi moved to Los Angeles where she developed her aggressive, soaring, funky, soulful style in clubs all over the city. Her defined and transcendent lead guitar work led her to playing with Pink as well as Paulina Rubio &amp; La Ley, where Bibi began to play arenas all over the United States and Latin America. Bibi has gone on to become Beyonce’s lead guitarist and musical director where she has served for almost a decade. Often called “the female Jimi Hendrix”, Bibi has played at the White House twice as well as in over 100 countries including her now legendary solos at the 2013 Superbowl and the Glastonbury Music Festival. Bibi’s style is ferocious, melodic and undeniable. She is considered one of the greatest rock guitarists alive.  A world renown yoga instructor, Bibi teaches and travels the world from her home base in Portland, Oregon where for the past several years she has developed her sound as a producer &amp; DJ. Bibi is a force of nature crisscrossing the globe, DJing, producing music, teaching yoga and giving health and wellness seminars internationally.instagramtwitterfacebook BRITT HOWARDBritt Howard, owner\/founder of Portland Garment Factory (PGF), a full service design+build garment and soft goods manufacturing house, is driven by creative curiosity and a love for collaboration. As an artist, mother, activist, and business owner, Britt works passionately on projects and initiatives to improve the community and planet. Like PGF, Britt is feminine, gritty, and innovative. In 2008 Britt recognized a need within the Portland design community for a local clothing manufacturer. Always with a strong vision of the future, Britt named her new business Portland Garment Factory, although at the time the “factory” consisted of three sewing machines in a small studio. Eight years later, PGF is now a full-scale prototyping and creative partner, working on diverse projects from creating a giant inflatable lung for the American Cancer Association, to collaborating with the Portland Mayor’s Office, to teaming up with the legendary Michael Jordan who told her, “You get me girl!”. Whatever the challenge, Britt leads with compassion, energy, and humor, instilling feminist and sustainable business practices within all aspects of PGF. websiteinstagramtumblr MAKER PANEL \/ Small Scale is a panel discussion featuring a dynamic group of local makers. We’ll explore how they have grown their businesses to national levels while still remaining the neighborhood shop around the corner— designing the products we love by hand.PANEL SPEAKERS INCLUDE:Shannon Guirl of Caravan Pacific, Matt Pierce of Wood &amp; Faulk, Laura Whipple of Scout Books, and Dave Selden of 33 Books MASTER OF CEREMONIES:LISA CONGDONLisa is best known for her colorfulabstract paintings, intricate line drawings, pattern design &amp; hand lettering. Her client work includes the MoMA, Harvard University, Martha Stewart Living, and Chronicle Books, among many others. She exhibits her work around the country, and writes a popular daily blog about her work, life and inspiration called “Today is Going to be Awesome”. She is the author of five books, including the starving-artist-myth-smashing “Art Inc: The Essential Guide to Building Your Career as an Artist”, and illustrated books “Fortune Favors the Brave”, “Whatever You Are, Be a Good One”, “Twenty Ways to Draw a Tulip” and “A Collection a Day”. She was named one of 40 Women Over 40 to Watch in 2015. websiteinstagramtwitterVISIT the event SITE FOR …",
                "fallback": "Eventbrite: 2016 WeMake Celebrates—A Design Conference on the Process of Making",
                "image_url": "https:\/\/img.evbuc.com\/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F24238216%2F22505020060%2F1%2Foriginal.jpg?w=1000&rect=22%2C21%2C856%2C428&s=efbbe8102f6bd7e1735dab33cad71682",
                "fields": [
                    {
                        "title": "Where",
                        "value": "128 NW 11th Ave, Portland, OR 97209",
                        "short": true
                    },
                    {
                        "title": "When",
                        "value": "Fri, Oct 14, 2016 at 9:00 AM",
                        "short": true
                    }
                ],
                "from_url": "https:\/\/www.eventbrite.com\/e\/2016-wemake-celebratesa-design-conference-on-the-process-of-making-tickets-24752931685?ref=ebapi",
                "image_width": 500,
                "image_height": 250,
                "image_bytes": 64500,
                "service_icon": "https:\/\/cdn.evbstatic.com\/s3-build\/perm_001\/1aab42\/django\/images\/touch_icons\/apple-touch-icon-57x57.png",
                "id": 1
            }
        ],
        "ts": "1475791398.000138"
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "^I have strong opinions on this, probably best left off slack.",
        "ts": "1475796196.000140"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Ohhhhhh",
        "ts": "1475796300.000141"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Well now I feel like I need to know!",
        "ts": "1475796317.000142"
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "I can share before Design Meet",
        "ts": "1475796417.000143"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "I want to know ",
        "ts": "1475799510.000144"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Will find you and document ",
        "ts": "1475799518.000145"
    }
]