[
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "posting this because coincidentally i was at Compound yesterday fixing my friend’s phone who works there, and the short 5 minutes it took to repair my friend’s screen, i had 4 people in the store ask me if i knew how to fix their shattered iphone screen.\n\ni also cracked my iphone screen this week too :’(\n\n<https:\/\/www.fastcodesign.com\/3063238\/why-wont-apple-fix-the-iphones-one-huge-design-flaw>",
        "attachments": [
            {
                "service_name": "Co.Design",
                "title": "Why Won't Apple Fix The iPhone's One Huge Design Flaw?",
                "title_link": "https:\/\/www.fastcodesign.com\/3063238\/why-wont-apple-fix-the-iphones-one-huge-design-flaw",
                "text": "Twenty-five percent of iPhones break in exactly the same way. It's not just a design problemit's a UX problem.",
                "fallback": "Co.Design: Why Won't Apple Fix The iPhone's One Huge Design Flaw?",
                "image_url": "https:\/\/d.fastcompany.net\/multisite_files\/fastcompany\/imagecache\/620x350\/poster\/2016\/08\/3063238-poster-p-1-why-wont-apple-fix-the-iphones-one-design-flaw.jpg",
                "ts": 1472554800,
                "from_url": "https:\/\/www.fastcodesign.com\/3063238\/why-wont-apple-fix-the-iphones-one-huge-design-flaw",
                "image_width": 443,
                "image_height": 250,
                "image_bytes": 25912,
                "service_icon": "https:\/\/www.fastcodesign.com\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1472755390.000035"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "wait, this was already posted",
        "ts": "1472755408.000038"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "nvm",
        "ts": "1472755409.000039"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "new to me, thanks for postin phillip",
        "ts": "1472755455.000040"
    },
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "Thanks, Phillip. I hadn’t seen it yet either. It’s something that I’ve honestly been thinking and complaining about for a while. I really wish they would at least make a more durable version people could pay more for. It’s annoying in the first place that it’s all about profits, but such is life.",
        "ts": "1472759071.000043"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "It used to be very easy to get into the phone, I still even have the screwdriver, but then criminals began buying stolen iPhones and using the genius bar to get brand new phones that could be resold at a higher value (plus the added benefit of a clean serial #). They would remove the glass, unseat the power cable and then use glue to reseat the power cable. There is no way to check if it has been un-seated and re-seated without un-seating it yourself, effectively destroying the phone, So they would come in 6-7 phones that “just stopped working” at a time and there was no way to call them on it since Apple policy (understandably) disallowed you from playing detective and calling customers liars.",
        "ts": "1472763016.000044"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Cross-posted on <#C1R6W3V8R|virtual_insanity> Here’s the Alysha Naples talk from the Instrument Cookie Shop series last night. Great talk! The TL’DR is that with VR\/AR\/MR we have an opportunity set the baseline design. The present is the prisoner of the past. Decisions we make today, we’ll be beholden to going forward. Like the mouse pointer. Or that roads are the sizes of 2 horses asses. If we’re not careful and don’t set the appropriate baseline, we can end up with an awful amalgamation of mobile design troupes, gamification, notifications and more. A hyper reality. But if we make a conscious decision today, we can build a VIRTUAL REALITY that is zen, pleasant and promotes a sense of belonging. Which after all is the thing that humans long for most, belonging. Well worth giving the whole thing a watch. <https:\/\/www.youtube.com\/watch?v=_AnSGChSSzw&amp;feature=youtu.be>",
        "ts": "1472764302.000045"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "hey <@U0B9N0HF0> are these events a regular thing? can you post them in <#C030SKPP7|events>?",
        "ts": "1472764338.000046"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "This is the second one they’ve held. I think there will be more. Both of the first two are former Magic Leap employees who felt compelled to leave Magic Leap and spread the gospel that something huge is coming and that we only have one chance to get it right.",
        "ts": "1472764410.000047"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "would def be interested in attending the next if there is one",
        "ts": "1472764433.000048"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Here’s the profile link where they’ll announce the next one. I’ll make sure to post it in events when it comes up too. <http:\/\/www.eventbrite.com\/o\/instrument-11097294071>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "Instrument",
                "title_link": "http:\/\/www.eventbrite.com\/o\/instrument-11097294071",
                "text": "Instrument is an independent digital creative agency in Portland, Oregon. They build brands, experiences and campaigns for every screen. <http:\/\/instrument.com|instrument.com> ",
                "fallback": "Eventbrite: Instrument",
                "thumb_url": "http:\/\/cdn.evbstatic.com\/s3-build\/perm_001\/48d2e1\/django\/images\/logos\/eb_logo_white_1200x1200.png",
                "from_url": "http:\/\/www.eventbrite.com\/o\/instrument-11097294071",
                "thumb_width": 1200,
                "thumb_height": 1200,
                "service_icon": "http:\/\/cdn.evbstatic.com\/s3-build\/perm_001\/1aab42\/django\/images\/touch_icons\/apple-touch-icon-57x57.png",
                "id": 1
            }
        ],
        "ts": "1472764544.000049"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "thx",
        "ts": "1472764654.000051"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "If I haven’t been convincing enough though, I strongly recommend going back and watching that talk :stuck_out_tongue: :wink:",
        "ts": "1472765422.000052"
    }
]