[
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "beautiful data viz, flights, ships, police control and …. i want to be a stork: watch the beginning to end … or at least peak into beginning and definitely go to the end at around 3:26. You’ll not be dissapointed\n\n<https:\/\/vimeo.com\/37175823>",
        "attachments": [
            {
                "service_name": "Vimeo",
                "service_url": "https:\/\/vimeo.com\/",
                "title": "Netherlands from Above - data animation",
                "title_link": "https:\/\/vimeo.com\/37175823",
                "author_name": "422 South",
                "author_link": "https:\/\/vimeo.com\/south422",
                "thumb_url": "http:\/\/i.vimeocdn.com\/video\/255388243_295x166.jpg",
                "thumb_width": 295,
                "thumb_height": 166,
                "text": "Dutch public TV producer \/ broadcaster VPRO first approached 422 South in December 2010.  A year later, the first fruits of the collaboration between the Bristol based vis FX house and their Amsterdam client are hitting Dutch TV screens -  to considerable acclaim.   422 South had come to the attention of VPRO producer Jasper Koning as a result of their groundbreaking data visualization work for the BBC’s Britain from Above (Lion TV) and subsequently for two series of Germany from Above for public broadcaster ZDF.\n\nLed by Technical Director Craig Howarth, 422 South’s team wrote bespoke software to translate data sets describing many aspects of modern life – taxi rides, aircraft flights, phone calls, ship movements and even the wanderings of wild animals in city suburbs.\nThis data is then interpreted by 422 South’s CGI artists as beautiful – almost poetic animations that are informative and sometimes strangely moving.  \n\nFor VPRO, making 10 x 30 minutes of prime time TV has meant commissioning over 20 minutes of animation – some of which is still in production even as the first episodes of the series are going to air.  But in keeping with the trend for 360 degree projects, the project also has an extensive web presence for which Dutch –UK relationship was opened up to include a US partner -  interactive designers Stamen Design.",
                "fallback": "Vimeo Video: Netherlands from Above - data animation",
                "video_html": "<iframe src=\"https:\/\/player.vimeo.com\/video\/37175823?autoplay=1\" width=\"400\" height=\"225\" frameborder=\"0\" title=\"Netherlands from Above - data animation\" webkitallowfullscreen mozallowfullscreen allowfullscreen><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "from_url": "https:\/\/vimeo.com\/37175823",
                "service_icon": "https:\/\/a.slack-edge.com\/e8ef6\/img\/unfurl_icons\/vimeo.png",
                "id": 1
            }
        ],
        "ts": "1480531794.000316"
    }
]