[
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I’m actually pretty impressed by the affect this has on me. At face value I really really dislike the work as an art piece. Diving deeper though it serves as a contrast that helps me to understand the value of personalization and appreciate “shit graffiti” as artifacts of culture, representing unique signatures of the people who left them behind. Even if the originals were shitty they at least show humanity in a way that Helvetica can’t",
        "ts": "1469397619.000045"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Thanks for sharing :)",
        "ts": "1469397833.000046"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": ":blush: I have super mixed feelings about it too. it's an interesting contrast to my obsession with square readers leading to the demise of hand-written signatures",
        "ts": "1469402906.000047"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Yeah the terminology in here is a bit troubling. For all the reasons mentioned above. I suppose the question really is: what is shit? ",
        "ts": "1469413088.000048"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "it also skirts the time honored concept of tagging over another tag as a means of turf wars",
        "ts": "1469417533.000049"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "idk, it seems like a dick move imo",
        "ts": "1469417541.000050"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Yeah - this seems like someone who has no idea wtf they're doing \"fixing\" something they don't understand ",
        "ts": "1469418723.000051"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "agreed with the dick move comment, not sure if like",
        "ts": "1469428359.000052"
    }
]