[
    {
        "type": "message",
        "user": "U0XCJ372R",
        "text": "Nice little article. I always get excited seeing things that challenge the way we think about web design.\n<http:\/\/eyeondesign.aiga.org\/node-challenges-the-convention-of-grid-based-web-design\/>",
        "attachments": [
            {
                "service_name": "Eye on Design",
                "title": "NODE Challenges the Convention of Grid-based Web Design",
                "title_link": "http:\/\/eyeondesign.aiga.org\/node-challenges-the-convention-of-grid-based-web-design\/",
                "text": "Based between Norway and Sweden, design studio NODE’s work defines the image of art and cultural institutions in both countries.  Along icy streets in Norway, I saw NODE’s Risograph posters and printed paraphernalia for Oslo Pilot, a two-year art programme that’s preparing for an art biennale taking",
                "fallback": "Eye on Design: NODE Challenges the Convention of Grid-based Web Design",
                "image_url": "http:\/\/eyeondesign.aiga.org\/wp-content\/uploads\/2016\/08\/website_OMA_start.jpg",
                "ts": 1474961446,
                "from_url": "http:\/\/eyeondesign.aiga.org\/node-challenges-the-convention-of-grid-based-web-design\/",
                "image_width": 162,
                "image_height": 250,
                "image_bytes": 321267,
                "service_icon": "http:\/\/eyeondesign.aiga.org\/wp-content\/themes\/stencil-theme\/images\/apple-touch-icon.png",
                "id": 1
            }
        ],
        "ts": "1475001075.000117"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "<@U0XCJ372R> thanks for sharing. I love the homepage concept, both content and layout. Really bold and interesting.",
        "ts": "1475009280.000119"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Anyone else going to the Invision film tonight?",
        "ts": "1475016045.000120"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "dont know about it",
        "ts": "1475016078.000121"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "<https:\/\/www.designdisruptors.com\/>",
        "attachments": [
            {
                "title": "DESIGN DISRUPTORS",
                "title_link": "https:\/\/www.designdisruptors.com\/",
                "text": "Get a sneak peek of @InVisionapp's new documentary DESIGN DISRUPTORS featuring @twitter, @google, @airbnb and more!",
                "fallback": "DESIGN DISRUPTORS",
                "thumb_url": "https:\/\/www.invisionapp.com\/subsystems\/design_disruptors_new\/assets\/img\/designdisruptors.jpg",
                "from_url": "https:\/\/www.designdisruptors.com\/",
                "thumb_width": 1200,
                "thumb_height": 628,
                "service_icon": "http:\/\/www.invisionapp.com\/dd-favicon.ico",
                "service_name": "designdisruptors.com",
                "id": 1
            }
        ],
        "ts": "1475016183.000122"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Tonight @ 6:15 @ PNCA. Free food+drink",
        "ts": "1475016209.000124"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "<http:\/\/a16z.com\/2016\/09\/27\/livestreaming-trend-china\/>",
        "attachments": [
            {
                "service_name": "Andreessen Horowitz",
                "service_url": "http:\/\/a16z.com",
                "title": "16 Observations on Livestreaming in China",
                "title_link": "http:\/\/a16z.com\/2016\/09\/27\/livestreaming-trend-china\/",
                "author_name": "sonala16z",
                "author_link": "https:\/\/a16z.com\/author\/sonala16z\/",
                "thumb_url": "https:\/\/i0.wp.com\/a16z.files.wordpress.com\/2016\/09\/homebroadcast-set_conniea16z.png?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 113,
                "text": "From emoji to stickers (and selfies-as-stickers) to filters (and the &ldquo;Instagrammification of everything&rdquo;), there&rsquo;s a new era of social self-expression happening &mdash; enabled by always-accessible cameras on smartphones, now too on sunglasses; real-time computer vision\/ A.I.; social media; and more. Several of these phenomena emerged or were popularized in Asian messaging apps before they made their way into global products. It&rsquo;s very possible that China&rsquo;s latest trend in mobile self expression and entertainment,&nbsp;livestreaming, is next.\nLivestreaming has been around in the U.S. for years but hasn&rsquo;t really taken off at mainstream scale yet. There are plenty of mobile apps around the world for it, from Facebook Live to Flipagram, Inke, Instagram Stories, , Meerkat, Momo, Snapchat, Twitch, Twitter Periscope, YouNow, YY, and so on. Yet as with previous new forms of mobile self expression, it&rsquo;s taking off in China in particular: For instance, roughly 46% of China&rsquo;s internet population used a livestreaming app in June 2016. Huachuang Securities estimated the mobile livestreaming market opportunity to be a $1.8B industry last year, expanding to $15.9B by 2020. Credit Suisse stated in its September research report that it believes the Chinese personal livestreaming market will be $5B next year &mdash; already just&nbsp;$2B less than China&rsquo;s movie box office total ($7B) and half the size of its mobile gaming market.\nThese are startling figures given that the livestreaming explosion in China started only a year ago. When Chinese entrepreneurs saw Meerkat&rsquo;s explosive growth in March 2015, they sought to create livestreaming apps of their own; since then, over 150 live streaming apps have been launched in China. The phenomenon is still quite young, but what do we know so far about livestreaming in China &mdash; and what can we hopefully learn as it evolves both there&hellip; and here?\n#1 It&rsquo;s a new form of entertainment\nAlthough the livestreaming category had been around in China and the U.S. for over a decade, some Chinese apps (such as Inke) reframed it as social livestreaming &mdash; essentially video chatrooms where strangers gather to watch and chat with a broadcaster. This new content category helped push spontaneous livestreaming as the next evolution in self-expression, beyond selfies and stickers\/filters.\nPreviously, livestreaming platforms in China and the U.S. were mostly known for gaming (Twitch for example is&nbsp;live-gamestreaming) and pre-planned live performances for singing and dancing. Inke and other social streaming apps not only shifted the focus from the webcam to the mobile camera, but from the camera on the back of the phone to the camera on the front of the phone. In other words: from outward capture &mdash; what you are seeing or where you are &mdash; to inward capture, a.k.a. your face. To understand the significance, imagine Snapchat stories without the inward capture: It would feel more like documenting news than expressing oneself.\nLivestreaming in China is thus more like a video version of selfies. And the interaction &mdash; between personal broadcasters\/hosts and their audiences &mdash; is the fulcrum for engagement and monetization.\n#2 Interaction replaces the need for &ldquo;talent&rdquo;\nIf one thinks of livestreaming in China as the mobile-native version of television, then social livestreaming is part reality TV, part late-night talk show. But what is so entertaining about watching everyday people stream their daily lives &mdash; laying on the couch watching TV, eating meals, driving to work, or more often than not, sitting at their desks in their bedrooms? This isn&rsquo;t exactly the Truman Show!\nThe answer lies in the interaction between broadcasters and viewers, all enabled by the platform. If a viewer likes a broadcast, he or she can send a public question, a digital gift, or multiple digital gifts to grab the broadcaster&rsquo;s &nbsp;attention. The broadcaster can then choose to acknowledge the sender&rsquo;s username and respond with a quick answer or a simple thank you. For example, let&rsquo;s say you send a broadcaster a digital sticker of a sports car (a luxury sticker, usually costing over $30 apiece) and then immediately afterwards ask him or her to sing your favorite song. If the broadcaster feels up for it, he or she will thank you for the gift and honor your request &mdash; all in the public chatroom that other viewers are also watching from.\nOn Inke, a viewer just gifted this broadcaster a sports car sticker that cost $45 (of which the broadcaster will likely keep ~$15).This interaction gives the sender the joy of recognition and instant gratification, gives the broadcaster financial payoffs from the digital sticker, and gives the other viewers in the room entertaining content. Viewers can thus help dictate much of the show&rsquo;s &ldquo;direction&rdquo;.\nAnother gamification feature in&nbsp;successful livestreaming apps is the use of leaderboards to surface unknown vs. incumbent stars (which are difficult to topple on platforms like YouTube). Everything is designed around surfacing new streamers, livestreams, and trending personalities. Applied to individual broadcasters, leaderboards also highlight their top fans based on the total values of digital gifts sent. This competition among top fans for broadcasters then&nbsp;increases&nbsp;interaction and gifting.\nWith such a&nbsp;focus on viewer interaction, broadcasters rarely need to pre-plan much of their content. They just need to open the app and engage with their audience. In the past, top broadcasters had to be talented&nbsp;in gaming, music, dancing, or some kind of performance. Now, a top broadcaster might not have any traditional talents. In this way, putting a &ldquo;social&rdquo; in front of livestreaming expanded the supply of potential broadcasters in China.\n#3 Digital gifting aligns incentives\nWhy do broadcasters choose to livestream in the first place? The reasons are simple: To feel famous, to pass time or to meet new people, and to make money.\nWhen a viewer buys a digital gift for a broadcaster, the revenue is split between the app store, the broadcaster, and the livestreaming platform. Gifts can range anywhere between a few cents to several hundred U.S. dollars. The top broadcasters in China make tens of thousands of dollars a month &mdash; it&rsquo;s not uncommon to hear stories where someone has quit his or her full time job to pursue broadcasting because it pays more.\nThrough digital gifting, broadcasters receive instant feedback that they&rsquo;re loved by their fans; viewers receive acknowledgement from the broadcasters they like; and platforms earn&nbsp;money. And because broadcasters see livestreaming as a way to make money, too, they&rsquo;re incented to broadcast more frequently. As a result, China livestreaming apps have a steady supply of content &mdash; an issue that other livestreaming apps in the U.S. hadn&rsquo;t overcome.\nAnother dynamic to note is that most of China&rsquo;s social livestreaming apps focus on stranger-to-stranger networks where digital gifting as a form of communication&nbsp;is more culturally familiar and common. These platforms would have different gifting dynamics if the streams were from friends to existing friends.\n#4 Advertising isn&rsquo;t the only way to monetize\nBecause incentives between platform, broadcaster, and viewers are aligned through messaging and a culture of digital gifting, Chinese livestreaming platforms generate revenue right out the gate. And they do so without relying on advertising revenue or big brand campaigns.\nIn popular livestreaming app YY&rsquo;s case, for example, advertising is a very small source of revenue: Online advertising accounted for 9.0%, 4.0%, and 1.1% of YY&rsquo;s total net revenues in 2013, 2014, and 2015, respectively.\nThis is not to say that brands aren&rsquo;t interested in the livestre…",
                "fallback": "Andreessen Horowitz Link: 16 Observations on Livestreaming in&nbsp;China",
                "from_url": "http:\/\/a16z.com\/2016\/09\/27\/livestreaming-trend-china\/",
                "service_icon": "http:\/\/0.gravatar.com\/blavatar\/028155d40793d8c2f7fd77a3b55ac924?s=114",
                "id": 1
            }
        ],
        "ts": "1475020165.000125"
    }
]