[
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Nicole He’s masters thesis at ITP is “The Best Art,” an artistic collaboration with a bot that generates art ideas, which she then creates and documents online. <http:\/\/the-best-art.computer\/>",
        "attachments": [
            {
                "title": "The Best Art",
                "title_link": "http:\/\/the-best-art.computer\/",
                "text": "The Best Art is an ongoing artistic collaboration between the computer (MacBook Air, 13-inch, early...",
                "fallback": "The Best Art",
                "thumb_url": "http:\/\/68.media.tumblr.com\/avatar_10957359c354_128.png",
                "from_url": "http:\/\/the-best-art.computer\/",
                "thumb_width": 128,
                "thumb_height": 128,
                "service_icon": "http:\/\/68.media.tumblr.com\/avatar_10957359c354_128.png",
                "service_name": "the-best-art.computer",
                "id": 1
            }
        ],
        "ts": "1490639165.132986",
        "reactions": [
            {
                "name": "heart",
                "users": [
                    "U0260V1BX",
                    "U3M4RRNQ5"
                ],
                "count": 2
            }
        ]
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "<https:\/\/qz.com\/940912\/we-should-design-businesses-like-circles-not-straight-lines\/>",
        "attachments": [
            {
                "service_name": "Quartz",
                "service_url": "http:\/\/qz.com",
                "title": "We should design businesses like circles, not straight lines",
                "title_link": "https:\/\/qz.com\/940912\/we-should-design-businesses-like-circles-not-straight-lines\/",
                "author_name": "Commentary",
                "author_link": "https:\/\/qz.com\/author\/commentaryqz\/",
                "thumb_url": "https:\/\/i1.wp.com\/qzprod.files.wordpress.com\/2017\/03\/circle-human-chain.jpg?fit=200%2C150&quality=80&strip=all&ssl=1",
                "thumb_width": 200,
                "thumb_height": 113,
                "text": "Here&rsquo;s what I love about being a designer: serving people&rsquo;s needs and solving complex challenges. Here&rsquo;s what I don&rsquo;t like much: using precious resources to create stuff that people use for a limited time and then send to the dump. As a consumer, I&rsquo;m no different from the next guy: I want the fastest, smartest, best-designed gear, and I want the companies that produce it to keep pace with my appetite for it. But my behavior has a hidden cost. By 2050, there will be more plastic than fish in the sea.\nWe need to reverse course and radically shift the way stuff gets made and used. Such a shift will require us all to adopt a new mental model and ultimately a new kind of economy&mdash;one that, through design, promotes a smarter use of resources and aims to reduce waste throughout a product&rsquo;s lifecycle.\nOur modern industrial economy was based on a straight line&mdash;a linear progression of make, use, dispose. That was a perfectly logical response to the steam train of consumer demand that powered the 20th century: Give the customer what they want, and when it&rsquo;s no longer useful, they can simply toss it in the trash and buy a new one. More products, more money.\nBut what would happen if we took that line and bent it into a circle? What if the stuff we created never outlived its use? What if its constituent parts could be used as raw material for the next generation? If you adopt a holistic view of production, take advantage of idle capacity, reuse materials, and increase the lifespan of products, you will save both money and the planet. That&rsquo;s the promise of circular design.\nThere are several examples of circular design already thriving in the world. Take Tesla, for example. Elon Musk&rsquo;s &ldquo;Master Plan Part Deux&rdquo; was a great description of a business model for a circular economy. Electric vehicles are powered by renewables, and when you&rsquo;re not driving, your car can join a Tesla fleet that carries out various tasks and pays you for the favor, thereby offsetting your cost. Instead of just sitting there like a lump of steel in your garage when not in use, your car can also perform personal tasks for you when in autonomous mode, like driving your mother back to her assisted-living facility or delivering a gift to a friend. Tesla&rsquo;s vision is a perfect demonstration of how circularity benefits everyone, from producer to consumer.\nIn fact, circular business models eradicate the barriers between production, product, and consumer. In his manifesto, Musk describes a model in which the means of production are every bit as important as the output. &ldquo;Tesla engineering has transitioned to focus heavily on designing the machine that makes the machine,&rdquo; he says, &ldquo;turning the factory itself into a product.&rdquo; As Joe Iles at the Ellen MacArthur foundation wrote, &ldquo;In the pre-digital world we used to work for materials, and now materials work for us.&rdquo;\nOn the consumer level, several startups are making it easy for buyers to tap into the circular-design economy. Stuffstr, for example, makes keeping products such as mobile phones or game consoles in circulation easy. You log your purchases in the app, and when they&rsquo;ve outlived their use, it does the work of selling, donating, or giving them away.\nLe Tote and Grover&mdash; the Netflix for clothes and gadgets&mdash;are two other companies bringing circular models to consumers. With a frenetic churn of new styles and constant upgrades in both industries, doesn&rsquo;t it make more sense to rent them? Le Tote customers pay a monthly fee (starting at $39) for a personalized selection of clothes and accessories from labels such as French Connection, Vince Camuto, and Joie. Each month the subscriber receives a box with items they can either buy or wear a few times and then return. Meanwhile, Grover allows you to rent one of 300 gadgets, including Apple watches, smartphones, and Xboxes. These companies also collect data on the behavior of their customers that can then be fed back to the manufacturers to either stem or increase production. As these businesses rely on predicting the ebbs and flows of consumer demand, such data could keep unnecessary surplus from landing in the trash.\nIn this way, circular design represents a massive business opportunity. A recent study, &ldquo;Growth Within: A circular economy vision for a competitive Europe,&rdquo; found that by adopting circular-economy principles, Europe could create a net benefit of &euro;1.8 trillion (USD$1.96 trillion) by 2030. Circular organizations are also feedback rich, adaptive, and champions of diverse thinking, all of which makes them creatively competitive. For businesses hoping to remain competitive in a market driven by wafer-thin margins, it may be the only way to differentiate their offer.\nAnd it&rsquo;s not only a consumer play: Businesses that integrate this mindset will increase efficiency and reduce costs, too. For example, Provenance, a platform that empowers brands to take steps toward greater transparency by tracing the origins and histories of products, uses blockchain technology to track products and materials as they move through the supply chain, facilitating material reuse. Spacious transforms restaurants that are closed during the day into co-working spaces, saving both the restaurant and the co-working spaces lease money.\n* * *\nThe transformation of the way we produce and use goods is one of the great design challenges of our time. The old paradigm of design, launch, dispose is dead. A continuity mindset means designing for continuous lifecycles, whether directly with the user or within a wider ecosystem of potential customers.\nI know what you&rsquo;re thinking: easy to write the prescription, hard to take the medicine. Getting circular is going to take time and fierce commitment, especially within established companies that have a timeworn way of doing things. But we need to take ownership, stop being part of problem, and start suggesting solutions. That means working with leaders who see circularity not just as a public-relations play, but as an opportunity to generate new business opportunities&mdash;and as a responsibility to future-proof this planet. We&rsquo;re not going to stop craving the shiny and new, but we can shine a new light on how to get that craving met.\nCreated for mainstream innovators, entrepreneurs and intrapreneurs, the Circular Design Guide alms to raise awareness of the circular economy, nurture a &lsquo;systems perspective&rsquo;, and share practical innovation methods.\nYou can follow Tim on Twitter at @tceb62. Learn how to write for Quartz Ideas. We welcome your comments at .",
                "fallback": "Quartz Link: We should design businesses like circles, not straight lines",
                "from_url": "https:\/\/qz.com\/940912\/we-should-design-businesses-like-circles-not-straight-lines\/",
                "service_icon": "https:\/\/app.qz.com\/img\/icons\/touch_144.png",
                "id": 1
            }
        ],
        "ts": "1490665825.606672",
        "reactions": [
            {
                "name": "+1::skin-tone-3",
                "users": [
                    "U0HPGQ4KH"
                ],
                "count": 1
            }
        ]
    }
]