[
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "just FYI. I want to make it to TEDx Portland this year, seems like tickets are not available yet? But there is a Salon with two speakers this Thursday. <https:\/\/www.eventbrite.com\/e\/tedxportland-salon-2-tickets-31603632315?aff=es2>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "TEDxPortland SALON #2",
                "title_link": "https:\/\/www.eventbrite.com\/e\/tedxportland-salon-2-tickets-31603632315?aff=es2",
                "text": "WHAT: Produced by the TEDxPortland organizing team — this event is the second installment of a three part series. The evening will be a unique, intimate gathering of thinkers, doers, creators and makers—to allow the conversation to continue around ideas worth spreading. Only 200 people - An opportunity for TED enthusiasts to get together.   With special thanks to the University of Oregon for being our gracious host.  WHEN:  6:00pm - 7:00pm \/ Happy Hour &amp; Appetizers  7:00pm - 8:30pm \/ Two live Talks, Q&amp;A, One Performance and one <http:\/\/TED.com|TED.com> Talk  WHERE:  White Stag Block - University of Oregon 70 NW Couch Portland, OR 97209  PROGRAM: Becki Saltzman —Talk Becki is a curiosity expert and an applied-curiosity trainer and consultant. She holds a masters degree in behavioral science from Washington University in St. Louis. Becki has spent the last two decades studying curiosity and the role it plays in innovation, creativity, problem solving\/decision-making, sales, and adventure. She is the author of Living Curiously: How to Use Curiosity to Be Remarkable and Do Good Stuff. When she’s not traveling to preach the gospel of curiosity, Becki lives in Portland, Oregon with her husband and two sons. She loves great travel adventures, crowded dance floors, and brown drinks. Liz Valentine —Talk As co-founder and CEO of strategic creative agency Swift, Liz Valentine could just as easily be called Chief Empathy Officer. Her blend of East-Coast hustle, fierce conviction and razor-sharp smarts has helped power Swift's rapid rise over the past decade. But a knack for nurturing employees and leading by listening is equally essential to the company's success and Liz's evolution as a leader. She has two children, one husband, a pack of animals and a lousy ability to sit still for very long.   Sam Ellenby —Performance Sam Ellenby is a 15-year-old aspiring singer\/songwriter from Portland. He draws influences from many genres, including the likes of Marvin Gaye, The Beatles, and Jack Johnson. He is an avid record collector and has a passion for playing guitar, piano, or whatever instrument he is able to get his hands on. A Selected <http:\/\/TED.COM|TED.COM> Talk INCLUDED WITH TICKET: - Two Live Talks, One Performance, One <http:\/\/TED.com|TED.com> Talk - TEDxPortland Nike Dri-Fit T-Shirt - Happy Hour presented by Beam Suntory and Rogue Ales - Complimentary Appetizers thanks to the University of Oregon  - Stumptown Coffee - Runa Tea - Intimate gathering of 200 people  - Hosted in a beautiful building \/ White Stag Block",
                "fallback": "Eventbrite: TEDxPortland SALON #2",
                "image_url": "https:\/\/img.evbuc.com\/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F27822156%2F149772057587%2F1%2Foriginal.jpg?w=1000&rect=52%2C0%2C2412%2C1206&s=b6af1c669e17da95cde709a1af3c84bf",
                "fields": [
                    {
                        "title": "Where",
                        "value": "70 Northwest Couch Street, Portland, OR 97209",
                        "short": true
                    },
                    {
                        "title": "When",
                        "value": "Thu, Feb 9, 2017 at 6:00 PM",
                        "short": true
                    }
                ],
                "from_url": "https:\/\/www.eventbrite.com\/e\/tedxportland-salon-2-tickets-31603632315?aff=es2",
                "image_width": 500,
                "image_height": 250,
                "image_bytes": 117081,
                "service_icon": "https:\/\/cdn.evbstatic.com\/s3-build\/perm_001\/1aab42\/django\/images\/touch_icons\/apple-touch-icon-57x57.png",
                "id": 1
            }
        ],
        "ts": "1486495205.000258"
    }
]