[
    {
        "user": "U02F8TTPU",
        "text": "<@U02F8TTPU|marissa> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1481064021.000002"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "I'm in the process of learning about eco-roof maintenance in order to help my home building, and here too, if you need any more help :bamboo: :deciduous_tree:",
        "ts": "1481064936.000003"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "ooOOo",
        "ts": "1481065094.000004"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "Just talked with Casey, landscape architect, at the city of portland bureau of environmental services, and learned some relevant info... it's hard to develop a maintenance plan for a rooftop garden\/eco-roof since each project has its own details of size, positioning, sun exposure, irrigation, plantings, whether it's open to people, etc. There's a real problem with roof garden projects languishing over time.",
        "ts": "1481065826.000005"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "It seems that there's a huge space available for anyone to research, learn and become experts at this by reading up and practicing on improving existing projects, which is what I intend to do",
        "ts": "1481066014.000006"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "And down the line, I hope to learn enough to develop sensors and software that monitors rooftop garden projects, alerts maintainers to issues before they become big, and makes beautiful quantifiable data about how carbon is being captured and stormwater filtered.",
        "ts": "1481066242.000007",
        "reactions": [
            {
                "name": "+1::skin-tone-3",
                "users": [
                    "U02918BKW"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "super interesting <@U02F8TTPU> - I'd love to see how this develops and help out wherever I can",
        "ts": "1481069204.000008"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "my interests veer more toward plants than systems, but I have a good feel for the squishy variables of maintenance requirements",
        "ts": "1481069231.000009"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "would love to learn from you <@U0HP6TFNX>, and I'll keep the channel posted as things progress",
        "ts": "1481070304.000010"
    }
]