[
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!here|@here> i’m in the process of catching up on _all_ the exciting happenings.  We have some truly great stuff cooking.  In talking with some of you individually, it feels to me like a regular cadence of meeting will help to keep us aligned as we march towards the Autodesk meeting.  I’m gonna book some stand ups.  Message me directly if you feel this isn’t helpful but I think it’s worth a try.",
        "ts": "1476735555.000010",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U0K8ZSHN0"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "I’m re-reading some docs and the pitch deck now.  \n\nI’m over-simplifying to a degree but our primary ‘sell’ to Autodesk is how PMMC is a community builder.  By extension, how the Shleifer space we have is perfect in it both it’s physical location (Portland, specifically the Central Eastside), it’s history and it’s ability to house all of the equipment which comprise our fabrication, education and certification offerings.  \n\nAccordingly, the area in need of the most emphasis right now is: *can the equipment we need fit into the space we have?*  And while we don’t need to completely solve for it, if it doesn’t all fit, how do we\na) adjust our offerings.  A good example is that we want store as a revenue stream but likely don’t have the sq ftg for it.\nb) plan to scale\/grow over time.",
        "ts": "1476737415.000011"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "I know Felix is working on this but he’s not alone.  <@U0HPGQ4KH>  I booked time for you me and@lee to sync on this in an hour to ensure we’re tight and that you have the insights and support needed.  \n\n<https:\/\/docs.google.com\/a\/uncorkedstudios.com\/presentation\/d\/1epQ7UNI8hvgfFfwpHUHAVBXj4quZYVUH86Z3ftyG388\/edit?usp=sharing>\n- Ensure the contents of slide 26 and 27 are laid out into a floor plan\n- This floor plan will be inserted around [current] Slide 10",
        "ts": "1476737518.000012"
    },
    {
        "type": "message",
        "subtype": "file_share",
        "text": "<@U0ML49XU0|dennishanley> shared a file: <https:\/\/uncorked.slack.com\/files\/dennishanley\/F2LCHLR6J\/pmmcpitchdeck|PMMC Pitch Deck>",
        "file": {
            "id": "F2LCHLR6J",
            "created": 1475786845,
            "timestamp": 1475786845,
            "name": "PMMCPitchDeck",
            "title": "PMMC Pitch Deck",
            "mimetype": "application\/vnd.google-apps.presentation",
            "filetype": "gpres",
            "pretty_type": "GDocs Presentation",
            "user": "U0ML49XU0",
            "editable": false,
            "size": 2848,
            "mode": "external",
            "is_external": true,
            "external_type": "gdrive",
            "is_public": true,
            "public_url_shared": false,
            "display_as_bot": false,
            "username": "",
            "url_private": "https:\/\/docs.google.com\/a\/uncorkedstudios.com\/presentation\/d\/1epQ7UNI8hvgfFfwpHUHAVBXj4quZYVUH86Z3ftyG388\/edit?usp=drivesdk",
            "thumb_64": "https:\/\/slack.com\/img\/files\/gpres_64.v.png",
            "thumb_360": "https:\/\/slack.com\/img\/files\/gpres_360.v.png",
            "thumb_360_w": 360,
            "thumb_360_h": 167,
            "permalink": "https:\/\/uncorked.slack.com\/files\/dennishanley\/F2LCHLR6J\/pmmcpitchdeck",
            "channels": [
                "C0NMH73TR"
            ],
            "groups": [],
            "ims": [],
            "comments_count": 0
        },
        "user": "U0ML49XU0",
        "upload": false,
        "display_as_bot": false,
        "username": "dennishanley",
        "bot_id": null,
        "ts": "1476737519.000013"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "my original link about iphone mfg’ing was wrong",
        "ts": "1476738583.000015"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "i fixed it above, but here is the link again: <http:\/\/atomicdelights.com\/blog\/why-your-next-iphone-wont-be-ceramic>",
        "attachments": [
            {
                "service_name": "Atomic Delights",
                "title": "Why Your Next iPhone Won't be Ceramic",
                "title_link": "http:\/\/atomicdelights.com\/blog\/why-your-next-iphone-wont-be-ceramic",
                "text": "  A few weeks ago, a post on Quora set the Apple echo chamber on fire by theorizing that the next iteration of the iPhone would ditch machined aluminum for ceramic. Underpinning this post was a series of conclusions extrapolated from Apple patent filings that indicate the ID team has been working (in Japan) on some modifications to ceramic slurry casting, as well as an omnibus patent attempting to lay claim to any electronic gadget with a ceramic enclosure. To say that I disagreed with this conclusion would be an understatement (there might have been some snarky back-n-forth on Twitter), but it was difficult to draw a conclusion given the real lack of data. In the intrim however, we have been given a large data point from of Apple's packaging materials from the new ceramic Watch Edition - a small, beautifully printed booklet that details the case manufacturing process. Before we go on though, let me posit something that does not get nearly enough attention in Apple circles:    Apple is a Hardware Company and Machined Aluminum is their Primary Platform At peak production, Apple is manufacturing roughly 1 million iPhones per day. More importantly, every single one of those phones is sculpted to 10 micron tolerances, from a single block of aluminum, as is every Mac, iPad, Watch and many of the accessories. It is difficult to convey to folks without a manufacturing background how insane this is, but let me try.   Your typical phone has a stamped metal frame that gets placed into a mold to have the plastic outside shell injected around it. Total cycle time per phone of perhaps 20 seconds, and it isn't like this makes a chintzy part - the same process is used to make the frame of a Glock. To build a million phone enclosures a day, you would need a few hundred machines and could fit the entire operation into a healthy sized Shenzhen industrial building. You can, of course, add some glitz and finishing processes to gussie up your plastic phone a bit, but those additions don't add very much time.   An iPhone however, starts as a block of aluminum and is faced, milled, drilled, tapped, and de-burred in a bevy of machining operations, getting passed (mostly by hand, but increasingly by robot arm) through a series of mills, each set-up with precision fixtures that hold one side of the phone to face the spindle. Just the interior cavity of an iPhone requires 3-4 minutes of takt time while micro end mills carve out the tiny details and features that the interior components will locate against and fasten to. Just that one operation requires 3000 CNC mills to meet the 1 million per day demand. Add more machines to do the other sides of the phone, plus the crazy high-tech multi-axis lathes that make the buttons, plus production for iPads,and iMacs, and MacBooks, and Watches, and many of the accessories.   A murder of Fanuc Robodrills   This high cycle time is why Apple is the world's largest owner of CNC milling machines and swiss style lathes. Rumors are that the number is around 40,000 with about half dedicated to iPhone production. I've seen pictures of one shop with acres of Fanuc Robodrills making iPhones, and that was only one of about a dozen such facilities. Apple is such a huge buyer of a particular kind of mill (BT30 spindle drill-tap centers) that Fanuc, Brother and DMG Mori each have factories dedicated to building machines exclusively for Apple. This is not a position that happened overnight; it is a capability and scale that could only come about through iterative, strategic, long-term evolution. This started well over a decade ago with the MacBook Air's unibody and has been relentlessly improved, deep partnerships cultivated, and new CNC machining techniques created to achieve the position Apple is in today. In many ways, Apple is far more dedicated to aluminum machining than the company ever was to the PowerPC and switching away will be far more tricky.   Objectified   The simple fact of the matter is, Apple has scaled themselves into a position where any major material change to the iPhone must follow one of three paths: Machine a New Material Similar to the switch from 6061 to \"7000 series\" aluminum, Apple could find a new material that could be swapped into the current manufacturing footprint in a straightforward fashion. 7000 series aluminums machines about 20% slower than 6000 series, so they could absorb a somewhat substantial cycle time hit, but continue to leverage the decade of process knowledge, capital equipment and partnerships they have cultivated. In a way, we see this with the Watch being made from 4 different materials, with 3 of them using very similar processes. Perhaps a new magnesium or titanium alloy? Machined carbon fiber (a trend in the high-end knife world... and I know lots of Apple engineers and ID folks are knife nerds).  A New Material with a Short Cycle Time This is basically the promise of Liquid Metal - essentially a very crazy strong metalic that can be injection molded, but comes out of the mold with all the fine details and beautiful surfaces in one, fast shot. Apple has had this partnership public for many years now with an exclusive license agreement with the Liquid Metal patent holders. They could be working with them, while also working with injection molding equipment makers to build modified\/tuned machinery (::cough::). With this process, Apple would go from 20,000 CNC mills making iPhones, to a few hundred, or perhaps a thousand, highly modified\/specialized\/proprietary injection mold machines. Doing this would be a major undertaking and huge technical achievement, but it is entirely within the capabilities and resources of Apple. A New, High Cycle Time Process and Material The final option, is for Apple to bring a new process online with cycle times similar to the few minutes of machine time required to make the current iPhone. To do this, Apple would need to essentially flip the switch on an investment of roughly the same size of the current, machining footprint. Not only would this be a logistical nightmare, but finding a company to produce that much machinery without 3-4 years of lead time would be almost impossible (as a reference Haas and DMG Mori are neck and neck as the world's largest CNC machine manufacturers, and they each only make about 15,000 a year).   While the sheer scale of that last option might only be fully comprehensible to someone like Horace Dediu, the best argument I can make against it is the Hunt for Red October. In one of the movie's best scenes, the US National Security Council is made aware of a new crisis in Russia when the satellite flyover of their major Atlantic port reveals heat blooms in the engineering compartments of every ship in the fleet. For Apple to bring a whole new long-cycle time process online for the next iPhone (now 10 months from launch), they would need warehouses with thousands of machines already in situ, with thousands more in production. Teams of analysts would have been reporting on such a move for months already.     All of this circles us back to that little booklet that shipped with the ceramic Watch Edition. I think it is a safe bet to say that if Apple was about to leverage a whole new process for the efficient manufacturing of precision ceramics for next year's iPhone, this new Watch model would be a test balloon for at least some of those techniques. Now, it is important to note that Apple has always skillfully knife edged their marketing discussion about manufacturing by being both hyper honest in their descriptions, while being quite vague about the nitty gritty details. So if we can all agree their materials are honest, let me be very plain - there is nothing revolutionary or new about how Apple is making the ceramic Edition watch. The process they describe is meticulously executed, and because of the nature of the design - wherein ceramics are mimicking the engineering layout of far more easily produced materials - probably the mos…",
                "fallback": "Atomic Delights: Why Your Next iPhone Won't be Ceramic",
                "image_url": "http:\/\/static1.squarespace.com\/static\/519b50a5e4b0f9a510a45197\/t\/57fe648d0191c451164300be\/1476289690386\/?format=1000w",
                "from_url": "http:\/\/atomicdelights.com\/blog\/why-your-next-iphone-wont-be-ceramic",
                "image_width": 412,
                "image_height": 250,
                "image_bytes": 55623,
                "service_icon": "http:\/\/atomicdelights.com\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1476738592.000016"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "another Autodesk reference (more direct reference than Pier 9): <http:\/\/www.techshop.ws\/>",
        "attachments": [
            {
                "title": "TechShop is the 1st International Open-Access Workshop -- What Do You Want To Make at TechShop?",
                "title_link": "http:\/\/www.techshop.ws\/",
                "text": "TechShop is a membership-based do-it-yourself workshop that provides members with the use of tools and equipment, classes and a vibrant and creative community of people so they can build the things they have always wanted to make.",
                "fallback": "TechShop is the 1st International Open-Access Workshop -- What Do You Want To Make at TechShop?",
                "from_url": "http:\/\/www.techshop.ws\/",
                "service_icon": "http:\/\/www.techshop.ws\/favicon.png",
                "service_name": "techshop.ws",
                "id": 1
            }
        ],
        "ts": "1476743546.000018"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U0K8ZSHN0> let build upon the capabilities slides to include joinging and finishing.  can ya fit these two on one subsequent slide?",
        "ts": "1476743803.000020"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "<@U0ML49XU0> , good find, but uhhhh, what a bad website",
        "ts": "1476743938.000021"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "welcome back to the web 1.0",
        "ts": "1476743949.000022"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "lol, maybe we could help em :wink: but we’re busy.",
        "ts": "1476743955.000023"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "@dennis i will work on adding a slide",
        "ts": "1476743970.000024"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "thanks man.  ping me when done and we can even tag <@U1HKQRLMR> in to ensure it reads like one voice",
        "ts": "1476744014.000025"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U0K8ZSHN0> or <@U0HPGQ4KH> whats heaviest machine we have?  this? <http:\/\/www.haascnc.com\/mt_spec1.asp?id=VF-3YT&amp;webID=40_TAPER_STD_VMC#gsc.tab=0>",
        "ts": "1476744642.000026"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "waterjet is 8,000lbs lol",
        "ts": "1476744789.000027"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "wow",
        "ts": "1476744796.000028"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "<@U0ML49XU0> done with slides 12\/13",
        "ts": "1476744807.000029"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "thx",
        "ts": "1476744821.000030"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "african forest elephant 6000lbs\nafrican bush elephant 13000lbs\nso just somewhere in between.",
        "ts": "1476745356.000031"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "but how many bananas is that?",
        "ts": "1476745583.000032"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "260000",
        "ts": "1476746979.000033"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!here|@here> quick EOD updates:\n1) just had a good meeting with Beam reviewing Biz Plan.  They want to see our floor plan and maybe engage their architect firm for critical review before AD preso\n2) accordingly, I’m working with the following workback for floorplanning:\nTuesday: Felix review first attempt\nWednesday: Lee and Dennis respond to service offering (assuming e have to cut equipment)\nThursday: Felix makes next iteration\nFriday: group gets together.  Reach out to Beam’s team\n3) We made some updates to the deck.  Marce continues to own decks and spreadsheets",
        "ts": "1476747239.000034"
    },
    {
        "type": "message",
        "subtype": "pinned_item",
        "user": "U0ML49XU0",
        "item_type": "C",
        "attachments": [
            {
                "fallback": "[October 17th, 2016 4:33 PM] dennishanley: <!here|@here> quick EOD updates:\n1) just had a good meeting with Beam reviewing Biz Plan.  They want to see our floor plan and maybe engage their architect firm for critical review before AD preso\n2) accordingly, I’m working with the following workback for floorplanning:\nTuesday: Felix review first attempt\nWednesday: Lee and Dennis respond to service offering (assuming e have to cut equipment)\nThursday: Felix makes next iteration\nFriday: group gets together.  Reach out to Beam’s team\n3) We made some updates to the deck.  Marce continues to own decks and spreadsheets",
                "ts": "1476747239.000034",
                "author_subname": "dennishanley",
                "channel_id": "C0NMH73TR",
                "channel_name": "pmmc",
                "is_msg_unfurl": true,
                "text": "<!here|@here> quick EOD updates:\n1) just had a good meeting with Beam reviewing Biz Plan.  They want to see our floor plan and maybe engage their architect firm for critical review before AD preso\n2) accordingly, I’m working with the following workback for floorplanning:\nTuesday: Felix review first attempt\nWednesday: Lee and Dennis respond to service offering (assuming e have to cut equipment)\nThursday: Felix makes next iteration\nFriday: group gets together.  Reach out to Beam’s team\n3) We made some updates to the deck.  Marce continues to own decks and spreadsheets",
                "author_name": "Dennis Hanley",
                "author_link": "https:\/\/uncorked.slack.com\/team\/dennishanley",
                "author_icon": "https:\/\/avatars.slack-edge.com\/2016-04-18\/35743045558_3d966a553c691fbdd182_48.jpg",
                "mrkdwn_in": [
                    "text"
                ]
            }
        ],
        "text": "<@U0ML49XU0|dennishanley> pinned a message to this channel.",
        "ts": "1476747245.000035"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Note to me and Dennis. Let's set up time on Friday to check out the zgf shop n",
        "ts": "1476752685.000036"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "That'd be rad",
        "ts": "1476753656.000037"
    }
]