[
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "missing standup: running work errand",
        "ts": "1479834838.000002"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "word",
        "ts": "1479835844.000003"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U0K8ZSHN0> would you benefit from meeting?  if not, canning it and booking robert pety at 1pm",
        "ts": "1479835855.000004"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "For today’s hh: Michale McSherry who is the Product Manager for ECAD+MCAD, Kevin Schneider, and two developers from the UK who wrote a buch of ecad\/IOT\/mcad software for us and previously solidworks.",
        "ts": "1479844087.000005"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Awesome, thanks for sharing. Lee and I were doing some warm up around this before. ",
        "ts": "1479845122.000006"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "good info - thanks",
        "ts": "1479845372.000007"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "Had a chat with Robert, going through his thinking. Good stuff here. Big take away for me. 3rd floor is working for him - 1st and 2nd - interesting thoughts around flow and machine location … \n\nChallenge we face: Consider a very functional Layout but keep in mind the look and feel of a professional space that you want to work in. (Please correct me here if I’m wrong in my assumptions)\n\nWill try to get to some PMMC work\/space-planning  next week and see what can be done to implement Roberts suggestions. What seems obvious is getting input from architects that have experience with these kind of places (I remember that <@U02E3CRMA> ’s brother is working in this area?)\n\nRobert is available next week apart from Thu\/Fri and the week after for more input if needed. He also mentioned for <@U026NB2U2> to weigh in with ideas (based on previous conversations around layout and flow …)\n\nCheers to <@U02F8LF2X> and <@U0H4SJN11> for joining the call and the discussion.",
        "ts": "1479852459.000008"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Thanks <@U0HPGQ4KH>  Yes we want to keep floor streamlined and 'modern' as far as manufacturing goes though let's not over emphasize this: primary goal is to make stuff. I think the drawings thus far as well considered in terms of discipline, grouping and flow but it's good to have additional ideas and perspectives. ",
        "ts": "1479853350.000009"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Would you be open to sharing out ideas before you execute them as drawings next time you sit down on this? ",
        "ts": "1479853379.000010"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "<http:\/\/Ecad.io|Ecad.io>",
        "ts": "1479862518.000011"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Blue Ridge Numerics",
        "ts": "1479865921.000012"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "Happy to share prelim plans before going deeper ... and Marce mentioned that going deeper is not needed for the 30th November ... <@U026NB2U2> please correct me if I am mistaken. ",
        "ts": "1479867380.000013"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "I think we are good with fidelity for the 30th ",
        "ts": "1479868506.000014"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Agree. Kevin is going to confirm the 11\/30 meeting tomorrow. He thinks there's a chance it gets bumped to mid December. ",
        "ts": "1479874782.000015"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<@U0HPGQ4KH> Yes, exactly the work he's doing with Arrow Street (<http:\/\/www.arrowstreet.com\/>) in Boston. I'd be happy to connect you two.",
        "attachments": [
            {
                "title": "Arrowstreet – Architecture &amp; Design",
                "title_link": "http:\/\/www.arrowstreet.com\/",
                "text": "Architecture &amp; Design",
                "fallback": "Arrowstreet – Architecture &amp; Design",
                "from_url": "http:\/\/www.arrowstreet.com\/",
                "service_name": "arrowstreet.com",
                "id": 1
            }
        ],
        "ts": "1479880863.000016"
    }
]