[
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": ":+1::skin-tone-3::+1::skin-tone-3::+1::skin-tone-3:",
        "ts": "1476468738.000016"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<@U0K8ZSHN0> and I just had a great chat with Dennis Veatch (Industrial Designer and manufacturing expert)\nTL;DR: really excited about the entire concept and implementation ideas. He’s interested in potential investment or partnership with PMMC to level-up his business. He’d be an excellent advisor for the current phase of the process.",
        "ts": "1476472991.000017"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "next step is to reconnect him with <@U026NB2U2> and team to have a more detailed discussion around business model and what his involvement might look like",
        "ts": "1476473030.000018"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "Lee took good notes, so he has the action item to send them to the channel",
        "ts": "1476473067.000019"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "Notes from our meeting with Dennis Veatch:\n- Packaging aspect is most often forgotten in product design, can consume 15-20% of BOM\n- Overseas manufacturing can be costly due to unexpected secondary and tertiary costs\n- He will try to get us a tour of manufacturing floor of Triad Speakers\n- A lot of manufacturing is being “reshored” due to implementation of lean manufacturing (aka Kaizen the Toyota mfg methodology)\n- Selective Laser Sintered parts or 80-90% as strong as injected molded parts (from his recent experience)\n- We should look into the Freelancers Union as potential partner for PMMC\n- Reduced friction around operation of machinery is the key to effective use of machines (read: need expert operator(s))\n- Ideal desk share day for him: coffee -&gt; light social interaction -&gt; desk with connectivity -&gt; place to meet incoming customer where presentation can be shown -&gt; ability to point out PMMC partnerships in mfg plan -&gt; work on 3D model and book time with trusted operator to produce (trusted implies high confidence in quality output) -&gt; confer with battery life expert about effect on industrial design -&gt; bookkeeping service takes care of costing out to different resources within PMMC (batt expert, SLS operator, IP legal services, etc.)",
        "ts": "1476477373.000020"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "happy to explain any bullet notes that might be unclear",
        "ts": "1476477423.000021"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Awesome. ",
        "ts": "1476480191.000022"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "Also of note, the educational aspect really struck a chord with Dennis. This is the one aspect I love most about Portland vs. my experience with LA\/SF people. People here seem to care about community",
        "ts": "1476481367.000023"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "i like dennis",
        "ts": "1476482373.000024"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Stuck out with Robert from zgf as well. ",
        "ts": "1476485751.000025"
    }
]