[
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "<https:\/\/techcrunch.com\/2017\/01\/06\/the-markforged-metal-x-prints-real-metal-parts\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "The Markforged Metal X prints real metal parts",
                "title_link": "https:\/\/techcrunch.com\/2017\/01\/06\/the-markforged-metal-x-prints-real-metal-parts\/",
                "author_name": "John Biggs",
                "thumb_url": "https:\/\/i1.wp.com\/tctechcrunch2011.files.wordpress.com\/2017\/01\/screen-shot-2017-01-06-at-12-27-34-pm.png?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 87,
                "text": "The new Markforged Metal X is pretty great. It is a full metal 3D printer that generates real metal parts out of powdered metal which is then hardened under massive heat and allows for amazingly strong and light materials.\nThe printer uses tubes of powered metal bound with plastic. The &ldquo;extruder&rdquo; first creates the shapes on a regular build plate and then you bond the material in a small furnace. This reduces the size of the object but the printer can scan the objects it builds and assess the shrinkage associated with the heating process so it can automatically improve the design on the fly.\n\t\n\t\t\n\t\t\nThe company calls its new technology Atomic Diffusion Additive Manufacturing or ADAM. The system allows for very unique design features including the ability to add honeycomb internal structures to lower the weight of parts.\n&ldquo;Customers will use it for end use parts in volumes up to 1000 a year,&rdquo; said Greg Mark, founder. &ldquo;This is a killer app for big companies that need to support a 50-years-old fleets of gear around the world.&rdquo;\nThe build volume is 200x200x250mm and has a 50 micron layer height. The objects that come out of this machine are nearly indistinguishable from cast parts and they are amazingly strong.\nThe machine can print the following metals:\n17-4 Stainless Steel\n303 Stainless Steel\n6061 Aluminum (Beta)\n7075 Aluminum (Beta)\nA-2 Tool Steel (Beta)\nD-2 Tool Steel (Beta)\nIN Alloy (Inconel) 625 (Beta)\nTitanium Ti-6Al-4V (Beta)\nThe &ldquo;beta&rdquo; materials aren&rsquo;t yet in production but they will be soon. The team at Markforged is actually rebuilding a motorcycle from scratch using the machine and have already begin with a few non-structural parts. The plan is to offer the product not as a way to build final products but to create projects and molds for cast and injection molded items.\nEverything about this printer is amazing except, I suspect, the price. At $99,000 you won&rsquo;t be installing this in the basement just yet but it&rsquo;s great to know that something like this exists &ndash; and will soon be spooling out metal parts at quite a clip.",
                "fallback": "TechCrunch Link: The Markforged Metal X prints real metal&nbsp;parts",
                "from_url": "https:\/\/techcrunch.com\/2017\/01\/06\/the-markforged-metal-x-prints-real-metal-parts\/",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/techcrunch-2013\/assets\/images\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1483744194.000004"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "maybe we can get one of these too...",
        "ts": "1483744200.000006",
        "reactions": [
            {
                "name": "+1::skin-tone-3",
                "users": [
                    "U0HPGQ4KH"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "63 + contacts.  nice!  also, moved to our folder to keep us organized (sorry for friday alerts, im stuck in n airport, trying to catch up) \n\n<https:\/\/drive.google.com\/open?id=0B2hvp3pmOYCFdG4tZ0pnUzlia2M>",
        "ts": "1483767218.000007"
    }
]