[
    {
        "type": "message",
        "user": "U0XJFPSRL",
        "text": "<@U0B9N0HF0> <@U0HP6TFNX> Let me know when you think the InVision is in a good enough spot for me to make PDF export for our permanent files",
        "ts": "1489596465.736385"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "thanks elise, I haven't had a chance to look yet. one question just scanning quickly, did we capture the wall design and logic anywhere yet?",
        "ts": "1489596540.765118"
    },
    {
        "type": "message",
        "user": "U0XJFPSRL",
        "text": "Logic is captured in annotation mainly focused on podium interactions. Based on Dennis’ reaction to the prototype, it seemed like this format captured the goal he was after. Happy to rethink how wall design could fit into this if that’s the end goal!",
        "ts": "1489597356.092748"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "I'd like to capture the wall as well",
        "ts": "1489597561.173893"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "yeah and to that point, i think it works within this invision model. understanding when attract mode plays and what inititative, story and story detail content maps to which display (with final creative) rounds this out nicely",
        "ts": "1489597744.246202"
    },
    {
        "type": "message",
        "user": "U0XJFPSRL",
        "text": "Sounds good",
        "ts": "1489598354.479669"
    },
    {
        "type": "message",
        "user": "U0XJFPSRL",
        "text": "Are we thinking this would be covered by additional annotations? Or another prototype that uses more visuals to describing wall positioning etc",
        "ts": "1489598439.511828"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "I think we should capture the actual visual states with comps rather than annotations",
        "ts": "1489598467.522152"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "so in other words, another another",
        "ts": "1489598484.528557"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "another prototype",
        "ts": "1489598489.530492"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "not screen addiitons to this prototype?  i mean i guess it doesnt matter, i thought it could just live under one project",
        "ts": "1489598519.541776"
    },
    {
        "type": "message",
        "user": "U0XJFPSRL",
        "text": "Hm. How would the podium screens be connected to the wall screens if they lived under one prototype?",
        "ts": "1489598669.598751"
    },
    {
        "type": "message",
        "user": "U0XJFPSRL",
        "text": "I could build it within the same prototype, but I don’t know how they would be linked",
        "ts": "1489598764.635185"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "I'm not totally sure. <@U0XJFPSRL> should we brainstorm some ideas?",
        "ts": "1489598766.635591"
    },
    {
        "type": "message",
        "user": "U0XJFPSRL",
        "text": "Yea, if you have a few moments that would be great",
        "ts": "1489598775.639029"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "well just because the screens live within the project doesn’t mean they have to be linked via the actual podium click thrus, right?  Ultumately, I defer to y’all, I just want to ensure we have easy access to the information afterwards, spreading across two discrete URLs makes it easier to lose track of down the line.  So if we go that route, ability to export would help",
        "ts": "1489598828.659586"
    }
]