[
    {
        "user": "U026E0ZNR",
        "text": "<@U026E0ZNR|trent> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1480997591.000002"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "It's been what, nearly a month now since the orange shit hit the fan? After fighting off super uncomfortable political conversations with family over Thanksgiving and finally feeling ready to move beyond the daily sensations of anxiety and uncertainty, I'm feeling ready to move forward with purpose in what currently feels like an insurmountable mess. I say this because I read an article by Mike Monteiro, that a) cranked the anxiety levels back up a few notches with his \"We are truly fucked\" sentiment if I'm being honest, but b) gave some really practical, digestible advice on taking action that I've found to reverberate day's later (not common for me) and give actual hope. \n\n```Fix yourself. Fix your house. Fix your street. Fix your neighborhood. Fix your city. Fix your state. Fix your country. That’s the order to work in. Start small and work up. ```\n\nHis tone is a bit dramatic and kinda stresses me out tbh but I say it's worth the read: <https:\/\/deardesignstudent.com\/how-to-fight-fascism-dabdfeab1830#.pcfdgwvxo>",
        "attachments": [
            {
                "service_name": "Dear Design Student",
                "title": "How To Fight Fascism",
                "title_link": "https:\/\/deardesignstudent.com\/how-to-fight-fascism-dabdfeab1830#.pcfdgwvxo",
                "text": "We are truly fucked. We’re standing at the very edge of the American experiment. I can’t blame you for not wanting to take that next step.",
                "fallback": "Dear Design Student: How To Fight Fascism",
                "image_url": "https:\/\/d262ilb51hltx0.cloudfront.net\/max\/1200\/1*pYJU-Ux2x9NDhWrmPbdS_g.gif",
                "fields": [
                    {
                        "title": "Reading time",
                        "value": "9 min read",
                        "short": true
                    }
                ],
                "ts": 1480550738,
                "from_url": "https:\/\/deardesignstudent.com\/how-to-fight-fascism-dabdfeab1830#.pcfdgwvxo",
                "image_width": 761,
                "image_height": 250,
                "image_bytes": 451415,
                "service_icon": "https:\/\/d262ilb51hltx0.cloudfront.net\/fit\/c\/152\/152\/1*DgBfTDX9b1pnS_Vc63Ql7w.png",
                "id": 1
            }
        ],
        "ts": "1480998992.000004"
    }
]