[
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "<https:\/\/medium.com\/@nicholasjohnston_40654\/help-us-rethink-the-future-of-media-9f5960f3a4ea#.loidks6zx>",
        "attachments": [
            {
                "service_name": "Medium",
                "title": "Help Us Rethink the Future of Media",
                "title_link": "https:\/\/medium.com\/@nicholasjohnston_40654\/help-us-rethink-the-future-of-media-9f5960f3a4ea#.loidks6zx",
                "text": "For the past couple of months, a group of us has been thinking about the future of news: how it will be produced, consumed and distributed…",
                "fallback": "Medium: Help Us Rethink the Future of Media",
                "image_url": "https:\/\/d262ilb51hltx0.cloudfront.net\/max\/1200\/1*JKkkCeHRUpmPQDEwszm62A.jpeg",
                "fields": [
                    {
                        "title": "Reading time",
                        "value": "2 min read",
                        "short": true
                    }
                ],
                "ts": 1473257768,
                "from_url": "https:\/\/medium.com\/@nicholasjohnston_40654\/help-us-rethink-the-future-of-media-9f5960f3a4ea#.loidks6zx",
                "image_width": 500,
                "image_height": 250,
                "image_bytes": 111808,
                "service_icon": "https:\/\/d262ilb51hltx0.cloudfront.net\/proxy\/1*Akq8aSfZqfW1fceMxKqBZA.png",
                "id": 1
            }
        ],
        "ts": "1479766764.000405",
        "reactions": [
            {
                "name": "heart",
                "users": [
                    "U2X0KKTGT",
                    "U2DTF0B6Y",
                    "U02E3CRMA"
                ],
                "count": 3
            }
        ]
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "From Mike \"they brought on Alexis Lloyd from NYT’s R&amp;D lab and she’s really freakin awesome\"",
        "ts": "1479766790.000407"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "fascinated by this",
        "ts": "1479767015.000408"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "I want more out of that post, but if they’re adding smart people, that’s a start",
        "ts": "1479767029.000409"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "fixing journalism seems like a top 3 issue to me in this country",
        "ts": "1479767192.000410"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "<@U0260V4K1> exactly. What does not being unencumbered by the old way of things mean? A totally new business model? Because right now, the business models attached to the attention economy (subscriptions and ads) don’t really work",
        "ts": "1479768055.000411"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "However, I would :heart: to see something work!",
        "ts": "1479768117.000412"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "I'd like to see something truly novel. Easier said that done, but just off the top of my head, subsidize the cost of the news with some other ancillary good, something like a coffee chain that gives you a \"newspaper\" with the purchase of your coffee.  ",
        "ts": "1479769009.000413"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Pretty sure that wouldn't work either because What needs to be solved is the core problem that has existed with the attention economy since atleast the NY sun in 1834: that people are attracted to crap. So you need to trick them.",
        "ts": "1479769260.000414"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Been reading this book about attention economy. Super fascinating. <https:\/\/www.amazon.com\/Attention-Merchants-Scramble-Inside-Heads\/dp\/0385352018>",
        "ts": "1479769957.000415"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U0B9N0HF0> can i borrow that when done?",
        "ts": "1479772768.000416"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "It’s on Kindle :confused:",
        "ts": "1479772789.000417"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "I have his first book though, The Master Switch <https:\/\/www.amazon.com\/Master-Switch-Rise-Information-Empires\/dp\/0307390993> on paperback",
        "ts": "1479772839.000418"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Super interesting read too",
        "ts": "1479772865.000419"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "but continuing on that thought <@U0B9N0HF0> - the biggest issue I see with a lot of the thinking about new journalism, is that it doesn’t take into account the cultural realities that broke it in the first place",
        "ts": "1479772937.000420"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "it’s often treated like social arithmetic than calculus",
        "ts": "1479772973.000421"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Agreed. It’s interesting to note that the “golden age” of journalism (which existed just about the same time as the golden age of everything Post-WWII-early 1970s) didn’t have any competition, so people kinda had to go with the good stuff. But the minute that Ted Turner launched cable (and with it CNN) “good journalism” has been a downward trend because lots of people don’t want good journalism.",
        "ts": "1479773232.000422"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "agreed - though what I find makes it complex is that it’s not all bad",
        "ts": "1479773287.000423"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "centralized media often gave us higher quality journalism, but it also served as a gatekeeper, and often kept out unpopular voices",
        "ts": "1479773339.000424"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "decentralized media gives more people more of a voice, but also gave us a normalized donald trump",
        "ts": "1479773389.000425"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "The Robert Putnam books arrived. ",
        "ts": "1479773437.000426"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "At Kate's desk if anyone wants to grab them tonight. ",
        "ts": "1479773451.000427"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "years ago I got into a huge fight with Andrew Keen over the role of centralized media in preserving or limiting the quality of journalism",
        "ts": "1479773463.000428"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Met with Jason Little from Rep. Blumenauer's office. Shared what we're up to and talked for quite a bit about the role of journalism. ",
        "ts": "1479773490.000429"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "What’d he have to say? Super curious because I think so much of this has to do with who is in power and the individuals definition of truth. I remember back in 06’ when Bush was prez, this book came out and I swallowed it up whole (<https:\/\/www.amazon.com\/Crashing-Gate-Netroots-Grassroots-People-Powered\/dp\/1931498997>), but now the central premise of the book is what has empowered the rise of the new nazi party",
        "ts": "1479773644.000430"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Also, what was your side in that fight <@U0260V4K1>?",
        "ts": "1479773797.000431"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "well - in spite of everything - I think nostalgia is never a good path forward",
        "ts": "1479773861.000432"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "so as much as I think things are broken, I don’t think going back to the way they were is the solution",
        "ts": "1479773879.000433"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "it’s the same argument I used to get into with people in the music industry when I worked with Dave Allen - I think people who are nostalgic for the past are the people for whom the past worked out",
        "ts": "1479773946.000434"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "which isn’t most people",
        "ts": "1479773950.000435"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "also - Andrew Keen is an asshole",
        "ts": "1479773961.000436"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Haha! Agreed. Also, there is a whole host of memory bias out there (<https:\/\/en.wikipedia.org\/wiki\/List_of_memory_biases>) that make peoples recollection for the past, fundamentally flawed. Such as remembering a vacation to be amazing even though you were miserable the whole time. It’s a nice survival trait, especially for social animals, but going back is definitely not a good path forward.",
        "attachments": [
            {
                "image_url": "https:\/\/upload.wikimedia.org\/wikipedia\/commons\/7\/73\/Nicolas_P._Rougier%27s_rendering_of_the_human_brain.png",
                "image_width": 800,
                "image_height": 600,
                "image_bytes": 346922,
                "title": "List of memory biases",
                "title_link": "https:\/\/en.wikipedia.org\/wiki\/List_of_memory_biases",
                "author_name": "Wikipedia",
                "author_link": "http:\/\/en.wikipedia.org\/",
                "text": "In psychology and cognitive science, a memory bias is a cognitive bias that either enhances or impairs the recall of a memory (either the chances that the memory will be recalled at all, or the amount of time it takes for it to be recalled, or both), or that alters the content of a reported memory. There are many different types of memory biases, including:\nChange bias: after an investment of effort in producing change, remembering one's past performance as more difficult than it actually was.\nChildhood amnesia: the retention of few memories from before the age of four.\nChoice-supportive bias: remembering chosen options as having been better than rejected options (Mather, Shafir &amp; Johnson, 2000)\nConfirmation bias: the tendency to search for, interpret, or recall information in a way that confirms one's beliefs or hypotheses.\nConservatism or Regressive bias: tendency to remember high values and high likelihoods\/probabilities\/frequencies lower than they actually were and low ones higher than they actually were. Based on the evidence, memories are not extreme enough.\nConsistency bias: incorrectly remembering one's past attitudes and behaviour as resembling present attitudes and behaviour.\nContext effect: that cognition and memory are dependent on context, such that out-of-context memories are more difficult to retrieve than in-context memories (e.g., recall time and accuracy for a work-related memory will be lower at home, and vice versa).\nCryptomnesia: a form of misattribution where a memory is mistaken for imagination, because there is no subjective experience of it being a memory.\nEgocentric bias: recalling the past in a self-serving manner, e.g., remembering one's exam grades as being better than they were, or remembering a caught fish as bigger than it really was.\nFading affect bias: a bias in which the emotion associated with unpleasant memories fades more quickly than the emotion associated with positive events.\nGeneration effect (Self-generation effect): that self-generated information is remembered best. For instance, people are better able to recall memories of statements that they have generated than similar statements generated by others.\nGender differences in eyewitness memory: the tendency for a witness to remember more details about someone of the same gender.\nHindsight bias: the inclination to see past events as being predictable; also called the \"I-knew-it-all-along\" effect.\nHumor effect: that humorous items are more easily remembered than non-humorous ones, which might be explained by the distinctiveness of humor, the increased cognitive processing time to understand the humor, or the emotional arousal caused by the humor.\nIllusion-of-truth effect: that people are more likely to identify as true statements those they have previously heard (even if they cannot consciously remember having heard them), regardless of the actual validity of the statement. In other words, a person is more likely to believe a familiar statement than an unfamiliar one.\nIllusory correlation: inaccurately seeing a relationship between two events related by coincidence.\nLag effect: see spacing effect.\nLeveling and Sharpening: memory distortions introduced by the loss of details in a recollection over time, often concurrent with sharpening or selective recollection of certain details that take on exaggerated significance in relation to the details or aspects of the experience lost through leveling. Both biases may be reinforced over time, and by repeated recollection or re-telling of a memory.\nLevels-of-processing effect: that different methods of encoding information into memory have different levels of effectiveness (Craik &amp; Lockhart, 1972).\nList-length effect: a smaller percentage of items are remembered in a longer list, but as the length of the list increases, the absolute number of items remembered increases as well.\nMemory inhibition: that being shown some items from a list makes it harder to retrieve the other items (e.g., Slamecka, 1968).\nMisattribution of memory: when information is retained in memory but the source of the memory is forgotten. One of Schacter's (1999) Seven Sins of Memory, Misattribution was divided into Source Confusion, Cryptomnesia and False Recall\/False Recognition.\nMisinformation effect: that misinformation affects people's reports of their own memory.\nModality effect: that memory recall is higher for the last items of a list when the list items were received via speech than when they were received via writing.\nMood congruent memory bias: the improved recall of information congruent with one's current mood.\nNext-in-line effect: that a person in a group has diminished recall for the words of others who spoke immediately before or after this person.\nPeak-end rule: that people seem to perceive not the sum of an experience but the average of how it was at its peak (e.g. pleasant or unpleasant) and how it ended.\nPersistence: the unwanted recurrence of memories of a traumatic event.\nPicture superiority effect: that concepts are much more likely to be remembered experientially if they are presented in picture form than if they are presented in word form.\nPlacement bias: tendency to remember ourselves to be better than others at tasks at which we rate ourselves above average (also Illusory superiority or Better-than-average effect) and tendency to remember ourselves to be worse than others at tasks at which we rate ourselves below average (also Worse-than-average effect).\nPositivity effect: that older adults favor positive over negative information in their memories.\nPrimacy effect, Recency effect &amp; Serial position effect: that items near the end of a list are the easiest to recall, followed by the items at the beginning of a list; items in the middle are the least likely to be remembered.\nProcessing difficulty effect.\nReminiscence bump: the recalling of more personal events from adolescence and early adulthood than personal events from other lifetime periods (Rubin, Wetzler &amp; Nebes, 1986; Rubin, Rahhal &amp; Poon, 1998).\nRosy retrospection: the remembering of the past as having been better than it really was.\nSaying is Believing effect: Communicating a socially tuned message to an audience can lead to a bias of identifying the tuned message as one's own thoughts.\nSelf-reference effect: the phenomena that memories encoded with relation to the self are better recalled than similar information encoded otherwise.\nSelf-serving bias: perceiving oneself responsible for desirable outcomes but not responsible for undesirable ones.\nSource confusion: misattributing the source of a memory, e.g. misremembering that one saw an event personally when actually it was seen on television.\nSpacing effect: that information is better recalled if exposure to it is repeated over a longer span of time.\nStereotypical bias: memory distorted towards stereotypes (e.g. racial or gender), e.g. \"black-sounding\" names being misremembered as names of criminals.\nSubadditivity effect: the tendency to estimate that the likelihood of a remembered event is less than the sum of its (more than two) mutually exclusive components.\nSuffix effect: the weakening of the recency effect in the case that an item is appended to the list that the subject is not required to recall (Morton, Crowder &amp; Prussin, 1971).\nSuggestibility: a form of misattribution where ideas suggested by a questioner are mistaken for memory.\nTelescoping effect: the tendency to displace recent events backward in time and remote events forward in time, so that recent events appear more remote, and remote events, more recent.\nTesting effect: that frequent testing of material that has been committed to memory improves memory recall.\nTip of the tongue: when a subject is able to recall parts of an item, or related information, but is frustratingly unable to recall the whole item. This is thought to be an instance of \"blocking\" where multiple similar memories are being recalled and interfere with each…",
                "fallback": "wikipedia: List of memory biases",
                "service_icon": "https:\/\/a.slack-edge.com\/05c7\/img\/unfurl_icons\/wikipedia.png",
                "id": 1
            }
        ],
        "ts": "1479774398.000437"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "<@U0260V4K1> did you watch the memberries south park episode?",
        "ts": "1479774593.000439"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "I did not",
        "ts": "1479774613.000440"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "worth it?",
        "ts": "1479774616.000441"
    },
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "So worth it.",
        "ts": "1479775009.000442"
    },
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "<@U0260V4K1>",
        "ts": "1479775012.000443"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Pretty right on the nose about what we are talking about here",
        "ts": "1479775024.000444"
    }
]