[
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "<https:\/\/siliconflorist.com\/2017\/02\/22\/looking-to-get-more-involved-in-politics-tech-for-campaigns-may-be-just-what-you-needed\/>",
        "attachments": [
            {
                "service_name": "Silicon Florist",
                "service_url": "http:\/\/siliconflorist.com",
                "title": "Looking to get more involved in politics? Tech for Campaigns may be just what you need",
                "title_link": "https:\/\/siliconflorist.com\/2017\/02\/22\/looking-to-get-more-involved-in-politics-tech-for-campaigns-may-be-just-what-you-needed\/",
                "author_name": "Rick Turoczy",
                "author_link": "https:\/\/siliconflorist.com\/author\/turoczy\/",
                "text": "With the current political climate, more and more folks are seeking ways to get involved in politics. To help, a number of solutions are coming to the fore&mdash;or getting renewed attention&mdash;as they work to get folks connected to the resources they need. If you&rsquo;re interested in running for office, you should check out Run for Office. But if you&rsquo;re more interested in helping politicians from behind the scenes, Tech for Campaigns may be more your speed. \nYou get hacking for good. It&rsquo;s part of the whole ethos around here. Now you can put that creativity to work helping campaigns that need your skills. And they don&rsquo;t just need developers. Analytics, performance marketing, customer success, engineering, inside sales&mdash;pretty much anyone can participate. Best of all? It allows you to contribute in non-monetary ways that likely have more impact than a campaign contribution.\nMany in the tech industry have indispensable skills that non-presidential and down-ticket campaigns find hard to access, even at the volunteer level &ndash; like cutting edge performance and social marketing, data analysts and science, engineers and many more.\nAt the same time, many members of the tech community are craving a way to get involved beyond their pocket books and haven&rsquo;t found an ongoing means to help campaigns both in their backyard and all over the U.S. In addition to money, our skilled time can be extremely valuable &ndash; if only those campaigns could access it.\nConnecting these two groups &ndash; volunteers and campaigns- can help fix this skill shortfall in these campaigns and achieve better outcomes.\nWith more than 1500 folks already on board, Tech for Campaigns has developed a following of everyone from executive leadership to individual contributors. And now, they&rsquo;re looking to the Portland tech community to get involved. (NOTE: This is where you come in.) \nThey&rsquo;ve made it simple for you to help. Just sign up to contribute and they&rsquo;ll get to work, finding the campaigns that need help and connecting the dots. And if you&rsquo;re one of the campaigns that need help&hellip;? Tech for Campaigns can help there, too.\nI&rsquo;m looking forward to seeing where this goes.\nFor more information or to sign up, visit Tech for Campaigns.",
                "fallback": "Silicon Florist Link: Looking to get more involved in politics? Tech for Campaigns may be just what you&nbsp;need",
                "from_url": "https:\/\/siliconflorist.com\/2017\/02\/22\/looking-to-get-more-involved-in-politics-tech-for-campaigns-may-be-just-what-you-needed\/",
                "service_icon": "https:\/\/siliconflorist.files.wordpress.com\/2017\/02\/silicon-florist-rose.jpg?w=180",
                "id": 1
            }
        ],
        "ts": "1487786408.298807"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "this just got unruly: <https:\/\/www.youtube.com\/watch?v=KyFa4FIcDo0>",
        "attachments": [
            {
                "service_name": "YouTube",
                "service_url": "https:\/\/www.youtube.com\/",
                "title": "Senator Tom Cotton | Town Hall Event",
                "title_link": "https:\/\/www.youtube.com\/watch?v=KyFa4FIcDo0",
                "author_name": "Springdale Public Schools",
                "author_link": "https:\/\/www.youtube.com\/user\/SpringdaleSchoolsTV",
                "fallback": "YouTube Video: Senator Tom Cotton | Town Hall Event",
                "video_html": "<iframe width=\"400\" height=\"225\" src=\"https:\/\/www.youtube.com\/embed\/KyFa4FIcDo0?feature=oembed&autoplay=1&iv_load_policy=3\" frameborder=\"0\" allowfullscreen><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "from_url": "https:\/\/www.youtube.com\/watch?v=KyFa4FIcDo0",
                "service_icon": "https:\/\/a.slack-edge.com\/2089\/img\/unfurl_icons\/youtube.png",
                "id": 1
            }
        ],
        "ts": "1487806694.106049"
    },
    {
        "type": "message",
        "user": "U051P3FPY",
        "text": "that live chat is infuriating",
        "ts": "1487808929.162512"
    }
]