[
    {
        "type": "message",
        "user": "U2DTF0B6Y",
        "text": "<https:\/\/www.eventbrite.com\/e\/pdxwit-action-history-of-activism-workshop-tickets-33211934791?utm_source=PDXWIT&amp;utm_campaign=d3d37fe9d8-EMAIL_CAMPAIGN_2016_11_15&amp;utm_medium=email&amp;utm_term=0_f09b66a085-d3d37fe9d8-127586093>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "PDXWIT #Action History of Activism Workshop",
                "title_link": "https:\/\/www.eventbrite.com\/e\/pdxwit-action-history-of-activism-workshop-tickets-33211934791?utm_source=PDXWIT&utm_campaign=d3d37fe9d8-EMAIL_CAMPAIGN_2016_11_15&utm_medium=email&utm_term=0_f09b66a085-d3d37fe9d8-127586093",
                "text": "We started PDXWIT #Action in January to help our community get involved in the issues we care about. In May, we are holding a workshop with organizer Natalie Sundeleaf Sept to help give us historical context for our work moving forward.  This workshop provides a framework for how to organize and create momentum for social justice in their community. It’s for anyone, from the curious beginner to the established organizer. The content is an overview of activism and organizing in America, including what worked or didn’t work, where we are now and what we see both locally and nationally. The workshop includes an interactive lecture and also discussion. Agenda: 5:30 - 6:00 Networking 6:00 - 7:30 Workshop Natalie Sundeleaf Sept is a sixth generation Oregonian with broad ties to the political and art communities of Portland. Her work includes time with Congresswoman Bonamici and Commissioner Fish, as well as President Obama’s 2008 campaign. She was most recently an advance staffer for Hillary Clinton. She is a trained painter and splits her time at community events and in the studio. Her art maintains a civic lens and received local fame for the Dishwasher Project in 2013. When she's not painting or organizing, she's running, hiking or watching basketball.  PDXWIT is a community-based non-profit organization. Our purpose is to strengthen the Portland women in tech community by offering educational programs, partnerships, mentorships, resources and opportunities. We are unifying a supportive environment for current and potential women in tech, all of whom are committed to helping each other. Our goal is to bring together and empower women in tech and to encourage others to pursue tech careers. This is our step towards reducing the gender imbalance in the industry and addressing the current negative effects of that imbalance on women. Trans and non-binary people are always welcome at our events.",
                "fallback": "Eventbrite: PDXWIT #Action History of Activism Workshop",
                "image_url": "https:\/\/img.evbuc.com\/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F29748983%2F36969100812%2F1%2Foriginal.jpg?w=1000&rect=0%2C156%2C504%2C252&s=b7d56dabbd255f7b3d19b0d9596f57eb",
                "fields": [
                    {
                        "title": "Where",
                        "value": "808 Southwest 3rd Avenue Suite 800, Portland, OR 97204",
                        "short": true
                    },
                    {
                        "title": "When",
                        "value": "Tue, May 30, 2017 at 5:30 PM",
                        "short": true
                    }
                ],
                "from_url": "https:\/\/www.eventbrite.com\/e\/pdxwit-action-history-of-activism-workshop-tickets-33211934791?utm_source=PDXWIT&utm_campaign=d3d37fe9d8-EMAIL_CAMPAIGN_2016_11_15&utm_medium=email&utm_term=0_f09b66a085-d3d37fe9d8-127586093",
                "image_width": 500,
                "image_height": 250,
                "image_bytes": 62678,
                "service_icon": "https:\/\/cdn.evbstatic.com\/s3-build\/perm_001\/1aab42\/django\/images\/touch_icons\/apple-touch-icon-57x57.png",
                "id": 1
            }
        ],
        "ts": "1494546010.717707"
    }
]