[
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "I'm not sure exactly the process of outlining photo room needs, but was thinking about it this morning and wanted to start with: \n\n• Ample, and specific storage. \nRight now, we're sort of hodge podge throughout office with seamless backdrops in the producer room and most other things in the official storage area. Note, this does not take into account any of the actual camera equipment, which I typically lug around as needed. \n\nWhat this means is that we will need tall areas capable of handling the large backdrops so they're not just laying around when not being used, known needs for lights\/stands\/etc. \n\nTechnically speaking, we're still running on a skeleton setup as well. We should plan for new items like several C stands, apple crates, light stands, and more light modifiers that could be somewhat sizable. \n\n• A room that doesn't NEED to be put away. \nWe discussed this a bit — but my hope is to have a dedicated space that can be used whenever we need it and not require everything to be put away to have the office function. \n\n• Lockable storage\nThis would be for the easily stolen stuff like lenses\/bodies. \n\n• Modifiable room lighting (e.g. dimmers \/ curtains to take out ambient light) specific to the space. \nAgain, I keep thinking about this specific space as something that needs to be an area that doesn't necessarily affect the remainder of the office. This includes light needs (if we need all lights off for a shoot for instance).",
        "ts": "1442248851.000002"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "There's tons more that'll be part of this, but that's my morning drive thought.",
        "ts": "1442248881.000003"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "i don't know how permanent photo studios are set up, but i had the thought of high mounted outlets and cord management for whatever powered rigs are placed here and there.",
        "ts": "1442249884.000004"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "5000k lights might be nice",
        "ts": "1442251943.000005"
    },
    {
        "user": "U026PLK4S",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U026PLK4S|matt> has joined the channel",
        "ts": "1442258074.000006"
    }
]