[
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "<!channel>",
        "ts": "1422565114.000002"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "<!channel> uh. sorry, hit enter too soon. Internet is restored, and now we think it should be at least 33% better on average. Please report issues to me promptly.",
        "ts": "1422565145.000003"
    },
    {
        "type": "message",
        "user": "U02F9CXTL",
        "text": "Can anyone connect to NAS?",
        "ts": "1422566114.000004"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "printer is up. NAS is in process of being configured",
        "ts": "1422566204.000005"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "NAS is up. please test and let me know via slack\/general or in person if you have problems with NAS or anything else network related",
        "ts": "1422566825.000006"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "thanks for keeping the dream (of internet) alive <@U02918BKW> and <@U02F8LF2X>",
        "ts": "1422566861.000007"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "By request from the good people of <#C0290HGFT>, I’m proud to announce the 3rd Annual Uncorked Super Bowl Prop Pool. The past two years have been pretty fun with a great turnout. Again, we’re asking for $5 per entry, 1 entry per person. head to <#C03GHV3SQ> to join in on the fun.\n\nIf you're wondering what the hell this is, prop bets are small side wagers that can add some interest to a game you may not care too much about. All of these items have relatively even odds, (from the coin toss, to what Katy Perry will be wearing at halftime) *so football knowledge is definitely not required.* Think March Madness Brackets, but even easier for the sports novice.\n\nLink to the google form, and answers to any questions can be found in <#C03GHV3SQ>\n\nGood luck!",
        "ts": "1422573072.000008"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "Sorry about the internet problems everyone, we are trying to diagnose.",
        "ts": "1422573672.000009"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I'm sorry you have to deal with this every day. Thanks for figuring it out.",
        "ts": "1422573747.000010"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": ":point_up_2:",
        "ts": "1422573840.000011"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": ":point_up_2::point_up_2:",
        "ts": "1422573892.000012"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "1:57 of customer support time with Dell. The tech made some adjustments, we turned off IPv6. Things seem moderately better. Please let us know if you see problems. If you are first in, and the internet is not working, unplug\/replug the sonicwall's power. It is below the printer, top thing on the left with lots of blue lights. We will monitor heavily tomorrow. Thanks everyone for patience.",
        "ts": "1422581164.000013"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "under 2 minutes?! wow!",
        "ts": "1422581753.000014"
    }
]