[
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "friendly reminder that if you have a minute, could you take a look at this short survey about Float\/Harvest? <https:\/\/docs.google.com\/forms\/d\/1PTC42SiLE7qQGyKzk2cplosCKUsuF_4sZ3g68VptUE4\/viewform?usp=send_form>",
        "attachments": [
            {
                "service_name": "Google Docs",
                "title": "Chronos (\"Project Resources\")",
                "title_link": "https:\/\/docs.google.com\/forms\/d\/1PTC42SiLE7qQGyKzk2cplosCKUsuF_4sZ3g68VptUE4\/viewform?usp=send_form",
                "text": "We're firing up a new internal project! This one is all about project resources and time tracking. Essentially it will streamline a few processes, as well as provide notifications of daily and weekly events. This form is meant to capture any thoughts you have about the CURRENT system of resource requests or time tracking, as well as any thoughts you have about an IDEAL system. Some ideas we're already throwing around for the new system: - Near the end of the week, if a producer has not filled out resource requests for projects, that producer will get a nudge - normal resource requests will automatically be put into Float - TBD resource requests will hold for Amanda to assign to the proper resource - New requests (either regular or TBD) will trigger notification to Amanda - The weekly Float email to the end user becomes a weekly Uncorked email with much the same information, on a much better (and responsive) template - End users who are not tracking enough Harvest hours compared to their scheduled Float hours will get a nudge - After the week is up, end users can look at the data and see where original estimates may have been off - Google calendar integration, on some level? - Robin integration? (eg to automatically start Harvest timers for those in meetings) So. Tell me your thoughts!",
                "fallback": "Google Docs: Chronos (\"Project Resources\")",
                "thumb_url": "https:\/\/lh6.googleusercontent.com\/oq1q6BLIniYCG15Z__qo5kFSMpDyXVGRoGGDPETn3Lr8HrNH_KSzlojwKe6svx1axIA=w1200-h630-p",
                "from_url": "https:\/\/docs.google.com\/forms\/d\/1PTC42SiLE7qQGyKzk2cplosCKUsuF_4sZ3g68VptUE4\/viewform?usp=send_form",
                "thumb_width": 1200,
                "thumb_height": 630,
                "id": 1
            }
        ],
        "ts": "1437154393.000002"
    }
]