[
    {
        "type": "message",
        "user": "U0HS41J3Y",
        "text": "<!channel> Please don't forget to record 8 hours of holiday time for Labor Day in Harvest!",
        "ts": "1473182926.000002"
    },
    {
        "type": "message",
        "user": "U1PMH42UC",
        "text": "<!channel> A note from building management: There is a Black Subaru, OR plates 920HAV parked in reserved space #65. Please have this vehicle moved or it will be towed at owner’s expense.",
        "ts": "1473184403.000003"
    },
    {
        "type": "message",
        "user": "U051P3FPY",
        "text": "<!channel> Hello all! Some of the feedback the Diversity Committee has been receiving has indicated that our office might benefit from a shared library of resources for education on diversity and inclusion. To that effect, we are forming the resource library which you can find to the left of the tiny gratitudes area. The resource library is intended to be a collaborative lending and borrowing tool so that we all can share resources and educate ourselves. Feel free to be creative with your contributions with anything from a psychology book to an interesting article. There are folders available on the bottom shelf to put articles in. Library cards can also be found on the bottom shelf of the bookshelf. When you add a resource, go ahead and add a library card too.",
        "ts": "1473194826.000004",
        "reactions": [
            {
                "name": "100",
                "users": [
                    "U02F8TTPU",
                    "U0K8ZSHN0",
                    "U0HS41J3Y",
                    "U243UT96G"
                ],
                "count": 4
            },
            {
                "name": "cool",
                "users": [
                    "U026E0ZNR",
                    "U167FL70V",
                    "U0260V1BX"
                ],
                "count": 3
            }
        ]
    },
    {
        "type": "message",
        "user": "U051P3FPY",
        "text": "I’m going to go ahead and kick it off by adding a resource I’m really excited about, Just Mercy by Bryan Stevenson. It’s a really interesting and eye-opening read about the racism inherent in our justice system and huge steps that have been made in the past several decades. Feel free to borrow it from our brand new resource library :slightly_smiling_face:",
        "ts": "1473194878.000005"
    }
]