[
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "<http:\/\/www.drphil.com\/videos\/teen-says-shes-pregnant-with-baby-jesus\/>",
        "attachments": [
            {
                "title": "Teen Says She’s Pregnant With Baby Jesus | Dr. Phil",
                "title_link": "http:\/\/www.drphil.com\/videos\/teen-says-shes-pregnant-with-baby-jesus\/",
                "text": "“I am pregnant, and it is Jesus,” says 19-year-old Haley.The teen claims that she is 9 months pregnant and about to deliver a baby boy. “I know my pregnancy is real. I’ve gained at least 22 pounds,” says Haley. “I was sleeping one night and my baby punched the bottom of my stomach and kicked me, and I can feel his head right here, right below my belly button.” However, Haley’s mom, Kristi, says her daughter is a “compulsive liar” and “delusional.” She says Haley is not pregnant, and numerous pregnancy tests and doctors have confirmed that. “My family, my friends, my pastors at church, they don’t believe that I’m pregnant,” Haley says. “I know it’s Jesus. I don’t care if my family disowns me. It really comes down to if you’re a true believer in Jesus or not … I don’t care what the home pregnancy test or a doctor says, when I give birth to my baby, no one is going to deny him because he’s my savior.”WATCH: Teen Describes Why She Believes She Has Paranoid SchizophreniaWatch more of",
                "fallback": "Teen Says She’s Pregnant With Baby Jesus | Dr. Phil",
                "thumb_url": "http:\/\/img.drphil.com\/wp-content\/uploads\/2016\/11\/15027_2.jpg",
                "ts": 1478044837,
                "from_url": "http:\/\/www.drphil.com\/videos\/teen-says-shes-pregnant-with-baby-jesus\/",
                "thumb_width": 1280,
                "thumb_height": 720,
                "service_name": "drphil.com",
                "id": 1
            }
        ],
        "ts": "1478214146.000241"
    },
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "I am confused lol. At first when I read this I thought it was going to be about a food baby b\/c it's in garbage humans.",
        "edited": {
            "user": "U1HKQRLMR",
            "ts": "1478214255.000000"
        },
        "ts": "1478214216.000243"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "there are many kinds of garbage humans",
        "ts": "1478214436.000245"
    },
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "I hadn't really thought about that I think b\/c we always talk about food in this channel hah.",
        "ts": "1478214456.000246"
    },
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "That it could be applied to different things I mean.",
        "ts": "1478214466.000247"
    }
]