[
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Hi friends, <@U07KCCF0V> and I are giving a talk tomorrow in the social space about our recent adventures in Cuba. We’d love to have you attend: <https:\/\/www.squadup.com\/events\/the-20th-dukegen-networking-event-portland\/>",
        "attachments": [
            {
                "service_name": "SquadUP",
                "title": "DukeGEN Portland - Emerging Innovation: How Cuba’s Creative Voices are Conquering Constraints",
                "title_link": "https:\/\/www.squadup.com\/events\/the-20th-dukegen-networking-event-portland\/",
                "text": "Get out your business cards! On November 18th, 2015, we'll be hosting the 20th DukeGEN Multi-City Networking Event. The DukeGEN Networking Events provide a chance for entrepreneurial-minded Duke alumni to meet one another. They happen three times a year, and are voluntarily organized by Duke alumni, for Duke alumni, students, faculty and staff. Since 2008, we've held over 300 networking events with a cumulative total of 15000+ Duke attendees. Imagine running an innovation workshop in a foreign country, with an unknown group of participants. Now imagine that country has dial-up internet in fewer than 10% of homes, and until recently very few citizens have had access to any version of the modern internet. Yet just fifteen minutes into the welcome lunch, participants are sharing the apps they’ve created and the data analysis they’re running, and describing a sophisticated culture of staying connected despite daunting obstacles. And your countries, historically locked in a standoff, have just announced a historic change in relationship designed to renew ties. That was our experience in Havana, Cuba, while helping to facilitate the inaugural Incúbate workshop, together with Contagious, Uncorked Studios, and The Flow Collective through the Aspen Institute’s Global Alliances program and the Richardson Center. Please join Nick Parish from Contagious and Marcelino Alvarez from Uncorked as they share insight from their recent Cuban adventure. Q&amp;A and discussion to follow. Also, we're proud to be supporting the Duke Angel Network, <https:\/\/dukeangelnetwork.duke.edu\/>. If you are an accredited investor and would like to learn more, please visit our website and reach out to us. Additionally, if you are an early-stage startup looking for capital, with a Duke affiliation through your founding team, management team or board, please consider applying on our website. Local event host: Marcelino Alvarez '02, Todd Holland '92",
                "fallback": "SquadUP: DukeGEN Portland - Emerging Innovation: How Cuba’s Creative Voices are Conquering Constraints",
                "image_url": "https:\/\/s3.amazonaws.com\/squadup_production\/event_images\/photos\/000\/005\/533\/default\/503120150826-3-vnr5yb.png?1440600832",
                "from_url": "https:\/\/www.squadup.com\/events\/the-20th-dukegen-networking-event-portland\/",
                "image_width": 250,
                "image_height": 110,
                "image_bytes": 41543,
                "id": 1
            }
        ],
        "ts": "1447799486.000021"
    }
]