[
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "<@U0GN0A9EV>, you mentioned you had some printing connects previously, right? do they have a website? just curious on what their capabilities are to keep in the back of our minds while we think of content.",
        "ts": "1483554836.000002"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "<@U02AUNA0P>- from the conversations I've heard, I think people were leaning towards in-house printing, but can circle back on that if Ivan doesn't have a definite answer",
        "ts": "1483555539.000003"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "interesting. that kind of changes things too. who were involved in these conversations out of curiosity?",
        "ts": "1483555680.000004"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "The Welcome Kit team. A dynamic group, but Ewald, Ivan, Ally, Leah",
        "ts": "1483555768.000005"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "I imagine they could be persuaded to go in a different direction, but I believe the original thinking went that a cool, zine aesthetic was not only \"on brand\", but was economic",
        "ts": "1483555833.000006"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "were there talk on how many we need\/want to produce?",
        "ts": "1483555920.000007"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "just worried about production time + quality if we keep it in-house, because the phaser doesn't output the best prints, and the epson is fine quality wise, but is slow and doesn't print double-sided too.",
        "ts": "1483556026.000008"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "I think there was an idea of procuring a specific machine for the task. Not quite full magazine quality, but better than what we currently have.",
        "ts": "1483556722.000009"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "oh cool, was a “risograph” ever brought up in conversations out of curiosity? :eyes:",
        "ts": "1483556787.000010"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": ":grin: I never heard it, but may just not have retained it",
        "ts": "1483556821.000011"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "lol damn, was hoping that'd ring a bell",
        "ts": "1483556832.000012"
    },
    {
        "type": "message",
        "user": "U0XCJ372R",
        "text": "It wouldn't be very economical to use the epson unless it was a really small run. It's slow, the ink is expensive, and we'd need to spend a good amount of production time cutting and folding.",
        "ts": "1483557762.000013"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Yeah. I think a persuasive case could be made for another approach",
        "ts": "1483557863.000014"
    },
    {
        "type": "message",
        "user": "U0GN0A9EV",
        "text": "Let's make this a meeting",
        "ts": "1483562341.000015"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Probably something we need Ewald to be at right?",
        "ts": "1483563406.000016"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "If not, can we move from Monday to Friday. I got tons of runway Friday, while Monday is pretty packed",
        "ts": "1483563454.000017"
    },
    {
        "type": "message",
        "user": "U0GN0A9EV",
        "text": "Ewald wants to be informed but not necessarily involved",
        "ts": "1483565173.000018"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "can you invite ali to that meeting too?",
        "ts": "1483565268.000019"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Yeah. I was thinking more because it was about funding (e.g. printing) and previously, the sentiment had been very much stirred toward in-house printing, but Phillip has brought up some questions",
        "ts": "1483568498.000020"
    }
]