[
    {
        "user": "U07KCCF0V",
        "text": "<@U07KCCF0V|nick> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1498059659.163128"
    },
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "The King is Dead, Long Live the (Better Anyway) King\n\n\n\nPliny the Elder knocked from top of American beer heap in new rankings\n \nSource: SacBee\nBY BRIAN BLOMSTER\nJune 20, 2017\n \nFor the first time in nine years, Pliny the Elder is no longer judged to be the best beer in the United States.\n \nNew rankings from a survey conducted by Zymurgy magazine - published by the American Homebrewers Association (AHA) - and released this week, listed a new king of beers, though Pliny and its parent Russian River Brewing Co. continued to fare exceptionally well. California in general was well-represented among breweries and beers judged to be the cream of the crop.\n \nThe rankings, based on voting by AHA members, were in three categories: top-ranked beers; top-ranked breweries; and top-ranked beer portfolios.\n \nChosen as the country's best beer in the 15th annual judging was Bell's Two Hearted Ale, from Bell's Brewery in Comstock, Mich. Right behind at No. 2 was Pliny the Elder, which had reigned for eight straight years.\n \nCelebration Ale from Chico's Sierra Nevada Brewing Co., came in tied for eighth, one notch ahead of Sculpin IPA from Ballast Point Brewing, a San Diego brewery whose co-founder Pete A'Hearn earned his master brewer's certificate from UC Davis.\n \nBell's Brewery was chosen as the best brewery, a step ahead of Founders Brewing Co., another Michigan outfit, and Russian River. Sierra Nevada was ranked fourth\n \nLagunitas Brewing Co. of Petaluma was in the top 10 at No. 9.\n \nFinally, the brewing company considered to possess the best portfolio of beers was Stone Brewing, a Southern California company that produces 31 beers. Bell's Brewery was second, followed by Firestone Walker Brewing Co., headquartered n the Paso Robles area, Sierra Nevada and Lagunitas, tied for No. 5 with Dogfish Head Craft Brewery.\n \nComplete rankings can be found on the AHA website.\n \n<https:\/\/www.homebrewersassociation.org\/news\/2017-best-beers-america-results\/>",
        "ts": "1498059935.281358"
    },
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "not a huge surprise to me being from that area :wink: bells and founders are killer",
        "ts": "1498060281.430567"
    },
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "oh yeah....Two Hearted was the first \"dank\" beer I ever had. There are a lot of great OR beers but beyond happy Bells &amp; Founders finally making inroads here.",
        "ts": "1498060401.481153"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "Two Hearted is so hot right now... I've been seeing it on tap regularly",
        "ts": "1498062458.364778",
        "reactions": [
            {
                "name": "heart_eyes",
                "users": [
                    "U07KCCF0V"
                ],
                "count": 1
            }
        ]
    }
]