[
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "<http:\/\/techcrunch.com\/2016\/03\/25\/june-oven-cooks-up-22-5-million-in-series-a-delays-ship-date-to-add-improvements\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "June Oven cooks up $22.5 million in Series A, delays shipping until the holidays",
                "title_link": "http:\/\/techcrunch.com\/2016\/03\/25\/june-oven-cooks-up-22-5-million-in-series-a-delays-ship-date-to-add-improvements\/",
                "author_name": "Sarah Buhr",
                "thumb_url": "https:\/\/i1.wp.com\/tctechcrunch2011.files.wordpress.com\/2016\/03\/june-intelligent-oven-hero.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 114,
                "text": "June, a countertop “smart” oven designed by former Google, Apple and GoPro employees has closed a Series A round of financing for $22.5 million today, led by early stage combination hardware and software investor Eclipse.\nPrevious investors also participated in this round, including Foundry Group, First Round Capital, and Lerer Hippeau Ventures.\nJune is sort of like an easy-bake oven for grown-ups, albeit with a much more adult-sized $1500 price tag. The cost of the device may be justifiable for those who don’t like to cook, however. The oven will basically make your meal for you at the perfect temperature without you doing anything more than pressing “OK”.\nJune includes a built-in camera and processor to identify the foods you put inside to cook them at the recommended settings and connects to a live streaming app so you can check in on the process.\nThe startup planned to start sending out its first batch of products this spring. However, a bump in manufacturing and some upgrades has delayed shipping and the new release date is now slated for closer to the Holiday season, according to a company statement:\nFirst, we’ve redesigned the heating architecture, allowing the oven to provide more even heat distribution, better broiling and significantly improving its baking performance.\nSecond, we’ve decided to work with new manufacturing partners for plastics and cosmetic sheet metal; finding the right manufacturing partners is critical to ensure great product quality. We have now finalized and locked in our supply chain partners, with whom we plan to work all the way through shipping.\nWe had to make a hard choice between a summer shipment and the best shipment, and we chose to ship the best possible oven. We hope you’ll agree that it was the right call.\nThis obviously didn’t scare off investors and June says the new funding will allow it to continue hiring and building the team as well as work towards delivering the first batch on the new intended timeframe.\nJune says it will also refund pre-orders for those upset with the delay by emailing support.\nIn the meantime, June will continue beta testing the product and says it has about 100 ovens to send out into the wild for that purpose. Those interested in signing up as beta testers can let June know by filling out this form.",
                "fallback": "TechCrunch Link: June Oven cooks up $22.5 million in Series A, delays shipping until the&nbsp;holidays",
                "from_url": "http:\/\/techcrunch.com\/2016\/03\/25\/june-oven-cooks-up-22-5-million-in-series-a-delays-ship-date-to-add-improvements\/",
                "id": 1
            }
        ],
        "ts": "1458941337.000002"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Related <http:\/\/readwrite.com\/2016\/03\/24\/secrets-crowdfunding-hardware-df2\/?utm_source=twitter&amp;utm_medium=twitter&amp;utm_campaign=sumome_share>",
        "attachments": [
            {
                "service_name": "ReadWrite",
                "title": "The Dirty Secrets of Hardware Crowdfunding - ReadWrite",
                "title_link": "http:\/\/readwrite.com\/2016\/03\/24\/secrets-crowdfunding-hardware-df2\/?utm_source=twitter&utm_medium=twitter&utm_campaign=sumome_share",
                "text": "Crowdfunding a hardware startup may sound easy but have you have to take into account R&amp;D, and the different stages of manufacturing",
                "fallback": "ReadWrite: The Dirty Secrets of Hardware Crowdfunding - ReadWrite",
                "thumb_url": "http:\/\/15809-presscdn-0-93.pagely.netdna-cdn.com\/wp-content\/uploads\/HiRes_CrowdfundingSecrets.jpg",
                "ts": 1458837058,
                "from_url": "http:\/\/readwrite.com\/2016\/03\/24\/secrets-crowdfunding-hardware-df2\/?utm_source=twitter&utm_medium=twitter&utm_campaign=sumome_share",
                "thumb_width": 5000,
                "thumb_height": 5400,
                "id": 1
            }
        ],
        "ts": "1458941699.000004"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "ooh nice",
        "ts": "1458942148.000006"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "this channel’s name stresses me out",
        "ts": "1458943460.000007"
    }
]