[
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "<!channel>, hey team, I uploaded two examples of animation for the charging screen onto the project Basecamp page. Go check them out on your phones to immerse yourself in the near life-like experience!",
        "ts": "1413319974.000002"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "were you able to view it on mobile?",
        "ts": "1413320736.000003"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Yeah, it took a minute to finish loading before it gave me a preview... I was also using the app not the website.",
        "ts": "1413321351.000004"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "\"Option 1\" is quite a bit bigger too, so it may take longer to load for you.",
        "ts": "1413321381.000005"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "ah i didnt see the loading indicator",
        "ts": "1413321405.000006"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "yes, its loading",
        "ts": "1413321409.000007"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "thanks",
        "ts": "1413321409.000008"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "<@U026E0ZNR> which do you prefer?",
        "ts": "1413321777.000009"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "The hex funnel one is nice and a lot cleaner so I think I prefer that one. I do like the other as an alternative in case clients conclude the hexagonal one is too intense for what they want. Though I think the glow-y one could use a bit more refinement if we ended up selecting that one.",
        "ts": "1413322035.000010"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "i think i like the green one better but agree it could be refine a bit... i think i just like the inward motion and use of color. the logo application feels a bit like hypnosis",
        "ts": "1413325260.000011"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "Have you played with the logo at different scales? It might be interesting to see it with finer \/ denser lines as on the splash screen",
        "ts": "1413325315.000012"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "I've played with it in a number of ways but could push it in a few other directions. I'm trying to figure out how fine I can get them, as this is designed for use @3x and needs to be able to bump down in res. This is one of the more successful attempts at avoiding total hypnotic trance status. I don't think it'll ever be completely non-hypnotic, just a matter of less-so.",
        "ts": "1413326187.000013"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "I think they're both good examples of two different directions. It's trippy how the hexagon version makes the circle look off! <@U0265G76F>  is out of the office signing papers, but I'd love his thoughts before we send. David, let us know what you think!",
        "ts": "1413328584.000014"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Driving to our next meeting. Will check from home later",
        "ts": "1413328722.000015"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "But I saw in process hex and liked it",
        "ts": "1413328742.000016"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "One thought on hypno: what if inner circle was bigger? ",
        "ts": "1413328772.000017"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Gets animation across, maybe less hypno",
        "ts": "1413328789.000018"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Hmm. Waiting at bank. Can't play animation for some reason. Stills look good IMHO. Assuming the solid color one pulses in some form. ",
        "ts": "1413330630.000019"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "It takes a few to load fully. Try giving it a little more time... the solid one is much larger.",
        "ts": "1413330837.000020"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "K",
        "ts": "1413330865.000021"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Hmm. No working on mobile. Will check when home, but again I think we're on a good track overall",
        "ts": "1413331081.000022"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Yeah, let's maybe check in about it tomorrow after you've had a chance to view it properly.",
        "ts": "1413331113.000023"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "K. Thanks\/sorry! ",
        "ts": "1413331136.000024"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "Thanks, David! I'm totally fine with sending tomorrow. Don't review animations and drive!!!!",
        "ts": "1413331152.000025"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Finally home and have seen the two animations. First off — really nice work Trent. Love that you're pushing us forward into motion studies. \n\nI'm in agreement with Mary that they're both solid examples of different directions. I'm also leaning toward the solid color. Also agree it needs refinement. Not sure about the line moving in periodically on that one. It feels out of place in an otherwise very peaceful glow. That said, I think it helps convey the basic premise of POWER IS COMING INTO YOUR PHONE FROM THE WORLD.",
        "ts": "1413346855.000002"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "so it may be the specific execution that I'm reacting to — feels a bit sci-fi.",
        "ts": "1413346898.000003"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Also, wondering how anybody would feel about making the inner circle just a hair bigger. I feel like that inner type needs just slightly more breathing room, though I admit I'm looking at this on desktop at the moment.",
        "ts": "1413346977.000004"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "We can chat in the morning, but super excited where these are going. Thanks again trent for putting them together so quickly!",
        "ts": "1413347002.000005"
    }
]