[
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "<!channel>: would love a quick stand-up update here, please! how's it going?",
        "ts": "1430863766.000002"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "I have done the new permissions screen for camera access, wrapping up photos access right now, and will do microphone access next.",
        "ts": "1430863931.000003"
    },
    {
        "type": "message",
        "user": "U0289USNA",
        "text": "I will likely try to solve my filter-able stickers bug tonight so that I can start iPad testing tomorrow.",
        "ts": "1430863969.000004"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "I'm still elbow-deep in view hierarchy\/render pipeline. I hope to have it wrapped by EOD. I still have magic numbers and the variant picker UI after that.",
        "ts": "1430863982.000005"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "I still feel OK about shipping on Friday",
        "edited": {
            "user": "U026PT0D7",
            "ts": "1430864021.000000"
        },
        "ts": "1430864011.000006"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "currently making a list of stuff for VQA from the latest build.",
        "ts": "1430864169.000008"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "I just experienced what I can only call a cloudburst with the view hierarchy stuff. Finally feel ready to move on to magic numbers! There are probably minor quirks left over, but I'll catch them as I go through magic numbers and VQA",
        "ts": "1430869071.000009"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "(pushed to origin\/interstitials, btw)",
        "ts": "1430869082.000010"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "Magic numbers for old title cards and interstitials are done and pushed. First thing tomorrow I'll pick a new thing out of the pile (new TC\/I magic numbers, fixing an interstitial render bug, fixing magic numbers for the Frame editor, UI for variant-picker). Also note I'll be WFH tomorrow.",
        "ts": "1430879313.000011"
    }
]