[
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "<!channel> Question for the team! When we implement the new title cards and interstitials, do we want to leave all of the existing ones, remove all of the existing ones, or pick and choose some we want to keep and some we want to get rid of?",
        "ts": "1429224225.000002"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "I know we discussed a while ago, when we were kicking off, but don't think there was a solid answer",
        "ts": "1429224240.000003"
    },
    {
        "type": "message",
        "user": "U02688JHZ",
        "text": "we're now at the point where we need to decide so I'd like to gather our internal thoughts so we can get sign-off from the client.",
        "ts": "1429224258.000004"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "What happens to old movies if we delete cards?",
        "ts": "1429224309.000005"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "depends on how old the movie is. If it's a Wonder Woman title card, it's possible the rendered frame stays the same, but any attempt at editing it would result in weird behavior. If it's one of the current title cards that was just removed, we can handle it however we want",
        "ts": "1429224404.000006"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "my recommended solution would be the user could still edit that title card or interstitial, but any new frames in that old movie would have to use the new set",
        "ts": "1429224459.000007"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "that makes sense",
        "ts": "1429224857.000008"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "So we wouldn't really be \"deleting\" cards, just not letting users use them for new movies\/frames",
        "ts": "1429224942.000009"
    },
    {
        "type": "message",
        "user": "U026PT0D7",
        "text": "I mean, that's one option. We could let people continue to use the old cards in new movies\/frames",
        "ts": "1429225002.000010"
    },
    {
        "type": "message",
        "user": "U02AUNA0P",
        "text": "i’m fine with leaving all the old title cards. there’s only 7 of them anyways, and it’s nice to have “generic” ones to be safe. \n\nbut as for interstitials, i’m kind of on the fence about removing\/leaving them because the interstitials like the comic book ones aren’t the best designed things in the world, but they’re  fun to use.",
        "ts": "1429225734.000011"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "I agree. The designer in me loves the new stuff so much, and wants to really highlight it. But my UX gut is telling me we should probably leave them in.",
        "ts": "1429227913.000012"
    }
]