[
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "<!channel> Andy sent through feedback on the creative deck. Posted up to basecamp now!",
        "ts": "1424808601.000002"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Cool. I'll look it over in a bit. ",
        "ts": "1424813053.000003"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "I read through it. Not much to add technically, except that multi-screen casting would have to be in the SDK we create (I.e. the Photos app would have to use the API we create and do the right thing with its views, we can't write a single app that can \"split\" any arbitrary app among devices)",
        "ts": "1424813220.000004"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "Also, just found another player in this space. <http:\/\/www.ixonos.com\/products\/ixonos-android-multi-display>",
        "attachments": [
            {
                "service_name": "Ixonos.com",
                "title": "Ixonos Android Multi-Display™",
                "title_link": "http:\/\/www.ixonos.com\/products\/ixonos-android-multi-display",
                "text": "We designed a multi-display UI solution for Android devices with multiple displays. You can offer your customers unforeseen possibilities for discovery and multitasking.",
                "fallback": "Ixonos.com: Ixonos Android Multi-Display™",
                "image_url": "http:\/\/www.ixonos.com\/var\/ixonos\/storage\/images\/media\/ixonos.com\/images\/product-images\/android-multi-display\/ixonos-android-multi-display\/22501-1-eng-UK\/ixonos-android-multi-display_large.jpg",
                "from_url": "http:\/\/www.ixonos.com\/products\/ixonos-android-multi-display",
                "image_width": 375,
                "image_height": 250,
                "image_bytes": 17314,
                "id": 1
            }
        ],
        "ts": "1424813248.000005"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "while I think he's not 100% right on his feedback for the strategy game, I think they liked enough of our stuff that we could iterate on those ideas",
        "ts": "1424816589.000007"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "what Im not sure about is what exactly that would mean in terms of D5's needs",
        "ts": "1424816621.000008"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "like - what resolution of thinking do they need to push these forward?",
        "ts": "1424816666.000009"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "oh - all of the above is only in relation to games",
        "ts": "1424816696.000010"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "I was never thinking one game would be the silver bullet.  Multiple games with different gameplay made more sense to me.",
        "ts": "1424816736.000011"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "I think he's a little incorrect in his feedback for the fantasy stuff in terms of how it's made better with additional devices",
        "ts": "1424816764.000012"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "I say that because they seem to be dismissing things that don't involve everyone at once, right?",
        "ts": "1424816770.000013"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "I like the idea of a low-key simple \"gamelike\" environment where people can join and leave at will... maybe fling\/shoot balls at different screens or create ripples or something",
        "ts": "1424816782.000014"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Eno-land",
        "ts": "1424816806.000015"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "totally",
        "ts": "1424816811.000016"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "\"Overall not on a few of these is that, it might be because of the comps, but most of these ideas seem to require too many devices to play the game or experience the idea. \"",
        "ts": "1424816838.000017"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "I think that feedback is really a critique of the system as much as any idea",
        "ts": "1424816860.000018"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "YES",
        "ts": "1424816873.000019"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Hahaha.  Totally correct",
        "ts": "1424816874.000020"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Im not convinced there are a lot of magical ideas for like 2 phones",
        "ts": "1424816893.000021"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "He's talking out of both sides of his mouth.",
        "ts": "1424816899.000022"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Pong",
        "ts": "1424816903.000023"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "maybe",
        "ts": "1424816909.000024"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "but honestly - even with pong - it might be just as good on a single tablet",
        "ts": "1424816925.000025"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "I'm kidding.  My hunch is they don't like turns.  They want everyone to be able to engage (and disengage) as they choose.",
        "ts": "1424816946.000026"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "but regardless - I really do think this is a symptom of the underlying system",
        "ts": "1424816954.000027"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "I agree",
        "ts": "1424816962.000028"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "and I think that's a problem for the exact reason we already set out for them",
        "ts": "1424816977.000029"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "which is that the composite screen does not grow at the same rate as the bodies required to create it",
        "ts": "1424817004.000030"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "which isn't to say that our ideas are perfect",
        "ts": "1424817021.000031"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "just that I don't think this comment is unique to our ideas",
        "ts": "1424817033.000032"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "AAANNNYYYWAAAYY",
        "ts": "1424817044.000033"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "exactly",
        "ts": "1424817050.000034"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "I disagree with his comment on fantasy sports",
        "ts": "1424817063.000035"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "yes it would work better on a giant touch screen",
        "ts": "1424817075.000036"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "but isn't the entire premise of this technology that you don't have a giant touch screen available?",
        "ts": "1424817094.000037"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "the idea that a bunch of people could get together to watch a game (which is a thing that actually happens in the world) and then join their devices to create a second screen that provides useful real-time stats and feedback - that really does seem to have a ton of utility to me",
        "ts": "1424817168.000038"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "To me, we were piggybacking on \"second screen\" behavior, not replacing anything.  You still watch the game you care most about on your flat panel.  We're just suggesting friends could gather and create a dashboard of other games.",
        "ts": "1424817170.000039"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "And, yes, you could have the 6 games open on your laptop or tablet or whatever but, again, you can't link and unlink to them to enhance the experience.",
        "ts": "1424817219.000040"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Should we huddle in the AM (with Matt) to see where our heads are?  I need to digest the feedback and try to process solutions for the next few hours.",
        "ts": "1424817315.000041"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "yeah Im fine to get together, but I think part of developing a POV, at least for me, is getting an understanding of what D5 is looking for with this feedback. Is it like \"take the things we like and iterate on them and cut the things we dont\"? or is it \"iterate on all these ideas based on this feedback\"?",
        "ts": "1424817709.000042"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "Just hopping back online. Y'all been busssssyyyyy",
        "ts": "1424818181.000043"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "I'll set up time for us to meet in the morning. For tomorrow's session with d5 lets just have all our thoughts in order. We'll see what comes out of that session and revise our deck\/preso as needed",
        "ts": "1424818282.000044"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "My plan is to think more about the feedback today\/tonight and get together tomorrow to determine what, if anything, we want to push back on (purely because I'm not sure we represented some of the ideas successfully, not because we \"like\" them and are bummed they didn't). ",
        "ts": "1424819002.000045"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "I’m with Justin. I really want to know more about what they're looking for and also what we're potentially getting ourselves into. Is this project \/ exploration still in \"pitch\" mode, or has it advanced to something more official? I ask because if we’re on the hook to build \"something TBD” for I\/O, my hope is that we’d be able to execute that thing really well. So for me, I’m wondering if it’s worth measuring these ideas against our ability to nail them.\n\nI keep coming back to snake, the old Nokia game, where master device is controller, secondary device is play area. The game would still work in the small scale as you only need 2 to play, but more devices grow the play area. It could be very “material-y,” probably wouldn’t be the most difficult thing to design and build, but it’s just not super sexy. For me, those are the two sides I’m trying to balance with any new ideas.",
        "edited": {
            "user": "U026PLK4S",
            "ts": "1424821260.000000"
        },
        "ts": "1424821246.000046"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "fwiw - snake was actually my inspiration for the party game",
        "ts": "1424821434.000048"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "Snake is also one of the canonical first-year programming projects, I know I had to implement it in my first CS class. Andy mentioned that appealing to the developer community is an important aspect.",
        "ts": "1424821434.000049"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "our party game concept is basically just refactoring the parts of snake to account for the control inputs we have",
        "ts": "1424821489.000050"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Not sure if these will help, but I was looking at the I\/O photos from last year. There seems to be a pretty wide range of demos. Some have smaller footprints and build-outs, and others (like cardboard) are a much bigger deal. <https:\/\/events.google.com\/io2015\/about#photos>",
        "attachments": [
            {
                "title": "Google I\/O 2015",
                "title_link": "https:\/\/events.google.com\/io2015\/about#photos",
                "text": "Google I\/O 2015 brings together developers for an immersive, two-day experience focused on exploring the next generation of technology, mobile and beyond. Join us online or in person May 28-29, 2015.",
                "fallback": "Google I\/O 2015",
                "from_url": "https:\/\/events.google.com\/io2015\/about#photos",
                "id": 1
            }
        ],
        "ts": "1424821653.000051"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "that was a cool album, thanks <@U026PLK4S>",
        "ts": "1424821812.000053"
    }
]