[
    {
        "user": "U0260V4K1",
        "inviter": "U030TQFR3",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U0260V4K1|justin> has joined the channel",
        "ts": "1424462549.000002"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "<!channel>\nHere's the plan for finishing the deck this afternoon:\n1:30 -- Please have all writing ready in the google doc\n2:00 -- Print PDF and take over a room together to review",
        "ts": "1424462577.000003"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "From there all edits will be sent to Matt and implemented directly in the deck.",
        "ts": "1424462594.000004"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "<@U026PLK4S>: That's earlier than we just talked about -- we lose Rob at 2:30 so I want to do a walkthrough of content with everyone before he goes. From there you can keep working visuals.",
        "ts": "1424462656.000005"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "sounds good.",
        "ts": "1424465093.000006"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "<!channel>: One item that I could use some help with is rounding up moodboard \/ example imagery for our Installation slide. I don't think I'll have the time to do a deep dive through all of my normal visual design inspiration destinations.\n\nSo, I'd ask, \"What does the Giant Photo Booth, or the Drawing Wall look like to you?\" Have you seen other projects, installations, sculptures that have the same look \/ feel \/ scale? Literally anything will help. Let me know if you can help!",
        "ts": "1424465544.000007"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "I can look around for stuff",
        "ts": "1424465739.000008"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "hey all - take a look at this - this is sort of what I was thinking the photo booth would look like: <http:\/\/www.planar.com\/products\/lcd-video-walls\/mosaic\/>",
        "attachments": [
            {
                "text": "The Planar Mosaic Architectural Video Walls line of LCD display digital billboards redefine interior spaces and dynamically deliver art and information.",
                "fallback": "The Planar Mosaic Architectural Video Walls line of LCD display digital billboards redefine interior spaces and dynamically deliver art and information.",
                "from_url": "http:\/\/www.planar.com\/products\/lcd-video-walls\/mosaic\/",
                "id": 1
            }
        ],
        "ts": "1424468274.000009"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "obviously not right in terms of imagery - but that's what I was picturing when we talk about the photobooth",
        "ts": "1424468589.000012"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "and I suppose the drawing wall will be the same form factor",
        "ts": "1424468608.000013"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "I have no idea if this actually helping",
        "ts": "1424470318.000017"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "<!channel>: Okay! Cutting off edits to the google doc now. Matt is getting the last of that into deck format and then printing. All edits from this point on should be delivered to Matt+Me via email and he will drop them into the deck.",
        "ts": "1424470648.000020"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "I think this reference is helping, Justin.  For the photo wall I think the most interesting comp would be images of various sizes \"tiled\" across the array of screens.  This shows the core mosaic feature and combines it with IO participation.",
        "ts": "1424470894.000021"
    }
]