[
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "morning <!channel> - looking for feedback on what an R&amp;D phase would look like for this. Put together rough staff and timing, but <@U02F8LF2X> maybe we can talk more about the physical aspect today?",
        "ts": "1490027392.134981"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "woof, just saw update from marce, total all in for prototyping, final delivery of 100 units, and making of video (?) is 250k… i’ll see what we could work into that but that feels………tight",
        "ts": "1490028158.422656"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "update: no",
        "ts": "1490028247.455868"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "And no mention of mobile ",
        "ts": "1490028414.521304"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "didn't see said update, but that feels pretty bananas for the full project.",
        "ts": "1490028417.522229"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "Or that's all in",
        "ts": "1490028418.522486"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "```They would love to have a checkin with us tomorrow at 12 PST.  Does that time work for you guys?\n\n\n\nI have a update about budget as well, they have $250k all in for prototyping, making of video to seed, and, final prototype delivery of ~100 units.\n\n\n\nGeoff was pretty transparent about the fact that the \"making of piece\" of content around this thing (I know agencies are stupid)is the critical piece for them and they will want to create a sexy piece of content around it. Like find a director etc… No idea how that will be accomplish..   Believe me I know how dumb this is… But its the way for us to add this into the deliverable decks of the next round? Lord knows we can make sexy case study video for a deliverable and make it all one thing.\n\n\n\nIs there a way for us to have uncorked try and bundle this into one thing or at least speak to it so the bulk of the budget goes to prototyping rather then a case film.```",
        "ts": "1490028486.548027"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "oof",
        "ts": "1490028780.658583"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "I think we come back and say 6-10x that budget",
        "ts": "1490033413.380947"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "this is a 1.25 - 2.5 mil project, and anyone who says otherwise is lying, esp. if there’s a video budget in there",
        "ts": "1490033440.390669"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "or go call Deep Local",
        "ts": "1490033446.392979"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "I know he's not a famous director, but we could offer Paul Searle as a trusted behind scenes, and local, director",
        "ts": "1490033509.414818"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Videos + ad agencies are my version of your games. I’d rather us do that for ourselves vs having some 2-bit art director frame fuck a 30 second video because he thinks he’s up for an academy award.",
        "ts": "1490033633.457589",
        "reactions": [
            {
                "name": "fire",
                "users": [
                    "U026PHQ3J"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "`frame fuck`",
        "ts": "1490033663.467313"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "do we want to counterpropose anything (other than ~150k R&amp;D) or just consider it lost and give themr easoning",
        "ts": "1490035212.012857"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "i put together a swat budget of 250k to try and race through something in 6 weeks, for 200k, giving us 50k for actual components, fab, and video",
        "ts": "1490035990.278944"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "is there a mobile app in that swat budget?",
        "ts": "1490040654.785940"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "with agency + hardware + event I think we should be cautious about budgets and risks.",
        "ts": "1490040690.797102"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "I think we should start w\/ a convo w\/ Neely today about R&amp;D and maybe for tomorrow’s check-in suggest that we’re way off in budget, and see if there are ways to push back or to find additional sources of funding (e.g., what if we integrated another 80s brand into the mix for funding)",
        "ts": "1490040750.815798"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "yeah that swat budget is unrealistic it’s more a fixed gate of what kind of team we could apply for what time",
        "ts": "1490041080.920335"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "i’ll push back with a ~150k r&amp;d budget and suggest we talk more about what a full engagement could look like tomorrow",
        "ts": "1490041100.926565"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "cool",
        "ts": "1490041708.123501"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "thanks for pulling those numbers - we’ll be armed w\/ realistic insight for tomorrow",
        "ts": "1490041722.127782"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Well, Neely’s spooked. Gonna hop on a call with her at 3 if anyone wants to join.",
        "ts": "1490041857.171468"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "I’ve got a conflict - can anyone else join?",
        "ts": "1490042236.292794"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "happy to take solo",
        "ts": "1490042262.301810"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "```I think we need a new approach to working on this wth them, I was completely under the impression you had these people in house and doing something like this wouldn't require hiring a freelance army.  At least thats how I sold you in…. Damn   \n\nI do not feel comfortable asking them for a ~ $100k to do technically discovery because they will not respond to that well. We're get ourselves excused from this project immediately. this is a agency not a brand. \n\nVery nervous```\n\nWill reiterate to her that this is not freelancers, is internal, but this is what the project requires - we believe this is a 600k-1MM production, even without a mobile component.\n\n```We're figure it out :))))) \n\nI'm sure were figure something out!```",
        "ts": "1490043181.593246"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "yeah, mfg costs, production runs, more production runs, molds",
        "ts": "1490043348.646048"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "components",
        "ts": "1490043361.650294"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "&gt;this would be really good press, and we’d get more agency jobs ",
        "edited": {
            "user": "U06DFL7BP",
            "ts": "1490048486.000000"
        },
        "ts": "1490047795.846702"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Going to get a read from Geoff on whether she wants us on the call tomorrow or not. Explained the process, team, and size we’re talking about. She may want us on the call so she doesn’t have to take the blame on herself, but doesn’t understand why we cant open up a watch or a tamagotchi and put a new tamagotchi in it :confused:",
        "ts": "1490048273.949411"
    }
]