[
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Morning team. What’s everyone’s thoughts on Matt’s question\/proposal?",
        "ts": "1454349383.000002"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "My inclination is to lightly mention that all of the technology we've discussed for the smart pad concept currently exists, so we can be confident it's feasible. The question they are probably trying to get to is: What would be the LOE of something like this? To answer this, we'll need to do user research to figure out what form this pad should take.",
        "ts": "1454349493.000003"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Curious to hear others takes?",
        "ts": "1454349585.000004"
    },
    {
        "type": "message",
        "user": "U0GN0A9EV",
        "text": "I agree. We know it’s possible. The question is, is it useful? <@U026NB2U2> should jump on a call with them and try to get alignment.",
        "ts": "1454352061.000005"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "its plusible. there's a fair amount of R&amp;D that has to happen before we know its possible",
        "ts": "1454352132.000006"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "<@U026PHQ3J> Think we should do some tech feasibility analysis first then?",
        "ts": "1454352230.000007"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "its deep, basically its a question of \"if the resultion of a pad exists such that we can tell the difference between two objects, how certain are we at a given time\"",
        "ts": "1454352275.000008"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "so i guess what i'm saying is that while all the pieces may exist, there's still a big unknown as to how well it can work",
        "ts": "1454352339.000009"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Yeah. Sounds like my interpretation of the product was off.  I interpreted the product as more of a barcode or sommely implementation (image recognition). You’re thinking object recognition?",
        "ts": "1454352482.000010"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Probably should follow-up and get their idea on \"tech\/sensor standpoint”. IMO, different forms this could take is more justification for user research so we don’t go wrong direction, but setting up a call between you and them may be our best response?",
        "ts": "1454352624.000011"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Hey guys, sorry for the late chime-in. I think we need to clarify with them that the research precedes technical feasibility studies, especially since one of our desired outcomes is a better understanding of the primary pain points. Solving those may dictate different approaches, so we want to make sure we’re aligned.",
        "ts": "1454353056.000012"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": ":thumbsup:",
        "ts": "1454353078.000013"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "I think an acknowledgement of the email and setting up a call to discuss the balance between feasibility and focus. I can lead from an accounts standpoint, but it’d be great to have Ivan, Rob, and Evans support their respective groups.",
        "ts": "1454353148.000014"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Let’s not list features in this response - Rob, can you draft something and share it w\/ us before sending?",
        "ts": "1454353174.000015"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Yep!",
        "ts": "1454353190.000016"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "I’m in this S.R. call, so will have something early afternoon",
        "ts": "1454353212.000017"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "S.R. call ended earlier. How does this language look?",
        "ts": "1454355389.000018"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Good afternoon Matt,\n\nThanks for your quick follow-up! We'd love to get your thoughts on the additional product scope and have a conversation around what you are thinking from a tech\/sensor standpoint. Do you have some time available in the next couple days to hop on a call with us? If so, let me know if a specific time works for you or if you're just generally available and I'll work with my team to get something on the calendar. \n\nThanks again,\n\nRob",
        "edited": {
            "user": "U0B9N0HF0",
            "ts": "1454355416.000000"
        },
        "ts": "1454355391.000019"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Looks good to me. <@U0GN0A9EV> \/ <@U026PHQ3J> ?",
        "ts": "1454356950.000021"
    },
    {
        "type": "message",
        "user": "U0GN0A9EV",
        "text": "that works!",
        "ts": "1454357014.000022"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "good",
        "ts": "1454357351.000023"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "SHIP IT!",
        "ts": "1454357366.000024"
    }
]