[
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "How to Carve a Sign for Your Tiki Bar <http:\/\/news.critiki.com\/2016\/05\/26\/how-to-carve-a-sign-for-your-tiki-bar>",
        "attachments": [
            {
                "service_name": "Critiki News",
                "service_url": "http:\/\/news.critiki.com",
                "title": "How to Carve a Sign for Your Tiki Bar",
                "title_link": "http:\/\/news.critiki.com\/2016\/05\/26\/how-to-carve-a-sign-for-your-tiki-bar",
                "author_name": "Humuhumu",
                "author_link": "https:\/\/news.critiki.com\/author\/nwnynwny\/",
                "thumb_url": "https:\/\/i1.wp.com\/critikinews.files.wordpress.com\/2016\/05\/11-finished-logo.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 176,
                "thumb_height": 150,
                "text": "When a young man&amp;rsquo;s (or woman&amp;rsquo;s) fancy turns to thoughts of their dream home tiki bar, one of the first things settled&amp;nbsp;on is a name for their own little corner of paradise. And naturally, as soon as you have a name, you start daydreaming about a sign. There are lots of ways to go about making a sign, but here&amp;rsquo;s mine. It&amp;rsquo;s a handy step-by-step showing how I went about making the sign for my own home tiki bar, Balhi Ha&amp;rsquo;i.\nYou&amp;rsquo;ll need:\nWood\nPaper\nCarbon tracing paper\nTape\nA ballpoint pen\nProtective eye gear, really, I mean it\nA Dremel (or similar rotary tool)\nDremel flex shaft&amp;nbsp;attachment\nDremel bits\nSandpaper\nTack cloth\nFoam brushes\nWood conditioner\nStain\nPolyurethane\nSmall paintbrush\nPrimer\nPaint\nStep 1: Get some wood\nI got my wood from a dumpster at a hardscape supply place. I asked if they had any scrap pieces I could buy, and they were very kind&amp;nbsp;and pulled out a bunch of stuff from their dumpster for me, gratis. I don&amp;rsquo;t know what kind it was. It&amp;rsquo;s just wood. It&amp;rsquo;s mystery meat wood, from a dumpster. Nothin&amp;rsquo; fancy.\nTracing the design using carbon paper\nStep 2:&amp;nbsp;Trace your design\nComing up with a logo and design, whoo boy, that could be a whole other discussion. Sorry to gloss over that, but I want to talk about this here sign today, so we&amp;rsquo;re going to pretend you have that sorted.\nYou could draw your design right on the wood, but if I know you (and I think I do), you&amp;rsquo;re probably going to come up with&amp;nbsp;your design on a computer. Print your design out at the size you want it on the wood, on plain paper. (I printed mine black, but if I had it to do over again, I&amp;rsquo;d have made it gray so I could more easily see what I&amp;rsquo;d already traced over.) Put a piece of carbon tracing paper (this is the stuff I used) between your paper and the wood, carbon side facing the wood, and tape everything&amp;nbsp;in place. Use a ballpoint pen to trace your design. Peek under&amp;nbsp;the edge of your paper to check on how the transfer is going, to be sure it&amp;rsquo;s working like you expect.\nAll traced!\nStep 3: Get your Dremel on\nWe&amp;rsquo;re about to start carving, but first, let&amp;rsquo;s talk about your Dremel. If you&amp;rsquo;re already familiar with your Dremel, skip to the next step.\nFirst thing to know about Dremel: Dremel would like to sell you many, many add-ons. Almost all&amp;nbsp;of them are silly and you can ignore them. But you do want the flex shaft&amp;nbsp;attachment. It&amp;rsquo;s a lot easier to do this kind of fine work for long stretches if you have one. The flex shaft is just a long, skinny hose that goes between the Dremel motor (which is usually what you grip onto) and the spinning bit that you&amp;rsquo;ll be using on the wood. The hose shouldn&amp;rsquo;t be coiled while you&amp;rsquo;re working, ideally it needs to hang down and stay kind of straightish, because hidden inside that hose is a metal cable that is spinning just as fast as the motor and the bit. Do not cramp its style! You gotta let that sucker spin freely. I don&amp;rsquo;t have a special hanging rig, I just use an S hook and hang it from wherever&amp;rsquo;s handy. Here&amp;rsquo;s a video that shows what I&amp;rsquo;m talking about (but I&amp;rsquo;m also including it because whoa with that music):\n\nRead all the Dremel instructions, be careful, and wear protective eye gear even though none of us will look as sexy with eye gear as the gentleman in that video.\nCarve the edge around the design with a Dremel.\nStep 4: Carve around the edges of your design\nNow comes the fun part: carving! The picture above shows a first pass at carving around my design. This was with a pointy-headed triangle&amp;nbsp;bit. After this, I went over it again with a much smaller bit to get it nice and clean.&amp;nbsp;I then&amp;nbsp;went over it one more time with a round bit about the size of a small bb to clear out a wider, deeper swath of wood around the design, to give some&amp;nbsp;buffer space for the rowdier background work. I carved about a quarter-inch deep. You&amp;rsquo;re totally going to biff it at some point and accidentally tear out a chunk of your design. You really, really don&amp;rsquo;t want to do that, but you&amp;rsquo;re human, and it&amp;rsquo;s going to happen. Don&amp;rsquo;t beat yourself up over it.\nTime for texture!\nStep 5: Carve out some texture\nNow that the high-pressure, fine detail stuff is done, you get to cut loose and create some fun texture. For this, I used a much bigger bit shaped more like an oval, maybe the size of a small peanut. You don&amp;rsquo;t see that bit&amp;nbsp;in the Dremel in this picture, because I took this picture after my oval bit had gone shooting&amp;nbsp;out of my Dremel and ricocheted off of the neighbor&amp;rsquo;s fence and I couldn&amp;rsquo;t find it and I was waiting for a new bit to arrive in the mail so&amp;nbsp;I could finish. So, uh, always check the tightness of your chuck, and always wear your eye protection, folks!\nMidway, while I was stuck twiddling my thumbs waiting for a new bit.\nAnyway, I didn&amp;rsquo;t have any plan for the texture, I just kinda bounced it all around ripping chunks out of the wood randomly. I like how it turned out!\nCarved and sanded (click to enlarge)\nStep 6: Sand\nOnce the carving is complete, it&amp;rsquo;s time for sanding. Get a&amp;nbsp;typical sandpaper variety pack with a few different grits, they come in sheets you can fold or tear. Anyone familiar with emery boards will know the drill, but if you&amp;rsquo;re totally new to sanding, start with a&amp;nbsp;coarser grit (say, 100), then work with finer grits (150, then 220). Always sand in the same direction as the grain (in the case of this sign, that means back-and-forth lengthwise, not up-and-down). I mainly focused on sanding the design.&amp;nbsp;The textured background with all of its curves and divots would have been too hard to sand well, plus it&amp;rsquo;s sort of supposed to look rough and organic, but I probably hit a few of the roughest spots. Fold your sandpaper into a point to get into little bends and crevices. Once you&amp;rsquo;re done, get all of the dust off with a tack cloth (which is just inexpensive, slightly sticky gauze sold exactly for this purpose).\nStaining the wood\nStep 7: Stain\nFrom here on out, you want to keep your sign dust-free, so do this work in a sheltered spot, ideally not outdoors. Before staining, I applied a wood conditioner, which helps the stain go on evenly, without blotches. Then apply the stain according to the directions on the can. This is two coats of Dark&amp;nbsp;Walnut stain.\nWaiting for the polyurethane to dry\nStep 8: Varnish\nWhat I said earlier about keeping the sign dust-free goes double now: it&amp;rsquo;s time to bust out the polyurethane. I used a satin gloss polyurethane, and you can see&amp;nbsp;that even though it&amp;rsquo;s &amp;ldquo;clear,&amp;rdquo; it has an amber cast that&amp;nbsp;warms up the color perfectly. I use a foam brush when applying polyurethane. Follow the directions on the tin, and give it plenty of time to dry between coats.Use a light, but even, touch when applying the polyurethane; you want to avoid having pools of poly. Sand the design area between coats so that it comes out smooth.\nPrimer coat on the design, and some sort of prepared food lid, sorry about that\nStep 9: Paint the design\nGently sand the design with some 220 sandpaper. You just want to rough it up a smidge so the paint will adhere nicely and evenly. Be sure you don&amp;rsquo;t accidentally sand&amp;nbsp;the background. Then apply a coat of primer paint. It doesn&amp;rsquo;t have to look perfect, it&amp;rsquo;s just providing a base. Once that&amp;rsquo;s done, go to town with whatever paint you like! I went with gold paint, because I&amp;rsquo;m faaaaancy.\nThe finished sign! Click to enlarge.\nHey, look at that! A sign!\nThere are some places in these steps where I&amp;rsquo;m a little vague&amp;mdash;like not giving you the exact bit model numbers, for example. The thing is, I was winging it, making it up as I went along, and I want you to know you can&amp;mdash;and should&amp;mdash;wing it, too. There&amp;rsquo;s no reason to follow these instructions to a T. I don&amp;rsquo;t know what I&amp;rsquo;m doing. This is only the second non-pumpkin, non-soap-bar thing I&amp;rsquo;ve carved.&amp;nbsp;I don&amp;rsquo;t let not knowing what I&amp;rsquo;m doing stop me, and neither should you. I mean, try to not lose any eyes or fingers, but beyond that, hey, why not take a stab at making your own sign?\n&amp;nbsp;",
                "fallback": "Critiki News Link: How to Carve a Sign for Your Tiki&nbsp;Bar",
                "from_url": "http:\/\/news.critiki.com\/2016\/05\/26\/how-to-carve-a-sign-for-your-tiki-bar",
                "service_icon": "https:\/\/secure.gravatar.com\/blavatar\/10f5b341f5d6e993232339174a9ba148?s=114",
                "id": 1
            }
        ],
        "ts": "1464356596.000015"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "I would use a spoon gouge instead of a dremel",
        "ts": "1464361869.000017"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Cool",
        "ts": "1464363734.000018"
    }
]