[
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "Check out the trello board, left column, \"Principles\" to see how James summed up our team session! I am sharing this current draft with Beam &amp; Works but we are plenty open to revision and iteration. Read and share your thoughts!",
        "ts": "1441841351.000002"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "THE NEW UNCORKED OFFICES SHOULD…\n\nINVITE YOU IN\nWhether you are a member of the team, a client or just a visitor - when you walk into Uncorked, we want to welcome you and pique your curiosity. Someone is always there to say hello. You will probably want to take a picture of that beautiful, geeky or mysterious (and perhaps unfinished) project in the entry-way, and you should! You are invited to have a cup of Uncorked’s signature mineral water or a maybe just a beer. You are invited to ask questions. To learn. To roll up your sleeves. To be yourself. When you walk into Uncorked, you are hereby invited to be one of us.\n\nBE AN ORGANIC REFLECTION OF OUR TEAM\nWe like natural light. We like wood and plants. We like a little bit of quirk. We like food and bicycles and Portland weather. The aesthetic of the space should mirror the charm of our team. Eclectic, but intentional. Professional, but approachable. Smart, but friendly. We are not a sleek and modern bunch, but we are pros through and through and we appreciate thoughtful, cohesive design. Wherever you are in the office, you should know you are at Uncorked, and you should have an immediate and intuitive sense of what Uncorked is all about.\n\nEXPOSE OUR PROCESS\nUncorked creates amazing stuff. That stuff runs the gamut between practical and playful - physical and digital - but regardless of the medium or the tone of the project, our exploration is always with purpose. We want to showcase that purpose by exposing our process. And, sometimes our process is a bit messy, but that’s ok - we want to share that too. We need to post things up, write on all sorts of surfaces, plug-in and project, and cut\/glue\/craft to our heart’s content. We want our workspace to reveal the experimental, collaborative, nature of both our work and our play.\n\nMAKE LIFE EASY\nOne of the advantages of creating a new space is that we don’t have to compromise modern conveniences for old-school retro charm. Things like getting in and out of the building, having accessible spaces dedicated to specific purposes, reducing clutter through plentiful and smart storage, and clever integration of technology should all be well-considered and foundational to the build out of the new office. The workspace should enable us to focus on our work, rather than getting in the way.\n\nCELEBRATE THE INDIVIDUAL\nWe are a team of makers - and as such, there is a desire for each person to be able to have a space to make their own. There are practical issues like desks that fit both short and tall. But each individual workspace also needs a place to display our 3D printed tchotchkes, handcrafted team awards, or hot sauce collections. In addition - it would be handy to have drawers to conceal our cough drops, wallets or growing sharpie collection. While we may not always be at our desk - we do want to know there is a home-away-from-home to come back to.\n\nPROVIDE ENVIRONMENTS THAT FACILITATE FLOW\nFlow comes in many forms. Sometimes you need a quiet nook to focus. Sometimes you need a private and intimate room for a one-on-one. We certainly need spaces for teams to come together, collaborate, and build. And, of course, Uncorked needs a common space to congregate, share food and laugh. Finding the right balance of quiet and noise, or private and public, isn’t going to be easy… but building out the office with spaces that intentionally address these needs, and with the flexibility to accommodate all sorts of workstyles is critical to team health and happiness.",
        "ts": "1441841352.000003",
        "reactions": [
            {
                "name": "clap",
                "users": [
                    "U0260V1BX",
                    "U02918BKW",
                    "U02HAJ6JF",
                    "U02618EV1",
                    "U06K2R98C"
                ],
                "count": 5
            }
        ]
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "also would anybody be interested in helping by composing these into a layout with typography and\/or visuals? would love to have some swagger to go with the gold.",
        "ts": "1441841598.000004"
    },
    {
        "text": "",
        "bot_id": "B098WNDGF",
        "mrkdwn": true,
        "attachments": [
            {
                "fallback": "David thinks we might be able to help. Collecting requirements.",
                "text": "David thinks we might be able to help. Collecting requirements.",
                "pretext": "New comment on card \"<https:\/\/trello.com\/c\/uJ6dJIub|Respond to Beam about Project Sign>\" by John Furukawa",
                "id": 1,
                "color": "8daec2"
            }
        ],
        "type": "message",
        "subtype": "bot_message",
        "ts": "1441860447.000005"
    },
    {
        "text": "",
        "bot_id": "B098WNDGF",
        "mrkdwn": true,
        "attachments": [
            {
                "fallback": "New card \"<https:\/\/trello.com\/c\/X65DlHE3|smart door locks that realize who I am based on my phone so I don't have to get my keys out?!>\" added to list \"<https:\/\/trello.com\/b\/DD5aZA2G|Ideas>\"",
                "text": "New card \"<https:\/\/trello.com\/c\/X65DlHE3|smart door locks that realize who I am based on my phone so I don't have to get my keys out?!>\" added to list \"<https:\/\/trello.com\/b\/DD5aZA2G|Ideas>\"",
                "id": 1,
                "color": "8daec2"
            }
        ],
        "type": "message",
        "subtype": "bot_message",
        "ts": "1441861690.000006"
    }
]