[
    {
        "user": "U1ZG1UCAK",
        "text": "<@U1ZG1UCAK|midori> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1496684487.172296"
    },
    {
        "type": "message",
        "user": "U1ZG1UCAK",
        "text": "can I come to arya stand up tomorrow? I have some questions about the stairs\/screen set up",
        "ts": "1496684538.191021"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "our standups are actually rarely a) a standup b) on time or at all ... so wanna ask me?",
        "ts": "1496685319.476475"
    },
    {
        "type": "message",
        "user": "U1ZG1UCAK",
        "text": "oh, ok. I’ve already chatted with Felix about this, but it occurred to me that if the screen is not far enough away from the front of the stairs, a person sitting in a wheelchair cannot comfortably look at the screen. It’s sounding like it’s going to be okay, but I wanted to see what our plans are for accessibility re: stairs\/meetings\/presentations on the stairs.",
        "ts": "1496700669.557137"
    },
    {
        "type": "message",
        "user": "U1ZG1UCAK",
        "text": "I chatted with a guy who runs a company that retrofits buildings to be accessible, at Accessibility Conference last week, and he recommended &gt;5 feet for mobility (ability to move wheelchair safely with screen down) and &gt;10 feet for comfort. I don’t know what conversations have already occurred on this, so forgive me if this is repetition. I am simply curious and want UCS to be more socially and physically accessible.",
        "ts": "1496700983.625736"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "All makes sense and it's great to be advocating for it. On top of the physical space, we may solve video recording in the medium term, which would allow broadcast to offsite folks. Maybe a helpful accommodation? The spacing isn't really going to be adjustable thanks to the geometry of the space. We narrowly avoided having to use a $12K prism as it is!",
        "ts": "1496706631.659996"
    },
    {
        "type": "message",
        "user": "U1ZG1UCAK",
        "text": "Right, I had some similar thinking as well, that it might work to have some screens that can be used during presentations and set them up at the top of the stairs. It could be a dual purpose of providing for people who cannot use the stairs, as well as overflow for larger gatherings.",
        "ts": "1496707017.720487"
    },
    {
        "type": "message",
        "user": "U0H4SJN11",
        "text": "Definitely a possibility to do. Open broadcast (software I've evaluated) has an external monitor output per video input.",
        "ts": "1496707387.780120"
    }
]