[
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "<http:\/\/hackaday.com\/2017\/07\/14\/fabricate-your-own-tabletop-gaming-props\/>",
        "attachments": [
            {
                "service_name": "Hackaday",
                "service_url": "http:\/\/hackaday.com",
                "title": "Fabricate Your Own Tabletop Gaming Props",
                "title_link": "http:\/\/hackaday.com\/2017\/07\/14\/fabricate-your-own-tabletop-gaming-props\/",
                "author_name": "John Baichtal",
                "author_link": "https:\/\/hackaday.com\/author\/nerdyjb\/",
                "thumb_url": "https:\/\/i1.wp.com\/hackadaycom.files.wordpress.com\/2017\/06\/100_4309_display_large.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 144,
                "text": "Delve into the mysterious world of tabletop roleplaying games. Warhammer Fantasy Roleplay, Shadowrun, Pathfinder, Ars Magica, Vampire, whatever gets your dice rollin&rsquo; &mdash; metaphorically in the case of a diceless system. This might very well be your daddy&rsquo;s D&amp;D. If you&rsquo;re not a gamer, you&rsquo;re certainly familiar with the concept. People sit around a table pretending to have an epic adventure, often adding a random element with the help of dice. A map is often displayed on the table, sized for figures that show the various heroes and villains.\nAs a person with access to a variety of CNC machines I find myself wanting to create things to make gameplay more fun. I want to build a scale castle and have a siege. I want to conduct a ship-to-ship battle with wooden ships built to scale. But I also think smaller. What is something I could make that would help us every day? Say, a box for dice. Not every project needs to be the dragon&rsquo;s lair.\nIt turns out a lot of other folks have been thinking about the same thing.\n\nGo Modular\nWe are grownups and the temptation is to apply the same level of competence to our hobbies that we would apply to our jobs. So why not go all out and make a gorgeous temple or castle or whatever? If you&rsquo;re artistic you can paint laser-cut wood to look like oak planks, and decorate 3D-printed hills with tufts of grass from the model train store.\nThe problem with building and decorating the ultimate boss lair is, what do you do with the thing afterwards? As great as that volcano castle might have been for the boss battle, you can&rsquo;t exactly turn it into the village pub. Of course, not all creations are epic. For instance, Thingiverse user [Yngel]&rsquo;s laser cut log cabin&nbsp;won&rsquo;t be confused for a dark paladin&rsquo;s castle. In the end, however, it has the same weakness: you can only using it for so many settings.\nThe solution might a modular system that can be used to construct a variety of maps. Walls can be repurposed; one campaign&rsquo;s guard tower is another&rsquo;s ruined keep. The keep becomes a mansion and the inn becomes a blacksmith&rsquo;s.\nYou can still accomplish a lot even if you skip the walls. For instance, things like barrels, statues, fountains and so forth that can be dropped into any layout. You can find individual items on 3D-printing file sites like Thingiverse&nbsp;&mdash; searching on 30mm will get you started, but there are (of course) other scales as well, like 28mm and 18mm.\nThingiverse user&nbsp;[dutchmogul] has contributed dozens of gaming props and sets to the site, and his Delving Decor series includes ordinary things like heaps of rocks, pillars, bookshelves and crates. His Wolf Throne can be seen to the left. [dutchmogul] has made his passion into a profession with a small game design company, Ill Gotten Games.\nThere&rsquo;s definitely money to be made. A company named Dwarven Forge folks made a run on Kickstarter with their $100K goal blowing up to $2.2M. GeekDad has a series of great posts about Dwarven Forge that can fill you in on that system. One of the cool things that came out of the project is the creation of Open Forge, an open standard for creating new elements that connect to official Dwarven Forge products.\nThere are other examples: pw_jamison&rsquo;s gantry set includes everything you need to build a science-fiction catwalk. He also includes all of the parts in SketchUp so you can create your own virtual design prior to printing.\nFinally, [dutchmogul]&rsquo;s&nbsp;Wayfarer modular scifi gaming tiles have a lot to like about them, including connections made out of cut-up magnetic business cards.\nFigures\nDon&rsquo;t discount the ultimate in modular gaming: the figure. Formerly made out of lead, in the foggy years before abatement occurred and we all switched to white metal. More recently we&rsquo;ve started to see some quality plastic figures; some cast, some 3D-printed.\nLet&rsquo;s face it, buying figures sucks because they cost a lot, and usually don&rsquo;t look a whole lot like your character. Thingiverse is getting more and more figures, with users like [dutchmogul] uploading their own designs, giving you more options for finding or adapting the perfect figure.\nSkilled designers, of course, can simply create their own. However, we can&rsquo;t all be good at everything. Services like Hero Forge guide you through creating your own figure, deciding on race, body dimensions, pose, equipment, and so on. Of course the company also is willing to print your figure for you in two different kinds of plastic, steel, or bronze, with prices ranging from $15 to $100 a figure. Weakly, they don&rsquo;t allow you to download the design and print it yourself, though you can grab a PNG.\nOr Just Stick with the Mechanics\nWhile cool layouts are great, what I look for is something that makes my games easier to play.&nbsp;My interest is purely mechanical. How does the project help me have more fun?\nFor instance, we have a lot of huge battles with dozens, often upwards of 100 figures on the board. I have to remember who&rsquo;s side each figure is on, what role they play, and their general health. We play on a 1&Prime; grid so I laser-cut 1&Prime; squares for bipeds, 1&Prime;x2&Prime; rectangles for horses, 2&Prime;x4&Prime; for wagons, and so on, with a coat of spray paint to help differentiate one from another. You can also use the squares as color codes to remind you of a character&rsquo;s status. For instance we use yellow squares for characters suffering from magical fear (it&rsquo;s pee, get it?) as well as orange for on fire and red for bleeding.\nAnother area I&rsquo;ve noticed we need help is the matter of a character&rsquo;s altitude. If someone is on top of a tree, that figure really should be that high up. I laser-cut trees out of 3mm plywood, and my daughter painted them to look realistic, but their importance to me is that figures can be placed on the branches, both lower to the ground and higher up. The perfect place to put a sniper! What if your character is flying? Wouldn&rsquo;t it be better if the map accurately showed how high up that person is?\nRulers, templates, and other measuring devices also bear being customized or re-created. I lasered a set of blast templates for Warhammer Fantasy Roleplay using 1\/4&Prime; acrylic and they work great for determining which figure gets hit by what effect &mdash; simply hold the template over the battlefield and look through it.\nAnother area laser-cut shapes assist are vehicles. Say you have a space ship with 8 figures on it. Moving it around the table is a pain because you have to reposition the figures every time. What if you had a ship-shaped piece of wood on which the figures could rest?\nYou can take it a step further by making a whole boat. Remember how I want to make my own pirate ship? Well, I did a dry run with the&nbsp;Scimitar. It&rsquo;s a two-deck schooner complete with a pair of crow&rsquo;s nests able to accommodate 30mm figures. I&rsquo;d like to increase it to full man-o-war size with multiple decks that lift off, but I&rsquo;m starting small. It can get crazy very quickly. Realistically a 30mm-scale ship is going to cover the entire table, with a 50&Prime; model approximating the size of a 300-foot ship.\nMy boat suffers from the same problem as the volcano lair: very often it has no use. Even if there&rsquo;s a boat, it might not be the same boat. Or there&rsquo;s no need for my model because no fight will take place on the boat.\nMoving On\nThere are so many areas left to cover. What&rsquo;s up with CNCed game-world maps? What&rsquo;s the deal with molding your own dice? I want to create my own bento box for index cards and pencils. I want to build a rack that fits only 20-sided dice. I want to make acrylic platforms to simulate a character flying.\nAs an inherently creative and imaginative hobby, tabletop gaming invites this sort of exploration. Run with it! With laser cutters and…",
                "fallback": "Hackaday Link: Fabricate Your Own Tabletop Gaming Props",
                "from_url": "http:\/\/hackaday.com\/2017\/07\/14\/fabricate-your-own-tabletop-gaming-props\/",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/hackaday-2\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1500053729.800845"
    },
    {
        "type": "message",
        "user": "U3M4RRNQ5",
        "text": "weekend reading: <http:\/\/www.gameinformer.com\/b\/features\/archive\/2017\/07\/14\/top-of-the-table-so-you-want-to-be-a-dungeon-master-part-2.aspx?utm_content=bufferfd8f3&amp;utm_medium=social&amp;utm_source=twitter.com&amp;utm_campaign=buffer>",
        "attachments": [
            {
                "service_name": "Game Informer",
                "title": "Top Of The Table – So You Want To Be A Dungeon Master, Part 2",
                "title_link": "http:\/\/www.gameinformer.com\/b\/features\/archive\/2017\/07\/14\/top-of-the-table-so-you-want-to-be-a-dungeon-master-part-2.aspx?utm_content=bufferfd8f3&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer",
                "text": "You’ve prepped your adventure, but how do you get all the hard work to pay off and run a great session with your friends?",
                "fallback": "Game Informer: Top Of The Table – So You Want To Be A Dungeon Master, Part 2",
                "from_url": "http:\/\/www.gameinformer.com\/b\/features\/archive\/2017\/07\/14\/top-of-the-table-so-you-want-to-be-a-dungeon-master-part-2.aspx?utm_content=bufferfd8f3&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer",
                "thumb_url": "http:\/\/www.gameinformer.com\/cfs-filesystemfile.ashx\/__key\/CommunityServer-Components-SiteFiles\/imagefeed-featured-columns-topofthetable-dm2\/TotT_5F00_200_5F00_dmg2.jpg",
                "thumb_width": 200,
                "thumb_height": 179,
                "service_icon": "http:\/\/www.gameinformer.com\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1500063268.291884",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U2X0KKTGT"
                ],
                "count": 1
            }
        ]
    }
]