[
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "hey <@U0B9N0HF0> - Im likely going to be stuck in this Product Partner meeting until after the mobile call starts. You cool to run the check in without me?",
        "ts": "1480617175.000002"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Yep!",
        "ts": "1480617286.000003"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "thanks\/sorry - I’ll try to hop in late if I can",
        "ts": "1480617299.000004"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Cool. No stress. Just going to be discussing timeline.",
        "ts": "1480617367.000005"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "word",
        "ts": "1480617375.000006"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Hey team. Specifically who I haven't talked to <@U02F9CXTL> <@U0265G76F> Please feel free to join the 11, but presently the agenda is mostly just a status call, so no pressure. I can take 1:1 :slightly_smiling_face: Whatever you prefer",
        "ts": "1480618657.000007"
    },
    {
        "type": "message",
        "user": "U02F9CXTL",
        "text": "coolio - going to work on some BL color then",
        "ts": "1480618910.000008"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "No major updates. Gidge is going to work on getting us the 17' BL schedule today. Patrick is going to be doing a status presentation to BL execs about mobile for 17'.  Patrick _has_ requested a few features to be tested that Gidge has prototyped. Nothing really outside of the expected feature set, but he did ask for the \"color panels\" feature that we talked about in the design jam about a year ago. As a matter of framing, I spent most the call reiterating the need for research as a way to support emergent design cases vs. testing specific features and asking users whether they thought that was useful. No major news on the SOW front. I reiterated that if we need to make any changes to the language to explicitly say \"We will not be collecting any guest specific info\" we can. Didn't seem that it has got to that point yet.",
        "ts": "1480620365.000009"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Note: Both Josh and Gidge seem really on board with the emergent design approach and will try and reinforce that message.",
        "ts": "1480620421.000010"
    },
    {
        "type": "message",
        "user": "U1172PRDX",
        "text": "thanks for the update!",
        "ts": "1480620768.000011"
    }
]