[
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Good morning. I’m going to use our 11:00 with Gidge to go over a few of the line items they added in the SOW, just to make sure we are operating from a shared understanding. Tbh, I don’t see anything that would be an issue, but best to get assumptions out on table. I’ll also be reviewing the proposed schedule I’ve put together so far and discussing the timing of booking Sarah and Megan’s initial BrandLab shadow. Mostly all house keeping stuff, so today’s call is optional. If you’d like to join, more than welcome to. If you’d like to use that hour towards something else, please do. Thanks and please let me know of any questions you have or topics you’d like covered.",
        "ts": "1481822160.000002"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Thanks Rob, worth re-sharing the schedule you’re discussing?  I think you and I are sync’d on it.  This proposes a shadow start mid Jan and takes into consideraton projects like Singapore and Net Contributor, right?",
        "ts": "1481822283.000003"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Yeah. Schedule is currently in forecast, but I’ll be taking a stab at building one out in team gantt today. Fwiw, we are about to run out of available projects on our account type :face_with_rolling_eyes:",
        "ts": "1481822721.000004"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "ugh, i just deleted a bunch too",
        "ts": "1481822822.000005"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "me too",
        "ts": "1481822874.000006"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "I think we have approx. 2 projects left rn",
        "ts": "1481822881.000007"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "3 now",
        "ts": "1481822940.000008"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "cool, thats fine.",
        "ts": "1481823308.000009"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Just got off phone with Gidge. A few things to note:",
        "ts": "1481831929.000010"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "- Went through each deliverable in the SOW with him and we’re on the same page. No special gotchas. No change in scope.",
        "ts": "1481831959.000011"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "-Went through timeline (will attach below) and both operating from shared understanding there",
        "ts": "1481831998.000012"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "- Gidge indicated that Kim is beginning to creep on scope “keeps mentioning campfire integration (ughh)”. We think this might be manly due to the amount of time passed between delivering the initial concept and that, with the prototypes being developed, this is putting her more int he weeds.  I think it would be helpful for us to put together some short kind of “This is really fn’ exciting!” deck to pass along. Thoughts?",
        "ts": "1481832147.000013"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "- Prototype IS coming along nicely though. Gidge has the ability to assign mobile devices, send out live questions, receive responses.",
        "ts": "1481832214.000014"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "-Current thinking is build set to start in April",
        "ts": "1481832227.000015"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "The April target implying that we have done the work to validate and iterate before then?",
        "ts": "1481832290.000016"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Yes. Research wrapping beginning of March and then March for synthesis and project planning",
        "ts": "1481832441.000017"
    },
    {
        "type": "message",
        "subtype": "file_share",
        "text": "<@U0B9N0HF0|rob> uploaded a file: <https:\/\/uncorked.slack.com\/files\/rob\/F3FDNC8JW\/google_workshop_companion_research_.pdf|Google_Workshop_Companion_Research_.pdf>",
        "file": {
            "id": "F3FDNC8JW",
            "created": 1481832461,
            "timestamp": 1481832461,
            "name": "Google_Workshop_Companion_Research_.pdf",
            "title": "Google_Workshop_Companion_Research_.pdf",
            "mimetype": "application\/pdf",
            "filetype": "pdf",
            "pretty_type": "PDF",
            "user": "U0B9N0HF0",
            "editable": false,
            "size": 103718,
            "mode": "hosted",
            "is_external": false,
            "external_type": "",
            "is_public": true,
            "public_url_shared": false,
            "display_as_bot": false,
            "username": "",
            "url_private": "https:\/\/files.slack.com\/files-pri\/T0260V1BR-F3FDNC8JW\/google_workshop_companion_research_.pdf?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "url_private_download": "https:\/\/files.slack.com\/files-pri\/T0260V1BR-F3FDNC8JW\/download\/google_workshop_companion_research_.pdf?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "permalink": "https:\/\/uncorked.slack.com\/files\/rob\/F3FDNC8JW\/google_workshop_companion_research_.pdf",
            "permalink_public": "https:\/\/slack-files.com\/T0260V1BR-F3FDNC8JW-e3a52023ad",
            "channels": [
                "C0E8GSWHF"
            ],
            "groups": [],
            "ims": [],
            "comments_count": 0
        },
        "user": "U0B9N0HF0",
        "upload": true,
        "display_as_bot": false,
        "username": "rob",
        "bot_id": null,
        "ts": "1481832462.000018"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Schedule based on current SOW",
        "ts": "1481832470.000019"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "so when we say “build” we’re talking “design”?",
        "ts": "1481832494.000020"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "or dev?",
        "ts": "1481832502.000021"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "(or both?)",
        "ts": "1481832544.000022"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "both",
        "ts": "1481832573.000023"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Current thinking is the next 3 parts of the project are: Research, Build, Support",
        "ts": "1481832656.000024"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "also - what are we thinking in terms of “Concept Package Presentation\"",
        "ts": "1481832666.000025"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Just discussed this with Gidge. Concept Package Presentation is the output of the concept based on our research findings and a project plan.",
        "ts": "1481832701.000026"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "so then should we shift that to post-research synthesis?",
        "ts": "1481832723.000027"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "I’m sorry? The way I have it scheduled is a sprint of synthesis (This is what we saw and what it means) and then a Sprint of (based on what we saw, this is what we are recommending)",
        "ts": "1481832798.000028"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Recommending includes either A.) Stick with concept B.) Update concept C.) Here’s how we’ll do it",
        "ts": "1481832827.000029"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "maybe I’m reading the schedule incorrectly",
        "ts": "1481832831.000030"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "I think maybe I jumped up a line",
        "ts": "1481832889.000031"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "my bad",
        "ts": "1481832934.000032"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "I can see the misinterpretation. The concept package is above the synthesis, but the corresponding lines have package following synthesis. I’ll fix, because I’m sure you won’t be the only person reading it that way",
        "ts": "1481832934.000033"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "cool - thanks\/sorry",
        "ts": "1481832968.000034"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "so just so I’m clear (sorry I’m slow here) we end march with a synthesis of our research",
        "ts": "1481833024.000035"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "and begin april with the Concept package presentation",
        "ts": "1481833051.000036"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "is that right?",
        "ts": "1481833065.000037"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Im asking because I would not be shocked if the timeline from research synthesis to presentation to acceptance of the presentation is like 3ish weeks, and I just want to make sure that either 1) that gels with your thinking and 2) that I’m thinking about this the right way",
        "ts": "1481833213.000038"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Yeah I have final report\/concept package presentation due March 30th. SOW gives us 30 days from wrapping up research, which is Monday April 3rd (tentatively, research dates still haven’t been scheduled). I wanted to aim to have everything done by March 30th, which gives us a Friday and a weekend to make any last second changes",
        "ts": "1481833841.000039"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "okay - I think I’m getting closer. So we wrap research + research synthesis by March 20th",
        "ts": "1481834203.000040"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "is that right?",
        "ts": "1481834206.000041"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Then Concept Package Draft is meant to be done by about the 30th?",
        "ts": "1481834362.000042"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Yeah. I had synthesis going from 3rd to 17th. Package from 20th-30th. Delivering on the 30th of March.",
        "edited": {
            "user": "U0B9N0HF0",
            "ts": "1481834691.000000"
        },
        "ts": "1481834667.000043"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Okay, so I think that works as long as research validates our concept. Do we need to consider the possibility that we need to refactor our concept in great depth? Or will we plan on handling that as a contingency?",
        "ts": "1481834998.000045"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Put another way, I don’t think we can package new (or even new-ish) concept in 10 days",
        "ts": "1481835027.000046"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Agreed. I mean if the concept falls on it’s face, then it’s back to square 1 and the research worked. My reading of the SOW is that we are not on the hook for a concept in 10 days if this one fails. Only that we are on the hook for a presentation if Google accepts the concept package. I’ll post contract language below",
        "ts": "1481835429.000047"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "_ *Concept Package Draft. Within 30 days of the Initial Presentation being approved by Google, Contractor will submit a Concept Package draft for Google’s review (the “Concept Package Draft”)._ Google will provide feedback on the Concept Package Draft as soon as commercially possible, which Contractor will incorporate into subsequent Concept Package drafts until the Concept Package Draft is approved by Google per the Acceptance Criteria procedure set forth in Section 8 below._ \n_Concept Package Presentation. Following Google’s acceptance of the Concept Package Draft, Contractor will present the final Concept Package to Google at a date and location mutually agreed upon between the Parties_ _(“Concept Package Presentation”). The Concept Package Presentation will be subject to the Acceptance Criteria procedure set forth in Section 12.1 below. _\n_Research. Within 30 days of conducting the Research, Contractor will provide Google with the results of the Research in a form and manner as further detailed in Appendix A*. _",
        "edited": {
            "user": "U0B9N0HF0",
            "ts": "1481835684.000000"
        },
        "ts": "1481835432.000048"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "So there is a bit of a risk of ad infinitum concept package drafts until  “Concept package Draft is approved by Google per the Acceptance Criteria”. Thoughts?",
        "ts": "1481835576.000049"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "so, before I go into that, is our current understanding that we’re researching the concept as presented to Kim last year?",
        "ts": "1481835711.000056"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Yes. With the only minor tweak being that “she wants to test including the campfire” somehow",
        "ts": "1481835734.000057"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "And notifications. Otherwise, concept that we presented “time and space” as Gidge calls it, is what she is expecting",
        "ts": "1481835785.000058"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "okay - so that’s actually a pretty major tweek",
        "ts": "1481835903.000059"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "what are notifications in this context?",
        "ts": "1481835927.000060"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "sorry - I’m honestly not trying to be a pain in the ass",
        "ts": "1481835963.000061"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "not at all. In the context that Gidge has been mentioning, notifications is an extension of the timer. So, “Lunch is about to wrap up in 15- please start cleaning up” or “5 minutes until break out session is ending\"",
        "ts": "1481836139.000062"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "cool",
        "ts": "1481836158.000063"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "The campfire is yes, a major tweak and one that I think won’t ever work. Gidge is 100% in agreement, but kind of in a hard place because Kim is asking for it to “be tested at least”",
        "ts": "1481836198.000064"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "He was mentioning it could be part of an onboarding exercise for teaching the Live Question UI or something to that effect. When the CEO is up there. Idk. That part is frustrating.",
        "ts": "1481836286.000065"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "so - that’s actually a thing I think we should very very seriously consider pushing back on",
        "ts": "1481836291.000066"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "like “be tested at least” is sort of a non-functioning sentence in this context",
        "ts": "1481836318.000067"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "In agreement. I think the time and place to do that is in our “test plan”. Leave it out, but address why we did",
        "ts": "1481836330.000068"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "okay cool",
        "ts": "1481836407.000069"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "so then - in simple terms, do we have a sense of the Concept Package is different from our original presentation? At least in terms of content? Is just an updated version of that, or something different?",
        "ts": "1481836487.000070"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "by the way - Im pushing hard on this because we’re going to have like 9000 google things going on the first part of the year and I want to make sure I have a good mental model of all of them",
        "ts": "1481836559.000071"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "100% I appreciate it",
        "ts": "1481836599.000072"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Concept Package Draft is not defined in SOW. The associated deliverable is: Final Research Workshop analysis Report\nHigh level findings including insights, risks, take-away\nPlan outlining a new project for development of the final app and revisions to the Prototype",
        "ts": "1481836690.000073"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "I reviewed that with Gidge today and it’s basically a set of decks that reviews original concept, test plan, test results, recommended updates to concepts (if applicable) and project plan going forward",
        "ts": "1481836768.000074"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Concept Package Presentation is the concept for the app that we are planning to build",
        "ts": "1481836793.000075"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "That only comes after Google has approved the concept as described in the concept package draft (concept+recommended updates)",
        "ts": "1481836830.000076"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "okay",
        "ts": "1481836864.000077"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "thats clearer - thanks!",
        "ts": "1481837030.000078"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Im still mildly nervous about turning around a concept deck in 10 days, but as long as we’re all on the same page that this is only if the concept basically validates, I think we can make it work",
        "ts": "1481837183.000079"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Agreed. The good news is that the SOW states with regard to approval:  _If Google rejects, the Google Project Manager will provide reasons for the rejection and the parties will agree on a new deadline for Contractor to correct the deficiencies (at Contractor’s expense). Contractor will revise the Deliverable per Google’s instruction and submit another Acceptance Request once the revision of the Deliverable is complete. This process will be repeated until Google accepts all Deliverables by providing Contractor with written acceptance of each Deliverable._",
        "edited": {
            "user": "U0B9N0HF0",
            "ts": "1481837292.000000"
        },
        "ts": "1481837283.000080"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "So we get more time if major revisions need to be made",
        "ts": "1481837308.000082"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "cool",
        "ts": "1481837323.000083"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "<@U0B9N0HF0> when talking with Gidge, do you think we're all on the same page that \"project plan going forward\" is concept level, not detailed design that they can use to start building the next day?",
        "ts": "1481837346.000084"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Oh yeah!",
        "ts": "1481837364.000085"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Project Plan is essentially a Gannt chart",
        "ts": "1481837381.000086"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "In that project plan, we will afford for design, etc.",
        "ts": "1481837405.000087"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "ok, so then recommended updates to concepts are expected to be a similar fidelity to the previous deck",
        "ts": "1481837415.000088"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Yeah. And I think we’ll have this conversation more as we get closer to that part of the project. The question I conveyed to Gidge was: Is it an updated deck of our original concept and a project plan and he said yes. I think the scale of what “updated” means is probably derived from just how different the concept is. Personally, I don’t foresee it being much different, but am aware of the possibiltity",
        "ts": "1481837553.000089"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Btw, I really do appreciate the questions, so please keep them coming. Helps me build the mental model too",
        "ts": "1481837632.000090"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": ":slightly_smiling_face:",
        "ts": "1481837645.000091"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "Im going to take a quick break for lunch - back in a little bit",
        "ts": "1481837664.000092"
    }
]