[
    {
        "type": "message",
        "user": "U1172PRDX",
        "text": "hey guys i just caught up on the discussion",
        "ts": "1472570681.000002"
    },
    {
        "type": "message",
        "user": "U1172PRDX",
        "text": "all good thoughts!",
        "ts": "1472570688.000003"
    },
    {
        "type": "message",
        "user": "U1172PRDX",
        "text": "i know that we’re still looking in to me and megan going down to sbo to shadow a brandlab, but is there any way that we could get a face to face with patrick and gidge? i think some of my frustration is that i can’t get a great read on these guys because i don’t know them very well.",
        "ts": "1472570782.000004"
    },
    {
        "type": "message",
        "user": "U1172PRDX",
        "text": "i agree that many of our frustrations are coming from a maddening game of telephone and gidge seems caught in the middle",
        "ts": "1472570818.000005"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "We can certainly set up a hangout. Patrick is in Paris, which makes real life more complicated. \n\nI agree it'd be good to reconnect with Patrick directly, as he was our contact leading up to all of this. In addition to putting faces to names, I think we'd have opportunity to frame it how we want as well as hear from them ",
        "ts": "1472571248.000006"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Yeah, perhaps as part of the 16’ engagement, maybe we could hold another onsite down in SBO",
        "ts": "1472575977.000007"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "with Patrick, Gidge, Josh, Naheed, our team",
        "ts": "1472575995.000008"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "<@U0260V4K1> Let me know when a good time to get together would be for you. I can just calendar something, but I always opt for earlier :slightly_smiling_face:",
        "ts": "1472576074.000009"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "yeah - I’m trying to get my thoughts down on paper now, maybe like 11-11:30-ish?",
        "ts": "1472576117.000010"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "ok cool",
        "ts": "1472576158.000011"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "I’m adding some additional thoughts to this draft, which I’m not totally through, but will send your way shortly. Let me know if you’re already meeting and I’ll send thoughts in progress.",
        "ts": "1472580983.000012"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "cool - thanks. I think you’re fine on time. <@U0B9N0HF0>, lets wait for megan and Ewald’s thoughts before we send anything through",
        "ts": "1472581074.000013"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "my hope is that we’ll be able to underscore the area it looks like we agree on in immediate steps, so the main message can be: yes, let’s move forward with the plan, and of course it’s all an evolution, and our test results should provide a good foundation for that evolution",
        "ts": "1472581248.000014"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "I put out a draft with acquiescence on the storyboard\/wireframing specific interactions.Seems like the simplest approach to moving forward, but very open to other tactics. Main goal for me is I would like this email to be the final chain of events before all coming together on approach and sending out the SOW, so if we could end what we send on a closing note that pivots to SOW, that’d be great.",
        "ts": "1472584857.000015"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Looping back here, final draft email is awaiting sign off. One thing we didn’t discuss much of is whether we want to respond to Gidge’s request for a Hangout so we can level set? To note: We currently don’t address it",
        "ts": "1472589800.000016"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "up to you all, but since he offered the GVC “if needed,” it seems like our calls aren’t clarifying things right now, so if this email got us to a shared agreement and allowed us to move forward, I’d love to do that without a call",
        "ts": "1472591661.000017"
    },
    {
        "type": "message",
        "user": "U1172PRDX",
        "text": "yea i would say that a call could happen once we get this project officially signed off on by everyone and megan and i can get a formal intro to the rest of the team",
        "ts": "1472591758.000018"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "agreed",
        "ts": "1472592319.000019"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "also - the email looks nice to me",
        "ts": "1472592328.000020"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "same - i’m good with email and potential GVC future stuff",
        "ts": "1472592426.000021"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "thanks and apologies for so many go arounds getting here.",
        "ts": "1472592436.000022"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Cool. Sent!",
        "ts": "1472593526.000023"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "thanks <@U0B9N0HF0>",
        "ts": "1472593599.000024"
    },
    {
        "type": "message",
        "user": "U0260V4K1",
        "text": "thanks <@U0B9N0HF0> (and everyone else for helping with this. Sorry a single email thread took so much time, but I think getting things started in the right direction is super critical)",
        "ts": "1472593690.000025"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Agreed. And thanks to all. I think if we frame it as a single-email thread it took way too long :wink:, but if we frame it as it actually is, which is a fairly decisive moment in the strategy, philosophy and direction of the project, then it deserved all the attention it got :slightly_smiling_face: Here’s to hoping the message is received well and we can move forward with the plan as we were thinking it",
        "ts": "1472593891.000026"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Also, I know email sent twice :stuck_out_tongue:. Sorry about that. It was a Inbox formatting snafu that was a result of my attempts to clear purple font formatting. The text editor used to clear formatting had the adverse effect of creating significant line breaks in inbox, so I resent a version that didn't have the line breaks.",
        "edited": {
            "user": "U0B9N0HF0",
            "ts": "1472594142.000000"
        },
        "ts": "1472594128.000027"
    }
]