[
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "1mm US workers miss work each day due to workplace stress",
        "ts": "1472595357.000046"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Depression results in more days of disability than chronic health conditions such as heart disease, hypertension and diabetes.",
        "ts": "1472595376.000047"
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "- Draw a snake with a funny hat\n- Look up lyrics to a song you used to sing in grade school\n- Stand up, touch toes, and get low get low.\n- Make vanilla pudding. Put in mayo jar. Eat in public.\n- Make an appointment with your dentist.\n- Unfriend someone on Facebook, twitter, or instagram. Fuck it you don’t need them.\n- Imagine Kanye falling into a well of jello\n- If Britney can make it through 2007, you can make it through this day.\n- Give 10 high fives today\n- Choose one: Comic Sense of Comic Sans",
        "ts": "1472595563.000048"
    },
    {
        "type": "message",
        "user": "U0GN0A9EV",
        "text": "Excellent job! I couldn’t be happier with the way everything turned out. The execs were very impressed and curious about your work and I think everything will be implemented. I’m proud and inspired.",
        "ts": "1472608842.000049"
    },
    {
        "type": "message",
        "user": "U0J6TE0CA",
        "text": "Even the mysteriously large hole in the box?",
        "ts": "1472608876.000050",
        "reactions": [
            {
                "name": "bug",
                "users": [
                    "U0GN0A9EV"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Ivan beat me to the punch. (Look, we got him posting to slack - after hours. We ARE part of the problem.  Jk)",
        "ts": "1472613462.000051"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "I'm proud to have partnered with this team. Thanks for being open minded, tough but fair. ",
        "ts": "1472613486.000052"
    }
]