[
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Team, having a bit of a contractor issue at the house right now. Trying to get resolved as quickly as possible but I'm a bit delayed this am.  Will keep you posted. ",
        "ts": "1492617318.291967"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Good news, client digs the agenda and is excited for our preso",
        "ts": "1492618233.716276"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "I will officially not make it to stand up. I've been in touch with Megan and Ivan with the plan - deck looks good but let's ensure its proofed and printed\/posted this morning so we can take a holistic look at language. \n\nI'll add in next steps and clean up the appendix. Otherwise, just a fresh look when I get in. \n\nI plan to send to client by 11:50. ",
        "ts": "1492618922.014453"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!here|@here> Elise, Ali, Cara and I are done futzing with deck and we're printing it out for holistic review.",
        "ts": "1492623095.773366"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "for later, I found this interesting - \n\n“Bots also made an appearence, with chat extensions. Previously, bots were things you engaged with one-on-one. Now, you can drag them into group conversations. Spotify is an early adopter here. You can now use it to share tracks within group conversations.”\n\n<https:\/\/thenextweb.com\/facebook\/2017\/04\/18\/facebooks-messenger-platform-2-0-will-one-stop-shop-work-play-social\/#.tnw_VVwWAh40>",
        "attachments": [
            {
                "service_name": "The Next Web",
                "title": "Facebook’s Messenger Platform 2.0 will be your one-stop-shop for work, play and social",
                "title_link": "https:\/\/thenextweb.com\/facebook\/2017\/04\/18\/facebooks-messenger-platform-2-0-will-one-stop-shop-work-play-social\/#.tnw_VVwWAh40",
                "text": "Messenger is more than just a chat app. We use it to share video, play games, and chat in real time. Indeed, it’s become a veritable commercial platform, supporting payments and transactions, and is used by businesses to provide real-time support. With that in mind, it’s hardly surprising that much of the focus at the …",
                "fallback": "The Next Web: Facebook’s Messenger Platform 2.0 will be your one-stop-shop for work, play and social",
                "image_url": "https:\/\/cdn3.tnwcdn.com\/wp-content\/blogs.dir\/1\/files\/2017\/04\/Messenger20featured.png",
                "image_width": 525,
                "image_height": 250,
                "fields": [
                    {
                        "title": "Author",
                        "value": "Matthew Hughes",
                        "short": true
                    }
                ],
                "ts": 1492542301,
                "from_url": "https:\/\/thenextweb.com\/facebook\/2017\/04\/18\/facebooks-messenger-platform-2-0-will-one-stop-shop-work-play-social\/#.tnw_VVwWAh40",
                "image_bytes": 664804,
                "service_icon": "https:\/\/cdn0.tnwcdn.com\/wp-content\/themes\/cyberdelia\/assets\/icons\/apple-touch-icon-57x57.png?v=1492505980",
                "id": 1
            }
        ],
        "ts": "1492624443.343068"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Duplicated and PDF'd.  Both in our gDrive: <https:\/\/drive.google.com\/open?id=0B2hvp3pmOYCFMjFsbURtQWJRUHc>",
        "ts": "1492627449.633598"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "we're ready for this. y'all have rocked this thus far.",
        "ts": "1492627466.640781"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "FYI, I'll open call up by ensuring everyone has joined, i'll mention everyone on our side that's participating and then megan will handle the first few slides until we get to best practices. \n\nWhen we arrive at Opportunity slides I may interject to let client know what we're asking of them: 'we've cast a wide net, we want to narrow our focus for the next sprint, help us by letting us know what resonates with you or if there's anything to avoid or pursue in the future as oppossed to now\"\n\nI'll be driving the presentation deck from my machine and trying to take hand written notes but other note takers are welcome!",
        "ts": "1492628672.152560"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "we in courtyard, im setting up now",
        "ts": "1492631586.281201"
    },
    {
        "type": "message",
        "user": "U4VTSDW7P",
        "text": "Hi <!channel> ummmm...can we use the channel to brainstorm Assistant names? This is internal for now. So far we have Cyrano, Roxanne, Steve Martin. Or maybe Stephanie Martin?",
        "ts": "1492640647.380891"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Paige? Ezra? Lexy? Ophelia? Sandra? (the meaning behind all of those are some version of assistant or helper or guide)",
        "ts": "1492640941.451640"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "y'll, yes - start riffing on names. i know we discussed next steps but i just met with ara to debrief on them a bit and rest assured i'm distilling them into simple bullets.  will send via email once out of meetings",
        "ts": "1492642362.771742"
    },
    {
        "type": "message",
        "user": "U2670DYLE",
        "text": "Mary? Maybe the name conjures a combination of the Virgin Mary, Mary Tyler Moore, and Mary Poppins?",
        "edited": {
            "user": "U2670DYLE",
            "ts": "1492643345.000000"
        },
        "ts": "1492642408.781599"
    },
    {
        "type": "message",
        "user": "U2670DYLE",
        "text": "Also, we could potentially give provide a unique assistant name for each <http:\/\/care.com|care.com> customer. In the movie her, each \"OS\" gets a unique name per owner.",
        "ts": "1492643031.917549",
        "reactions": [
            {
                "name": "partyparrotrev",
                "users": [
                    "U4VTSDW7P"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!here|@here> GREAT NEWS - I just got off client call and they're on same page as us.  Differences in the priority order than I thought but they're asking for the things we know we want to do next.\n\nWatch for email from me. \n\n<@U026103R3> ET knows I'm out but if you could monitor her forthcoming email with expectations and priorities against the ones we  internally set out to do, just to watch for a difference or emergent chasm, it would help. <@U0HP6TFNX> and <@U0GN0A9EV> as well ET and I are checking in when I'm back on Monday to specificaly frame up Tuesday",
        "ts": "1492645620.419855"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": ":tada::+1:",
        "ts": "1492645674.429374"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!here|@here> team, i got a call set up for tomorrow for Care team to tell us about Twilio integration as they like one of our ideas as a companion feature for it. I'm not gonna be there but I'll expound upon this in my [long] email and meeting invite has the deets. the INT invite is for the room. ET's invite has the link for go to meeting",
        "ts": "1492648029.831805"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "also in email but ehen it comes to client communication, I'm inclined to loop the team in on a parallel thread that client is providing their notes (they haven't yet sent). I think this will help as we need to ensure our plans and their expectations remain tight. Abby and the PP team can look for difs or drift but I want everyone to have access to the info. And if you need to reach out to client, ping Abby but feel like you can. We don't need to run everything through me (whilst out)",
        "edited": {
            "user": "U0ML49XU0",
            "ts": "1492649219.000000"
        },
        "ts": "1492648956.976045"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "added everyone to client thread even though looks like we're aligned :slightly_smiling_face: just to make sure",
        "ts": "1492651528.361412"
    },
    {
        "type": "message",
        "user": "U4VTSDW7P",
        "text": "ezra is awesome. its gender neutral. paige is excellent too. thanks <@U026103R3>",
        "ts": "1492654564.791636"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "No prob! ",
        "ts": "1492654626.799730"
    },
    {
        "type": "message",
        "user": "U4VTSDW7P",
        "text": "poppins makes some sense. she helps everyone. both the parents and the children. likewise, Assistant will help everyone--both the families and the caregivers.",
        "ts": "1492654630.800181"
    },
    {
        "type": "message",
        "user": "U0DCXC37U",
        "text": "Add me to invite <@U0ML49XU0> if you think necessary",
        "ts": "1492655508.915985"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U0DCXC37U> I didn't add ya as I'm asking the team to self organize and jump on call based on invite details. More important to include you on int reviews next week. ",
        "ts": "1492657070.117784"
    },
    {
        "type": "message",
        "user": "U0DCXC37U",
        "text": "K",
        "ts": "1492657116.123695"
    }
]