[
    {
        "type": "message",
        "user": "U0DCXC37U",
        "text": ":ok_hand::skin-tone-2:",
        "ts": "1493220936.895416"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!here|@here> confirmed with client:\n1. Intercession is the interaction model they want to proceed with\n2. Even still, we need to nail how she introduces herself to folks\n3. Ay-duh is the name but we are still in warm territory - let's get them to love it but solidifying name and pronunciation (I'll balance against TM realities)",
        "edited": {
            "user": "U0ML49XU0",
            "ts": "1493223871.000000"
        },
        "ts": "1493223861.238717"
    },
    {
        "type": "message",
        "user": "U0XJFPSRL",
        "text": "Printer is out of commission currently :grimacing:",
        "ts": "1493229653.743444"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "ahhhh",
        "ts": "1493229660.746451"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U0XJFPSRL> did you feed it money? thats how it works",
        "ts": "1493229668.750359"
    },
    {
        "type": "message",
        "user": "U0XJFPSRL",
        "text": "Yea I chucked a few pennies at it but no dice",
        "ts": "1493229687.759191"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "ah, it feeds on crisp $50's",
        "ts": "1493229723.775365"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "just give em to me, i'll fix",
        "ts": "1493229728.777809",
        "reactions": [
            {
                "name": "laughing",
                "users": [
                    "U1S5GKTHQ"
                ],
                "count": 1
            },
            {
                "name": "money_mouth_face",
                "users": [
                    "U0XJFPSRL"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "all kidding aside. <!here|@here> <@U0XJFPSRL> <@U0XCJ372R> and <@U4VTSDW7P> are working to map out the journey today and propose a scope for how far we define implementation for Assistant by this afternoon. ya'll still into that?\n\nIn parallel, <@U1S5GKTHQ> and I are talking to tech team RE documentation and will circle back\n\nI'm also following up with <http:\/\/Care.com|Care.com> team RE Ada spelling of name",
        "ts": "1493230268.018580"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!here|@here> Ivan wants a quick regroup at 11:30, we'll keep it in 10 min. Please come to Library at 11:30",
        "ts": "1493230864.275647"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!here|@here> dimitry and i are sync'd. he and I are talking to tech team in 1 hour: \nwalk them through those 4 slides, socialize them on the idea that we're trying to map out from introduction to TBD point (our scope) and that we want to provide decision tree or requirements doc that covers that area.\n\nask them for:\n- the format\n- how they want to be involved moving forward\n- level of fidelity\n\ntell them we'll circle back once team feels good about the plan",
        "ts": "1493232923.188643"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U0XCJ372R> i sent your questions\/requests over around 11 this am. expect to hear back by tomorrow AM",
        "ts": "1493232942.197351",
        "reactions": [
            {
                "name": "thanks",
                "users": [
                    "U0XCJ372R"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U4VTSDW7P",
        "text": "fyi ada lovelace: <https:\/\/en.wikipedia.org\/wiki\/Ada_Lovelace>",
        "attachments": [
            {
                "image_url": "https:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/cc\/8bit-dynamiclist_%28reversed%29.gif",
                "image_width": 32,
                "image_height": 32,
                "image_bytes": 1243,
                "title": "Ada Lovelace",
                "title_link": "https:\/\/en.wikipedia.org\/wiki\/Ada_Lovelace",
                "author_name": "Wikipedia",
                "author_link": "http:\/\/en.wikipedia.org\/",
                "text": "Augusta Ada King-Noel, Countess of Lovelace (née Byron; 10 December 1815 – 27 November 1852) was an English mathematician and writer, chiefly known for her work on Charles Babbage's proposed mechanical general-purpose computer, the Analytical Engine. She was the first to recognise that the machine had applications beyond pure calculation, and created the first algorithm intended to be carried out by such a machine. As a result, she is often regarded as the first to recognise the full potential of a \"computing machine\" and the first computer programmer.\nAda Lovelace was the only legitimate child of the poet George, Lord Byron, and his wife Anne Isabella Milbanke (\"Annabella\"), Lady Wentworth. All Byron's other children were born out of wedlock to other women. Byron separated from his wife a month after Ada was born and left England forever four months later, eventually dying of disease in the Greek War of Independence when Ada was eight years old. Her mother remained bitter towards Lord Byron and promoted Ada's interest in mathematics and logic in an effort to prevent her from developing what she saw as the insanity seen in her father, but Ada remained interested in him despite this (and was, upon her eventual death, buried next to him at her request). Often ill, she spent most of her childhood sick. Ada married William King in 1835. King was made Earl of Lovelace in 1838, and she became Countess of Lovelace.\nHer educational and social exploits brought her into contact with scientists such as Andrew Crosse, Sir David Brewster, Charles Wheatstone, Michael Faraday and the author Charles Dickens, which she used to further her education. Ada described her approach as \"poetical science\" and herself as an \"Analyst (&amp; Metaphysician)\".\nWhen she was a teenager, her mathematical talents led her to a long working relationship and friendship with fellow British mathematician Charles Babbage, also known as \"the father of computers\", and in particular, Babbage's work on the Analytical Engine. Lovelace first met him in June 1833, through their mutual friend, and her private tutor, Mary Somerville. Between 1842 and 1843, Ada translated an article by Italian military engineer Luigi Menabrea on the engine, which she supplemented with an elaborate set of notes, simply called Notes. These notes contain what many consider to be the first computer program—that is, an algorithm designed to be carried out by a machine. Lovelace's notes are important in the early history of computers. She also developed a vision of the capability of computers to go beyond mere calculating or number-crunching, while many others, including Babbage himself, focused only on those capabilities. Her mindset of \"poetical science\" led her to ask questions about the Analytical Engine (as shown in her notes) examining how individuals and society relate to technology as a collaborative tool.\nShe died of uterine cancer in 1852 at the age of 36.",
                "fallback": "wikipedia: Ada Lovelace",
                "service_icon": "https:\/\/a.slack-edge.com\/bfaba\/img\/unfurl_icons\/wikipedia.png",
                "id": 1
            }
        ],
        "ts": "1493238159.344070"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "my niece is named after her :sunglasses:",
        "ts": "1493238337.416177"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": ":slightly_smiling_face:",
        "ts": "1493239031.698878"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!here|@here> great call with TEch Team just now. thanks to <@U1S5GKTHQ> walking them through some slides from yesterday. More to come but TL;DR\n\n- they understand we're mapping out user jouney and drawing our \"line in the sand\" up to which point we can nail every interaction moment\n- they want to review this on friday, with a member of their analytics team who can help us understanding keyword analysis from their POV. Treat as working session with Jackson\n- for requirements writing, annotations in the form of google docs, ready for review by mid next week and then work for half a week with jackson and krstin to refine",
        "ts": "1493239148.745579"
    },
    {
        "type": "message",
        "user": "U1S5GKTHQ",
        "text": "Jackson:\n&gt; Anyway, was sorta imagining that each prompt is its own little view\/app, and we have a few kernels of functionality that each prompt\/app can have – accept input, insert messages into the message editor line, send push notifications, display differently to each party, etc... maybe that’s overcomplicating things, but it seems a reasonable way to keep things flexible.",
        "ts": "1493239245.784976"
    },
    {
        "type": "message",
        "user": "U1S5GKTHQ",
        "text": "I think that’s a good way of focusing on the scenarios and pretty much what we’ve been doing (thinking of them separately)",
        "ts": "1493239271.795205"
    },
    {
        "type": "message",
        "user": "U1S5GKTHQ",
        "text": "(for documentation purposes)",
        "ts": "1493239334.820345"
    }
]