[
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!here|@here> reminder that the design team is in an all day user journey session. I'm hanging with Dimitry ANd trying to catch up with Cara at some point today",
        "ts": "1491928051.076282"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!channel> \t\n\nhope all is going well with the work session today. looking forward to de-briefing later.\na few updates:\n- Client is still pulling together Messages, Analytics and a roadmap for CS and CG actions. Hoping to get that stuff today.\n- Dimitri and I are getting ready to jump on a call with the Care tech team. We’ll share out our notes early afternoon\n- Cara is going to pull together a one page brief today or tomorrow, to kind of narrow our focus and parrot back a lot of what we’re discussing\n- We too have set up a Trello board.  <https:\/\/trello.com\/b\/pEpTrLWO> *Please get your eyeballs on our newly created and fleshed out trello board today.* (Internal only) From now on, we'll be using this to track our work and tasks. I've added the work items I know of and we've discussed, as well as all the key dates to be aware of.\n- I’m asking everyone to review the revised schedule AND deliverable RACI (<@U0GN0A9EV> and <@U0HP6TFNX> only) \n- Reminder that our next client deliverable is Thursday's call with client and working towards next Wednesday's  Client Review: Quantifiable Goals and Scenarios",
        "ts": "1491933174.199313",
        "reactions": [
            {
                "name": "carlton",
                "users": [
                    "U4VTSDW7P"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U4VTSDW7P",
        "text": "hey, everyone. can you shoot user research my way? i didn't see any (aside from the journey doc) in google docs. if we don't have any, <@U0ML49XU0> can we request user insights from their strategy group? thanks!",
        "ts": "1491933804.472001"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "interesting insight from this call: \"Basic seeker\" (not yet a paying member) Care team has have biz logic to prevent this user from being able to exchange a phone number in messages",
        "ts": "1491935376.122048"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U1S5GKTHQ> great call!  would you mind cleaning up notes and tacking on any more action items you have?  I will be away from computer for next hour and will send client follow up as soon as I'm back. Once you've cleaned notes, share the doc with everyone here.\n\nTeam, heads up we're gong to do a standing 30 min call with tech team each week. they are very engaged :slightly_smiling_face:",
        "ts": "1491937125.852203"
    },
    {
        "type": "message",
        "user": "U1S5GKTHQ",
        "text": "Yup I have a lot. Will clean up, copy it over into the doc shortly.",
        "ts": "1491937215.891665"
    },
    {
        "type": "message",
        "user": "U1S5GKTHQ",
        "text": "Very helpful stuff",
        "ts": "1491937219.893498",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U4VTSDW7P"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U0HP6TFNX> <@U0XJFPSRL> <@U0GN0A9EV> we can do a call with Cerri (CRM) tomorrow at 2pm PST to talk about goals of email outreach vs Assistant, y'all still want to do that? I think it's valuabke. I'd look to Megan or Elise to lead",
        "ts": "1491937846.142755"
    },
    {
        "type": "message",
        "user": "U4VTSDW7P",
        "text": "super good piece in the guardian about chatbots, user experience and expectation, opportunity and pitfalls: <https:\/\/www.theguardian.com\/technology\/2016\/sep\/18\/chatbots-talk-town-interact-humans-technology-silicon-valley>",
        "attachments": [
            {
                "service_name": "the Guardian",
                "title": "Why Facebook and Microsoft say chatbots are the talk of the town",
                "title_link": "https:\/\/www.theguardian.com\/technology\/2016\/sep\/18\/chatbots-talk-town-interact-humans-technology-silicon-valley",
                "text": "Software programmed to interact with humans is hot property in Silicon Valley, with potential benefits for businesses, consumers – even the bereaved",
                "fallback": "the Guardian: Why Facebook and Microsoft say chatbots are the talk of the town",
                "image_url": "https:\/\/i.guim.co.uk\/img\/media\/538477239638658fc342b71699ea880d10f3e8c7\/40_0_1200_720\/1200.jpg?w=1200&h=630&q=55&auto=format&usm=12&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&s=69c63cebb2920fd72b1cc723ff5e47b7",
                "ts": 1474194389,
                "from_url": "https:\/\/www.theguardian.com\/technology\/2016\/sep\/18\/chatbots-talk-town-interact-humans-technology-silicon-valley",
                "image_width": 476,
                "image_height": 250,
                "image_bytes": 143011,
                "service_icon": "https:\/\/assets.guim.co.uk\/images\/favicons\/451963ac2e23633472bf48e2856d3f04\/152x152.png",
                "id": 1
            }
        ],
        "thread_ts": "1491938425.357064",
        "reply_count": 1,
        "replies": [
            {
                "user": "U0ML49XU0",
                "ts": "1491940643.198650"
            }
        ],
        "unread_count": 1,
        "ts": "1491938425.357064"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "<@U0ML49XU0> tomorrow's call with Cerri sounds good ",
        "ts": "1491939154.630916",
        "reactions": [
            {
                "name": "+1::skin-tone-4",
                "users": [
                    "U0XJFPSRL",
                    "U0ML49XU0",
                    "U0GN0A9EV"
                ],
                "count": 3
            }
        ]
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "good share - i added to our reading list as well",
        "thread_ts": "1491938425.357064",
        "parent_user_id": "U4VTSDW7P",
        "ts": "1491940643.198650"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!channel> heads up that we now have a singluar, combined Care Stand up each morning at 9:30. <@U4VTSDW7P> i included you, let me know if you don't see the invite",
        "ts": "1491953172.879334"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "also <@U1S5GKTHQ> the tech calls got booked for 12pm PST each week - work for you?",
        "ts": "1491953469.937114"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U0XJFPSRL> and <@U0HP6TFNX> we likely won't have chat logs first thing in am due to late breaking privacy concerns. Was looking like we would have them but they just got held up. For tomorrow, we can continue drawing connections based on sessions conducted and the logs (Adrian's) we have access to thus far. ",
        "ts": "1491957023.557681"
    },
    {
        "type": "message",
        "user": "U0HP6TFNX",
        "text": "Ok thanks for the heads up. Are we resetting any milestone expectations accordingly? Let me know if we need to retool our plan ",
        "ts": "1491957885.688275"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U0HP6TFNX> that's a fair question but honestly, I don't think we should retool the plan (but let's talk in stand up and in our schedule review!) rather, I think we work with what we have, treat Thursday as a question\/assumption validation session and push on these needs at that time. I think we can still get to next Thursday's goal articulation and scenario outline deliverable ",
        "ts": "1491960475.073036"
    }
]