[
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "<@U0GN0A9EV> any thoughts post call?",
        "ts": "1499791709.159129"
    },
    {
        "type": "message",
        "user": "U0GN0A9EV",
        "text": "I agree with ewald mostly. In the short term they're asking us to make deliverables for their board to get funding. That doesn't feel risky so long as their open to pivoting away from autism eventually. I think the robot is super cool and should just be a consumer product. Could they consider us for the ID partner on it. It sits in the center of a lot of our interests, robotics, AI, machine learning, data.",
        "ts": "1499795339.164877"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "left Kris a VM - want to see what I could do to find out if Paolo's POV left room to suggest a different $ figure for the work that we do, or if it was 20-25k or the highway. also asking for clarification over whether output is for the deck only or if it is for usability\/adopting testing. blackops approved putting together a proposal for some kind of the design engagement. i believe <@U0DCXC37U> has the ball, but thoughts on the time we need to build the comps requested could be useful in advance of being asked.",
        "ts": "1499810400.785323"
    },
    {
        "user": "U0DCXC37U",
        "inviter": "U02918BKW",
        "text": "<@U0DCXC37U|avery> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1499810420.793280"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "ha just got a text from her",
        "ts": "1499810428.796797"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "need a prototype for testing not a vc deck. phase 1 20-25, phase 2 ?, phase 3 ?",
        "ts": "1499810457.808106"
    },
    {
        "type": "message",
        "user": "U0DCXC37U",
        "text": "the prototypes coming out of semio summits though are not at testing fidelity",
        "ts": "1499810911.967680"
    },
    {
        "type": "message",
        "user": "U0DCXC37U",
        "text": "so not sure what can be done for 20K in that world",
        "ts": "1499810923.971357"
    },
    {
        "type": "message",
        "user": "U0DCXC37U",
        "text": "ill meet with Ivan and charles",
        "ts": "1499810953.981816"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "i think we should cost an envision bundle of comps",
        "ts": "1499811267.084492"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "and cost a non-envision bundle of comps",
        "ts": "1499811275.086983"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "and see what we can offer. because prototype is a loaded term.",
        "ts": "1499811287.090842"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "and i dont think there's a summit in there",
        "ts": "1499811298.094423"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "So - here's the rub. \n\nThey need significant help on many fronts — content, interaction between robot and app, parent\/child interaction, AND the charts and graphs — to understand what works\/what doesn't for actual prototype testing. \n\nWe could indeed cobble together a \"looks like\" design (their words), but don't know what we're 'testing' in this frame. Aesthetics? Usability? Role of app in ecosystem? Branding?  \n\nI know it's likely all of it, though I admit I'm struggling to understand who on their side to listen to. Even based on the interplay between people on that call, I suspect Paolo's explicit ask for design and Kris's reassurance that no no this IS for testing highlights the delta of expectation on their side. \n\nLong\/short version — If they want comps to have a sub in for the fact that someday there'll be data for parents to look through, we can make graphs and charts for people to click at. If they want that to be testing their actual product, I see a far different path. \n\nIn ALL cases, I think we propose back to them some sort of recommendation based on need vs. budget. If it'll take 35k to get them to a 2 design team exploration followed by a clickable InVision prototype (totally making up these teams) — so be it. I just want to know who we're listening to at what success means even from a small engagement.",
        "ts": "1499812470.457421"
    }
]