[
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "speaking of unresolved discussions ... we could catch their attention if we came back and said \"hey, we're still totally willing to do a data prototype engagement as a first thing, but if you really want someone to handle the product over time then there's only one way to do that, and that's through Collect\/Semio... here's a roadmap for that.\" as opposed to sitting on the shelf existing in a not comparable state to other proposals.",
        "ts": "1500675668.553994"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Something in that neighborhood is where my head is at.",
        "ts": "1500676151.667394"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "IMHO the issue is one, or some blend of the following: \nEither they have some roadmap\/focused plan in place that other firms can actually bid on the whole thing OR they may be reacting to uninformed bids (sure we can do that for 100k!) OR they may have firms return with something like we're saying.",
        "ts": "1500676276.697228"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "If we're being held up to 100k uninformed proposals, I don't see us winning that race.",
        "ts": "1500676307.704576"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "At this point, all I can do is offer my recommendations both to this channel and to them as a company. Based on what I know, and highly dependent on what exactly they're asking to have done (10 mock ups vs. full ecosystem design with that robot ID that fits so well) I'd say (not in these exact words): \n\nThere's many ways to accomplish the wide array of goals startups like yours have. You need to prove a business model, audience need, broader audience need (scale), technological feasibility, brand voice\/tone, etc. You also need to weave all of them together into an umbrella called Embodied. \n\nThere's a million firms who might specialize in ID, or app screens, or even testable prototypes. \n\nAnd there are firms like Uncorked who might look more broadly at the ecosystem. \n\nWhen we first talked, we heard the most immediate goal was prototype that infused quite a bit of the brand voice and existing robot into the design. From our last conversation, however, it seemed you were asking for something more comprehensive in nature. \n\nSo while some eventual outputs of our work could indeed be very focused deliverables around the app — there's also connective work to be done between audience(s), digital touchpoints, non-digital environments, and the robot. Based on what we know now, we don't know enough to outline with certainty what all we'd do to connect each piece of the puzzle. \n\nWith an eye toward ecosystem, we'd recommend starting with a stand alone engagement that could move the needle on all the threads and set up ways to work on individual threads once we establish a common foundation…",
        "ts": "1500676938.845406"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "i wonder if there's a way to switch voices from me to you (or whoever)",
        "ts": "1500677008.860264"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "b\/c i feel like i (over)invested in the existing proposal",
        "ts": "1500677022.863144"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "I don't see that as a strange response. Obviously wordsmith and adapt to the context, but I think it's perfectly fair to say we don't know what we don't know. And if you want us to be doing ecosystem work, we need to do our process",
        "ts": "1500677022.863263"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Hmm - i'm happy to take it",
        "ts": "1500677037.866520"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "though I'd want to know more about the phonecall portions of this process",
        "ts": "1500677050.869077"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "where we overinvested",
        "ts": "1500677057.870586"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "right",
        "ts": "1500677058.870834"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "haha",
        "ts": "1500677061.871541"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "but yeah - i'm happy to take it on",
        "ts": "1500677071.873464"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "i'm not making any promises",
        "ts": "1500677074.874202"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "but all i hear in everythign i've seen from them is misalignment in some form. If they want help making a system — we can do that",
        "ts": "1500677115.882860"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "That's not initially what they asked for",
        "ts": "1500677121.884259"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "lessee. so they asked us to walk through it, which i did with limited questions or interruptions. then they expressed interest in (or maybe even mildly disappointed expectations that we hadn't provided) a bigger sized plan to build the app.",
        "ts": "1500677153.891455"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "But from my read of it (though still want that phone debrief) - It's pretty easy response",
        "ts": "1500677159.892617"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "reading into it, we may have even set them on the path of thinking bigger than the first engagement with the way we talked to them along the way.",
        "ts": "1500677174.895809"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "and somehow the feedback they gave to keep it focused wasn't tempered",
        "ts": "1500677188.898797"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Yeah - i mean - i'm happy to take ball if it changes the dynamic",
        "ts": "1500677220.905544"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "they can blame a fancy designer",
        "ts": "1500677227.907010"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "but I don't think we need to apologize for continually working to adapt our response to the best understanding of their need",
        "ts": "1500677258.913486"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "i clarified that we thought we had to cross the first bridge first based on their guidance, and that the app scope had some wide undefined dimensions - like which platforms it would work on.",
        "ts": "1500677265.914813"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "i cant remember the framing but they were confused why we couldn't bid \"it\" more easily and i pointed to rich interdependencies such as the hardware integration, and system APIs, particularly if those were undeveloped, and whether our client development scope also functioned as hardware and API testing work.",
        "ts": "1500677337.929956"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "as well as actionable feedback from usability testing",
        "ts": "1500677354.933679"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "so there was nodding around the room at that",
        "ts": "1500677362.935372"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "\"that makes sense\"",
        "ts": "1500677371.937171"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "\"we understand what you're saying\"",
        "ts": "1500677375.938100"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "didnt exactly leave me feeling like they were content tho",
        "ts": "1500677382.939572"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "yeah that's fine",
        "ts": "1500677388.940856"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "it's a case where they don't know it, but they're lofting process and assuming a shared understanding.",
        "ts": "1500677423.948617"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "That's precisely what any form of kickoff is meant to do. Call it semio. Call it discovery. Call it a kickoff — it's all about (most of the time secretly!) shaping how things should go.",
        "ts": "1500677466.957952"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "So even in their, or any client's, misalignment — say for instance between a robot dude and a human centered researcher who just wants to research — they're walking on _our_ path. It's a different one than they thought they were on, but lovely nonetheless. \n\nAnd, if they didn't need us, they'd have built \"it\" by now on their own.",
        "ts": "1500677561.977893"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "they can live without us but it will be a bailing wire and duct tape life.",
        "ts": "1500677654.997457"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "what do you think about me forwarding the last thread and you use that framing as a basis for a check in note? or would you rather we cost some plan first?",
        "ts": "1500677682.003464"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "my last was more asking if there was anything else we could do.",
        "ts": "1500677697.006535"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "I'll take it as basis",
        "ts": "1500677763.020252"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "cool. Got it",
        "ts": "1500677950.058123"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "only other point - they have asked a couple of times for a ID portfolio",
        "ts": "1500678034.076988"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "the first ask was when we were also being told to focus on the short term and not to worry about the long",
        "ts": "1500678054.081429"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "and the second ask was right after felix left",
        "ts": "1500678060.082564"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "gotcha",
        "ts": "1500678079.086889"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "i can work on that",
        "ts": "1500678092.089520"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "i deflected but it would obviously be interesting for them to look at, so could be a way to throw in an attractor",
        "ts": "1500678108.092971"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "probably less about Uncorked, more about some work we've done internal AND the history that felix has leading ID",
        "ts": "1500678131.097916"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "i might be crossing conversations up with NEC but prety sure they liked the sommely cap sketches particularly",
        "ts": "1500678134.098512"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "which felix has generated similar stuff even for us",
        "ts": "1500678153.102462"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "yep. I'm on it",
        "ts": "1500678171.106264"
    }
]