[
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Side note to the newbiz thing that might help us either push Embodied forward or take them out of running. \n\nTo John's (and I think everybody's point): The FULL scope of what they're even asking for is so ill defined, much less how each piece of the puzzle relates to the other (e.g. how might the ID of the robot relate to the interaction design, much less aesthetics, of the app — and vice versa). \n\nI wonder if we both demonstrate our ability to guide clients and our recommended approach for the success of something by scoping a different initial phase of work. Less about individual app screens for testing, more about helping put some principles and guidelines in place that will help drive any other piece of the ecosystem and our work.  \n\nI recognize they still have the issue of needing screens for testing\/the deck, but if they're asking firms to scope some full thing, ill-defined as it is, we're talking apples to their oranges. \n\nPoint being, rather than wait on them to get back to us to say they've had 5 other firms bid on the whole thing while we're still on the small potatoes thing we outlined — let's push this to some place that stays true to our approach AND gets them down a path that they're currently not explicitly asking for.",
        "ts": "1500587560.328666"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "honestly i dont know how to talk to them about it any more",
        "ts": "1500587856.440814"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "is this a place where a semio summit might make sense, even if we frame it as “this might help you evaluate other proposals in addition to ours?”",
        "ts": "1500587974.484590"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "we started there",
        "ts": "1500587993.491736"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "is it worth revisiting that?",
        "ts": "1500588009.498233"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "is there a concession we can offer, something that gets them in front of our team?",
        "ts": "1500588025.505044"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "or can we fly down to meet them and line it up with other biz meetings?",
        "ts": "1500588043.512436"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "im at a loss",
        "ts": "1500588082.527442"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "we've had a few team calls, some video some audio",
        "ts": "1500588107.536424"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "i've had another few individual calls",
        "ts": "1500588109.537339"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "they've gotten facetime with us and have seen some of the breadth. paolo is intrigued by us. their budget for 2017 isn't a good match for a sustained product partnership team and building an app, but for 2018 they're looking for 50M.",
        "ts": "1500588163.556722"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "the ID portion is intriguing of course",
        "ts": "1500588181.563317"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "for their decision making, they'll want to see X scope for Y dollars. if they are interested in trying something with us, our proposal for 40k and a testable app isn't a bad start.",
        "ts": "1500588250.587653"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "(envision app w\/ 10 screens, not a real app)",
        "ts": "1500588269.594496"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "I think the thing I'm thinking about is that we will for sure not be doing the project because we've not bid on the full project. And we have challenges bidding on the full because it's so big and so ill defined. \n\nWhat we CAN say is that we'd recommend doing some sort of process that could help them bring shape to the ecosystem. That could be semio. That could be 'collect'. It could be something else. \n\nWe may still lose it, but it's an honest assessment of why they should be intrigued by us — We know how to do these sorts of things. That's why they need us, and we'd recommend doing ___________ to accomplish what we currently know, including knowing that nobody knows everything.",
        "ts": "1500588456.659037"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "We may lose it, but at least its on our terms",
        "ts": "1500588500.673451"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "yeah i have the same impression about full project vs not",
        "ts": "1500589843.090533"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "its a strange sell at this point. that's what i can't wrap my head around.",
        "ts": "1500589885.103556"
    }
]