[
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "<http:\/\/qz.com\/862412\/trumps-16-cabinet-level-picks-have-more-money-than-a-third-of-american-households-combined\/>",
        "attachments": [
            {
                "service_name": "Quartz",
                "service_url": "http:\/\/qz.com",
                "title": "Trump’s 17 cabinet-level picks have more money than a third of American households combined",
                "title_link": "http:\/\/qz.com\/862412\/trumps-16-cabinet-level-picks-have-more-money-than-a-third-of-american-households-combined\/",
                "author_name": "Dan Kopf",
                "author_link": "https:\/\/qz.com\/author\/dkopfqz\/",
                "thumb_url": "https:\/\/i0.wp.com\/qzprod.files.wordpress.com\/2016\/12\/trumprosspence.jpg?fit=200%2C150&quality=80&strip=all&ssl=1",
                "thumb_width": 200,
                "thumb_height": 113,
                "text": "The 17 people who US president-elect Donald Trump has selected for his cabinet or for posts with cabinet rank have well over $9.5 billion in combined wealth, with several positions still unfilled. This collection of wealth is greater than that of the 43 million least wealthy American households combined&mdash;over one third of the 126 million households total in the US.\nAffluence of this magnitude in a US presidential cabinet is unprecedented.\nThe household data on which we based our comparison is from the 2013 Survey of Consumer Finances. Collected by the Federal Reserve, this survey is the most recent comprehensive data source on American wealth. The estimates were adjusted for inflation and an increase in the number of American households. It is possible that the wealth of low-income Americans has changed since 2013, but trends over the last several decades suggest a large change is unlikely.\nIt is worth noting that almost 13% of American households have zero or negative wealth because of debt, so we are adding together these households with those that have at least some wealth.\nEven if we just compare the wealth of Trump&rsquo;s cabinet to the median household, it is still an impressive concentration of riches. It would take about 120,000 households with the the United States median net worth of about $83,200 to match the wealth of just the four richest members of Trump&rsquo;s cabinet&mdash;Betsy DeVos, Wilbur Ross Jr., Linda McMahon, and Rex Tillerson.",
                "fallback": "Quartz Link: Trump&#8217;s 17 cabinet-level picks have more money than a third of American households combined",
                "from_url": "http:\/\/qz.com\/862412\/trumps-16-cabinet-level-picks-have-more-money-than-a-third-of-american-households-combined\/",
                "service_icon": "https:\/\/app.qz.com\/img\/icons\/touch_144.png",
                "id": 1
            }
        ],
        "ts": "1481814966.000037"
    }
]