[
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<http:\/\/www.huffingtonpost.com\/roger-wolfson\/heres-what-has-to-happen_b_13420246.html>",
        "attachments": [
            {
                "service_name": "The Huffington Post",
                "title": "Here's What Has To Happen In The Next 14 Days | The Huffington Post",
                "title_link": "http:\/\/www.huffingtonpost.com\/roger-wolfson\/heres-what-has-to-happen_b_13420246.html",
                "text": "A lot of wishful thinking is happening in America right now. \"Maybe Trump the President will be different than Trump the Candidate.\" We already know th...",
                "fallback": "The Huffington Post: Here's What Has To Happen In The Next 14 Days | The Huffington Post",
                "image_url": "http:\/\/i.huffpost.com\/gen\/4864906\/images\/o-TRUMP-facebook.jpg",
                "ts": 1480899694,
                "from_url": "http:\/\/www.huffingtonpost.com\/roger-wolfson\/heres-what-has-to-happen_b_13420246.html",
                "image_width": 500,
                "image_height": 250,
                "image_bytes": 343501,
                "service_icon": "http:\/\/s.m.huffpost.com\/assets\/favicon-db51f692ca19533517299040c4ae3dd5.ico",
                "id": 1
            }
        ],
        "ts": "1481569855.000014"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "TL;DR: <http:\/\/www.asktheelectors.org\/> is the tool to use, but you must email from your own account",
        "attachments": [
            {
                "title": "Email the Electoral College",
                "title_link": "http:\/\/www.asktheelectors.org\/",
                "text": "AskTheElectors is a quick tool to email members of the Electoral College.",
                "fallback": "Email the Electoral College",
                "image_url": "http:\/\/asktheelectors.org\/static\/images\/share\/share8.jpg",
                "from_url": "http:\/\/www.asktheelectors.org\/",
                "image_width": 476,
                "image_height": 250,
                "image_bytes": 434537,
                "service_icon": "http:\/\/www.asktheelectors.org\/static\/images\/favicon.png",
                "service_name": "asktheelectors.org",
                "id": 1
            }
        ],
        "ts": "1481570147.000016",
        "reactions": [
            {
                "name": "white_check_mark",
                "users": [
                    "U051P3FPY"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U051P3FPY",
        "text": "The auto-reply from the texas electoral college people made me so sad :disappointed:",
        "ts": "1481587414.000018"
    },
    {
        "user": "U0MKH0BE0",
        "text": "<@U0MKH0BE0|melodee> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1481589465.000019"
    },
    {
        "type": "message",
        "user": "U051P3FPY",
        "text": "\"DISCLOSURE:  By responding to this email  you are waiving your right to any privacy or remedy.  By responding to this email, for the consideration of me reading your email, you are giving consent for me to publish, disseminate, or otherwise distribute any information contained for any purposes I deem appropriate.  If you do not consent to this condition, then do not reply.\n\nThank you for writing.\n\nI am receiving about 4,000 emails a day so I have set this to an auto-response.\n\nYou should know that I have no interest in Hillary Clinton becoming our next President.  I reject the Democratic Party principles and I reject Hillary Clinton.\n\nI will not do anything that will open a path for HRC to become our next President.\n\nThere is no such thing as a national popular vote.  The only vote that matters to me as a Texas Elector is the Texas vote.\n\nWe are not a democracy, we are a republic, for good cause.\n\nWe all have differing opinions and I respect your part in the political process, but frankly, since I am a Texas elector, the political opinions of non-Texas voters means nothing to me.  I do not vote or get involved in your state, I am not sure why you are trying to interfere in mine.   As an American citizen, your voice should be able to be heard by all, so I have this email address available, but I owe no duty to any non-Texan.\n\nI encourage you to be active in the political process where your vote matters.\n\nFinally, I will not vote for a 3rd candidate.  A 3rd candidate only opens the door for HRC to enter the White House through the House of Representatives.  I will do nothing to enable HRC to become President of the United States, no matter how remote the chances are.\n\nBest Regards,\n\nAlex\n\nElector, Texas Congressional District 24\"",
        "ts": "1481590230.000021"
    }
]