[
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "<!channel>: Good morning, friends. Happy after-holiday. I took today's morning stand up off the calendar. If you are in the office please check out the current build and post any notes to Trello. <@U02F8TTPU>, let us know what we can do to help you keep moving!",
        "ts": "1419613715.000002"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "I'm good! I finished the fixed header and all the index demos on Wed, so I'll just keep moving things in Trello as I get them done.",
        "ts": "1419617059.000003"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "Nice! Is the index based on the later version that David B sent?",
        "ts": "1419617691.000004"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "It contains everything in the 12\/23 document (Tick, Pop, Fill, Short Buzz, Long Buzz, Hum)",
        "ts": "1419617738.000005"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "Excellent. Thank you thank you. Holler with anything you need.",
        "ts": "1419617841.000006"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "(Text message will be the fastest way to get me today)",
        "ts": "1419617865.000007"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "ok!",
        "ts": "1419617875.000008"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "<@U02F8TTPU>: do the open issues in gitlab include the feedback we have in trello? Or is that just where Abe's QA issues are consolidated?",
        "ts": "1419628908.000009"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "I haven't checked the gitlab issues yet, but if they correspond to trello, I'll just mark them resolved as I resolve them (after pushing the build with the fixes)",
        "ts": "1419629018.000010"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "Cool. Do your thing. On Monday we can do a status together, to make sure we feel good about getting through all open items.",
        "ts": "1419629584.000011"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "keep on cruisin'!",
        "ts": "1419629605.000012"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "The gitlab issues don't exactly correspond to our trello issues... there are more issues that are specific to Abe's haptics stuff, but there are some that overlap. And other UI issues that are new to me, such as how countdown timers should behave, but I've done most of them today. Almost ready to merge a new build and close out all the applicable issues.",
        "ts": "1419638772.000013"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "I sent out the build and closed most of the gitlab issues. Only the trickiest issues and decorating animations are left in trello\/gitlab.",
        "ts": "1419642714.000014"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "Well done! Thank you. Have an awesome weekend. ",
        "ts": "1419642793.000015"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "awesome!",
        "ts": "1419642813.000016"
    }
]