[
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Hey <@U02613K0X>, here's the etching sprite sheet:",
        "ts": "1422559835.000002"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Took me about 20ish minutes, but I should get faster with future ones. Especially since most will be the exact same dimensions.",
        "ts": "1422559915.000004"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "<@U030TQFR3>, I wanted to ask about the frequency of rain on the icon animation, do you think we could show them what we already have and then get their feedback off that? I'm hoping to get \"a little faster\" or \"way faster\" or something like that so I don't have to be stabbing in the dark so much. How do you feel about that?",
        "ts": "1422560088.000005"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "<@U026E0ZNR>: I'm good with that.",
        "ts": "1422560353.000006"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Cool, thanks!",
        "ts": "1422560384.000007"
    },
    {
        "type": "message",
        "user": "U02613K0X",
        "text": "thanks trent! putting it in there now..",
        "ts": "1422561217.000008"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Great <@U02613K0X>! So I'm discovering a potential problem with the watch faces as sprite sheets.... my first shot at the weather one exported at a solid 78 MB. I'm running it through an image optimization program to try trimming that down a bit, but wanted to get your feedback on how that makes you feel?",
        "ts": "1422561972.000009"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Sounding off for the day: we've got sprite sheets for 2 watch faces, 1 etching, and 20 stickers, all up on the NAS. Stickers got weird, most were built at 12.5 fps, but a handful were not that. So I labeled each file with the appropriate frame rate at the end (e.g. _object_clap_sprite_8-333.png_ means 8.333 fps). I'm sure these can be rounded to the nearest whole number and everything will look just fine. <@U02613K0X> let me know if you need any more deets from me on this stuff.",
        "ts": "1422583508.000010"
    }
]