[
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Alright, update on the soccer stickers with black backgrounds. The artist definitely did not intend for this. There are two stickers with a goalie net drawn in black that completely disappears when put on a black background. The other 4 don't lose important details but in my opinion look pretty lame with all the white matting\/outlining around characters. I would strongly recommend against changing it from the white background that we already have it on. If Dave B. still wants this, we should request that their artist redraws\/edits these files as I'm not comfortable trying to make this many changes for them.",
        "edited": {
            "user": "U026E0ZNR",
            "ts": "1423513810.000000"
        },
        "ts": "1423513777.000002"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "<@U030TQFR3>, <@U0265G76F>, how should I approach stickers knowing this? Should I make a gif in black to show as an example to Immersion or just tell them we advise against it?",
        "edited": {
            "user": "U026E0ZNR",
            "ts": "1423517740.000000"
        },
        "ts": "1423517734.000005"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "oof - yeah that sounds like a mess, but think i understand the situation",
        "ts": "1423517821.000007"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "Let's make a couple examples of the bad look. Then we'll draft up a note with our recommended direction (keep on white) and attach the examples.",
        "ts": "1423517842.000008"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "i guess my thought would be to go back with something like — We can change what we can, but some (see soccer example) might require artist to redo",
        "ts": "1423517846.000009"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "With the time we have left (less than a week), I'd rather suggest we keep things on white. If that's not acceptable to them, then we'll open it up to their artists editing and redelivering for a black background.",
        "ts": "1423517926.000010"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "i'm fully in support of this thought",
        "ts": "1423517951.000011"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "*<@U030TQFR3>'s thought",
        "ts": "1423517969.000012"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Great. So Ben does that mean you still want me to cook up a quick reference gif with a black BG to show what we're talking about? Won't take me long.",
        "ts": "1423518062.000013"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "Yes, please. Let's do two reference GIFs -- one with the black net that disappears, and one of the others with all the white matting\/outlining.",
        "ts": "1423518116.000014"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Ok cool. I'll set that up now then. Tanks",
        "ts": "1423518162.000015"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Here's some gifs:\n\n<https:\/\/www.dropbox.com\/s\/bjrggjhodu46nnn\/Soccer-Seq-1.gif?dl=0>\n\n<https:\/\/www.dropbox.com\/s\/i137alnwuv1bipr\/Soccer-Seq-6.gif?dl=0>",
        "ts": "1423519144.000016"
    },
    {
        "type": "message",
        "user": "U026E0ZNR",
        "text": "Ben, would you like to tactfully craft the note to Immersion on this one?",
        "ts": "1423519240.000017"
    },
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "Yep, on it.",
        "ts": "1423519265.000018"
    }
]