[
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "<http:\/\/qz.com\/771727\/chinas-factories-in-shenzhen-can-copy-products-at-breakneck-speed-and-its-time-for-the-rest-of-the-world-to-get-over-it\/?utm_content=bufferb3b40&amp;utm_medium=social&amp;utm_source=twitter.com&amp;utm_campaign=buffer>",
        "attachments": [
            {
                "service_name": "Quartz",
                "service_url": "http:\/\/qz.com",
                "title": "Your brilliant Kickstarter idea could be on sale in China before you’ve even finished funding it",
                "title_link": "http:\/\/qz.com\/771727\/chinas-factories-in-shenzhen-can-copy-products-at-breakneck-speed-and-its-time-for-the-rest-of-the-world-to-get-over-it\/?utm_content=bufferb3b40&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer",
                "author_name": "Josh Horwitz",
                "author_link": "https:\/\/qz.com\/author\/jhorwitzqz\/",
                "thumb_url": "https:\/\/i1.wp.com\/qzprod.files.wordpress.com\/2016\/09\/shenzhen-copycats.jpg?fit=200%2C150&quality=80&strip=all&ssl=1",
                "thumb_width": 200,
                "thumb_height": 113,
                "text": "Shenzhen, China\nYekutiel Sherman couldn&rsquo;t believe his eyes.\nThe Israeli entrepreneur had spent one year designing the product that would make him rich&mdash;a smartphone case that unfolds into a selfie stick. He had drawn up prototypes, secured some minimal funds from his family, and launched a crowdfunding campaign. He even shot a professional promo video, showing a couple taking the perfect selfie in front of the Eiffel Tower.\n\n (Stikbox) (Stikbox)\nBut one week after his product hit Kickstarter in December 2015, Sherman was shocked to see it for sale on AliExpress&mdash;Alibaba&rsquo;s English-language wholesale site. Vendors across China were selling identical smartphone case selfie-sticks, using the same design Sherman came up with himself. Some of them were selling for as low as $10 a piece, well below Sherman&rsquo;s expected retail price of &pound;39 ($47.41). Amazingly, some of these vendors stole the name of Sherman&rsquo;s product&mdash;Stikbox: \nSherman had become a victim of China&rsquo;s lightning-fast copycats. Before he had even found a factory to make his new product, manufacturers in China had spied his idea online, and beaten him to the punch. When his Kickstarter backers caught on, they were furious. &ldquo;You are charging double the price for what the copycats are charging, yet I seriously doubt the final product will be any better than the copycats,&rdquo; one person commented.\nYears ago, experts in the hardware industry would have had more sympathy for Sherman. Now, no one does&mdash;not even Sherman himself. While discussions of intellectual property in China&rsquo;s manufacturing centers once focused on how brands and investors could protect their designs from China&rsquo;s rapacious copycats, things have changed. Startups and foreign manufacturers are embracing a new reality&mdash;someone in China is going to make a knockoff of your unique invention, almost immediately. All any company or entrepreneur can do is prepare for it.\nThe origins of copycat culture\nChina&rsquo;s knockoffs come in many different forms, and can affect businesses large and small.\nIn some cases, factories will make products that physically resemble ones made by prominent brands. Quality may vary&mdash;an Android phone with rounded edges and a stamped-on Apple logo will never come close to replicating the feel of an iPhone. But a counterfeit Gucci bag might easily pass for the real thing.\nSometimes, as was the case with Stikbox and the hoverboard, a factory or design team will spot a fledgling new product on the internet, figure out how it&rsquo;s made, and start churning out near-identical products. Other times, a Chinese partner factory will produce extra units of a product they agreed to make for another company, and sell the surplus items themselves online or to other vendors.\nJack Ma, founder of Alibaba, drew criticism when he told investors in June (paywall) that fake goods &ldquo;are of better quality and of better price than the real names&rdquo; and come from &ldquo;exactly the same factories&rdquo; as authentic goods. But there&rsquo;s some truth to his comments.&nbsp;Fake goods &ldquo;are of better quality and of better price than the real names,&rdquo; Jack Ma said. &nbsp;\nMany analysts and historians have attributed Chinese counterfeiting to perceived aspects of Chinese culture like its emphasis on memorization in education, or an authoritarian government that stifles innovation. But rather than these reductions of culture, it has more to do with the evolution of China&rsquo;s gadget and electronics manufacturing hub of Shenzhen, explains Silvia Lindtner, who researches Chinese entrepreneurship culture at the University of Michigan.\nThe city&rsquo;s rise throughout the &rsquo;90s and early &rsquo;00s coincided with a boom in outsourcing among global multinational corporations. Instead of overseeing all the manufacturing of all the parts inside a product, large global hardware companies signed contracts with local manufacturers in Shenzhen to make and design products piecemeal. These contractors would then turn to smaller sub-contractors to help fill orders.\nMany of the factories involved in these fragmented supply chains were small, family-owned entities operating without government approval. As they worked together, they realized they could do more than just supply parts that ended up in name-brand hardware. They could create rival products on their own, and reach customers who were too poor to buy a Nokia phone or Apple iPod, said Lindtner.\nThey banded together, at times sharing the recipes for specific electronic devices on online message boards. Thus began the shanzhai phenomenon, a word that literally means &ldquo;mountain fortress,&rdquo; but came to stand for products that skirt existing intellectual property laws. Phones and consumer electronics with names like &ldquo;aPod&rdquo; and &ldquo;Nokla&rdquo; flooded the market in the late &rsquo;00s.\nA &ldquo;shanzhai&rdquo; iPhone lookalike tablet running (likely a pirated version of) Windows software. (Reuters\/Bobby Yip)Open-source manufacturing\nThe shanzhai era in consumer electronics gradually faded as incomes rose and brand-name smartphones became more affordable. But it enforced a culture of knowledge-sharing among manufacturers, wherein no single product design is sacred. Lindtner compares the culture of Shenzhen&rsquo;s manufacturing ecosystem to the open-source movement among software developers. Much like how programmers will freely share code for others to improve upon, Shenzhen manufacturers now see hardware and product design as something that can be borrowed freely and altered. Success in business comes down to speed and execution, not necessarily originality.\n&ldquo;It&rsquo;s understood that re-iterating or copying is part of the culture, and whoever is better and faster is going to make the deal,&rdquo; said Lindtner. \nNowadays, China&rsquo;s copycat phenomenon extends well beyond multinational corporations like Gucci or Nokia&mdash;startups are affected too. Thanks to the internet, factories and designers looking for the next hit product can easily turn to Kickstarter, Amazon, or Taobao to see what gadgets are hot. They message each other instantly using WeChat, China&rsquo;s dominant chat app, or Alibaba&rsquo;s chat software, which makes sourcing and assembly line planning even easier than in the pre-smartphone days. &nbsp;Factories turn to Kickstarter, Amazon, or Taobao to see what&rsquo;s hot. &nbsp;\n&ldquo;The whole Chinese system has developed around the idea that you have instantaneous communication and basically infinite information,&rdquo; said Bunnie Huang, author of The Essential Guide to Electronics in Shenzhen. &ldquo;Back in the &rsquo;80s people were talking about &lsquo;just-in time&rsquo; manufacturing&rdquo; as something to aspire to, he said. &ldquo;But now, the Chinese don&rsquo;t even know any other way.&rdquo;\nEnforcement is impossible\nBusinesses can take certain legal precautions to reduce the risk of getting copied. A first, crucial step, according to Song Zhu, who litigates IP disputes between US and Chinese firms at California-based law firm Ruyak Cherian LLP, is to apply for utility and design patents for a product that&rsquo;s valid in the US, China, and anywhere else one hopes to sell.\nEntrepreneurs should also sign &ldquo;NNN agreements&rdquo; with potential Chinese partners before revealing any intellectual property. This contract prevents partner factories from using the intellectual property themselves after first view (&ldquo;non-use&rdquo;), sharing it with others (&ldquo;non-disclosure&rdquo;), or inking a partnership and then selling extra units on their own (&ldquo;non-circumvention&rdquo;).\nBut even with these protections, there&rsquo;s no guarantee that you can stop someone from copycatting your product. Zhu said that the problem lies not in China&rsquo;s courts, but enforcing rulings. Winning a case against one factory is …",
                "fallback": "Quartz Link: Your brilliant Kickstarter idea could be on sale in China before you’ve even finished funding it",
                "from_url": "http:\/\/qz.com\/771727\/chinas-factories-in-shenzhen-can-copy-products-at-breakneck-speed-and-its-time-for-the-rest-of-the-world-to-get-over-it\/?utm_content=bufferb3b40&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer",
                "service_icon": "https:\/\/app.qz.com\/img\/icons\/touch_144.png",
                "id": 1
            }
        ],
        "ts": "1477499983.000380"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "Take away: you must give your product a step up over copy cats (think UX and\/or industrial design or something that is so hard to do they wont bother to copy it)",
        "ts": "1477500072.000382"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "thanks for the takeawy",
        "ts": "1477500200.000383"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "saved me a click",
        "ts": "1477500205.000384"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "People need TL;DRs since it is a long article",
        "ts": "1477500260.000385"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "also, if you make a mechanical device it will get copied",
        "ts": "1477500274.000386"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "Thanks for sharing Lee. \n\nThe legendary Apple Mac SE was made with no draft angles. The tooling for it is very expensive but I heard it saved them from copy cats back then. \n\nIn Germany there is a negative design award (dating back to the early 90’s) for the best copied product. China just got even faster … \n\n<http:\/\/plagiarius.de\/index.php?ID=3&amp;SETSPRACHE=2>",
        "attachments": [
            {
                "title": "Aktion Plagiarius",
                "title_link": "http:\/\/plagiarius.de\/index.php?ID=3&SETSPRACHE=2",
                "text": "Negativpreis Plagiarius - Original statt Fälschung",
                "fallback": "Aktion Plagiarius",
                "image_url": "http:\/\/www.plagiarius.de\/img\/plagiarius_logo.gif",
                "from_url": "http:\/\/plagiarius.de\/index.php?ID=3&SETSPRACHE=2",
                "image_width": 209,
                "image_height": 152,
                "image_bytes": 9344,
                "service_icon": "http:\/\/plagiarius.de\/.\/apple-touch-icon-57x57.png",
                "service_name": "plagiarius.de",
                "id": 1
            }
        ],
        "edited": {
            "user": "U0HPGQ4KH",
            "ts": "1477507367.000000"
        },
        "ts": "1477507320.000387"
    },
    {
        "type": "message",
        "subtype": "file_share",
        "text": "<@U0K8ZSHN0|lee> uploaded a file: <https:\/\/uncorked.slack.com\/files\/lee\/F2UMWEEKC\/inductive_charging.jpg|Inductive charging>",
        "file": {
            "id": "F2UMWEEKC",
            "created": 1477515521,
            "timestamp": 1477515521,
            "name": "Inductive charging.jpg",
            "title": "Inductive charging",
            "mimetype": "image\/jpeg",
            "filetype": "jpg",
            "pretty_type": "JPEG",
            "user": "U0K8ZSHN0",
            "editable": false,
            "size": 2342613,
            "mode": "hosted",
            "is_external": false,
            "external_type": "",
            "is_public": true,
            "public_url_shared": false,
            "display_as_bot": false,
            "username": "",
            "url_private": "https:\/\/files.slack.com\/files-pri\/T0260V1BR-F2UMWEEKC\/inductive_charging.jpg?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "url_private_download": "https:\/\/files.slack.com\/files-pri\/T0260V1BR-F2UMWEEKC\/download\/inductive_charging.jpg?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "thumb_64": "https:\/\/files.slack.com\/files-tmb\/T0260V1BR-F2UMWEEKC-9c5799f993\/inductive_charging_64.jpg?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "thumb_80": "https:\/\/files.slack.com\/files-tmb\/T0260V1BR-F2UMWEEKC-9c5799f993\/inductive_charging_80.jpg?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "thumb_360": "https:\/\/files.slack.com\/files-tmb\/T0260V1BR-F2UMWEEKC-9c5799f993\/inductive_charging_360.jpg?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "thumb_360_w": 360,
            "thumb_360_h": 270,
            "thumb_480": "https:\/\/files.slack.com\/files-tmb\/T0260V1BR-F2UMWEEKC-9c5799f993\/inductive_charging_480.jpg?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "thumb_480_w": 480,
            "thumb_480_h": 360,
            "thumb_160": "https:\/\/files.slack.com\/files-tmb\/T0260V1BR-F2UMWEEKC-9c5799f993\/inductive_charging_160.jpg?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "thumb_720": "https:\/\/files.slack.com\/files-tmb\/T0260V1BR-F2UMWEEKC-9c5799f993\/inductive_charging_720.jpg?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "thumb_720_w": 720,
            "thumb_720_h": 540,
            "thumb_960": "https:\/\/files.slack.com\/files-tmb\/T0260V1BR-F2UMWEEKC-9c5799f993\/inductive_charging_960.jpg?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "thumb_960_w": 960,
            "thumb_960_h": 720,
            "thumb_1024": "https:\/\/files.slack.com\/files-tmb\/T0260V1BR-F2UMWEEKC-9c5799f993\/inductive_charging_1024.jpg?t=xoxe-2204987399-220009572576-220663233794-4d92389b8a",
            "thumb_1024_w": 1024,
            "thumb_1024_h": 768,
            "image_exif_rotation": 1,
            "original_w": 4032,
            "original_h": 3024,
            "permalink": "https:\/\/uncorked.slack.com\/files\/lee\/F2UMWEEKC\/inductive_charging.jpg",
            "permalink_public": "https:\/\/slack-files.com\/T0260V1BR-F2UMWEEKC-8336a821ba",
            "channels": [
                "C026T598V"
            ],
            "groups": [],
            "ims": [],
            "comments_count": 0
        },
        "user": "U0K8ZSHN0",
        "upload": true,
        "display_as_bot": false,
        "username": "lee",
        "bot_id": null,
        "ts": "1477515529.000392"
    },
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "Oooo ahhhh",
        "ts": "1477515656.000393"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "woah",
        "ts": "1477525563.000394"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "My goal with the inductive charging is to vet cheap Chinese hardware as well as make the intel demo be able to continue to run via continuous charge",
        "ts": "1477525775.000395"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "I'm still working on validating the Texas Instruments hardware. A good windows install is evading me",
        "ts": "1477525804.000396",
        "reactions": [
            {
                "name": "raised_hands::skin-tone-3",
                "users": [
                    "U0HPGQ4KH"
                ],
                "count": 1
            },
            {
                "name": "windows",
                "users": [
                    "U02E3CRMA"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "what is this “good windows” you speak of?",
        "ts": "1477530856.000397"
    }
]