[
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<@U0EL0GLEL> Found a couple goodies on color correction (specifically gamma) over the weekend...",
        "ts": "1497893447.447290"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<https:\/\/learn.adafruit.com\/led-tricks-gamma-correction\/the-quick-fix>",
        "attachments": [
            {
                "title": "LED Tricks: Gamma Correction",
                "title_link": "https:\/\/learn.adafruit.com\/led-tricks-gamma-correction\/the-quick-fix",
                "text": "RGB colors off? It’s not your LEDs or code…it’s biology!",
                "fallback": "LED Tricks: Gamma Correction",
                "from_url": "https:\/\/learn.adafruit.com\/led-tricks-gamma-correction\/the-quick-fix",
                "service_icon": "https:\/\/learn.adafruit.com\/assets\/favicon-0c79bd4bc582e6d4cf3afe417bd1e28120527c09d92c08a6464690c5bf6b85f4.ico",
                "service_name": "learn.adafruit.com",
                "id": 1
            }
        ],
        "ts": "1497893448.447895"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "FastLED provides routines for setting gamma",
        "ts": "1497893461.452878"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<https:\/\/github.com\/FastLED\/FastLED\/blob\/06a5abcf1fa65115adb42a79e112a34e6c8ff5a7\/colorutils.h>",
        "attachments": [
            {
                "service_name": "GitHub",
                "title": "FastLED\/FastLED",
                "title_link": "https:\/\/github.com\/FastLED\/FastLED\/blob\/06a5abcf1fa65115adb42a79e112a34e6c8ff5a7\/colorutils.h",
                "text": "The main FastLED library (successor to FastSPI_LED). Please direct questions\/requests for advice to the g+ community - <http:\/\/fastled.io\/+> - we&amp;#39;d like to keep issues to just tracking bugs\/enha...",
                "fallback": "GitHub: FastLED\/FastLED",
                "from_url": "https:\/\/github.com\/FastLED\/FastLED\/blob\/06a5abcf1fa65115adb42a79e112a34e6c8ff5a7\/colorutils.h",
                "thumb_url": "https:\/\/avatars3.githubusercontent.com\/u\/5899270?v=3&s=400",
                "thumb_width": 250,
                "thumb_height": 250,
                "service_icon": "https:\/\/a.slack-edge.com\/bfaba\/img\/unfurl_icons\/github.png",
                "id": 1
            }
        ],
        "ts": "1497893461.453130"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "but alas not for brightness adjustment",
        "ts": "1497893505.469135"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "stuff to catalog for power-optimization later",
        "ts": "1497893518.474112"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "I should put that in our Confluence pages... :gif_thinking_face:",
        "ts": "1497893539.482160"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "<http:\/\/hackaday.com\/2017\/06\/19\/intel-discontinues-joule-galileo-and-edison-product-lines\/>",
        "attachments": [
            {
                "service_name": "Hackaday",
                "service_url": "http:\/\/hackaday.com",
                "title": "Intel Discontinues Joule, Galileo, And Edison Product Lines",
                "title_link": "http:\/\/hackaday.com\/2017\/06\/19\/intel-discontinues-joule-galileo-and-edison-product-lines\/",
                "author_name": "Jenny List",
                "author_link": "https:\/\/hackaday.com\/author\/jennylist\/",
                "thumb_url": "https:\/\/i0.wp.com\/hackadaycom.files.wordpress.com\/2017\/06\/inttel-eol-featured.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 63,
                "text": "Sometimes the end of a product&rsquo;s production run is surrounded by publicity, a mix of a party atmosphere celebrating its impact either good or bad, and perhaps a tinge of regret at its passing. Think of the last rear-engined Volkswagens rolling off their South American production lines for an example.\nThen again, there are the products that die with a whimper, their passing marked only by a barely visible press release in an obscure corner of the Internet. Such as this week&rsquo;s discontinuances from Intel, in a series of PDFs lodged on a document management server announcing the end of their Galileo (PDF), Joule (PDF), and Edison (PDF) lines. The documents in turn set out a timetable for each of the boards, for now they are still available but the last will have shipped by the end of 2017.\nIt&rsquo;s important to remember that this does not mark the end of the semiconductor giant&rsquo;s forray into the world of IoT development boards, there is no announcement of the demise of their Curie chip, as found in the Arduino 101. But it does mark an ignominious end to their efforts over the past few years in bringing the full power of their x86 platforms to this particular market, the Curie is an extremely limited device in comparison to those being discontinued.\nWill the departure of these products affect our community, other than those who have already invested in them? It&rsquo;s true to say that they haven&rsquo;t made the impression Intel might have hoped, over the years only a sprinkling of projects featuring them have come our way compared to the flood featuring an Arduino or a Raspberry Pi. They do seem to have found a niche though where there is a necessity for raw computing power rather than a simple microcontroller, so perhaps some of the legion of similarly powerful ARM boards will plug that gap.\nSo where did Intel get it wrong, how did what were on the face of it such promising products fizzle out in such a disappointing manner? Was the software support not up to scratch, were they too difficult to code for, or were they simply not competitively priced in a world of dirt-cheap boards from China? As always, the comments are open.\nHeader image:&nbsp;Mwilde2 [CC BY-SA 4.0].",
                "fallback": "Hackaday Link: Intel Discontinues Joule, Galileo, And Edison Product Lines",
                "from_url": "http:\/\/hackaday.com\/2017\/06\/19\/intel-discontinues-joule-galileo-and-edison-product-lines\/",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/hackaday-2\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1497898459.337230"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "?",
        "ts": "1497898461.337894"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "yes, this is what we in the product development world call a curveball.",
        "ts": "1497899681.783946"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "We heard late last week.",
        "ts": "1497899687.786132"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Working on a backup plan.",
        "ts": "1497899695.788887"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<https:\/\/qz.com\/1000272\/its-not-just-the-nhs-in-the-internet-of-things-everything-is-more-hackable-than-you-think\/>",
        "attachments": [
            {
                "service_name": "Quartz",
                "service_url": "http:\/\/qz.com",
                "title": "The “Internet of Things” is way more vulnerable than you think—and not just to hackers",
                "title_link": "https:\/\/qz.com\/1000272\/its-not-just-the-nhs-in-the-internet-of-things-everything-is-more-hackable-than-you-think\/",
                "author_name": "Commentary",
                "author_link": "https:\/\/qz.com\/author\/commentaryqz\/",
                "thumb_url": "https:\/\/i0.wp.com\/qzprod.files.wordpress.com\/2017\/06\/ap_944667069724-e1496787159968.jpg?fit=200%2C150&quality=80&strip=all&ssl=1",
                "thumb_width": 200,
                "thumb_height": 130,
                "text": "Not far from San Francisco International Airport, San Bruno is a quaint middle-class residential suburb, yet underground in San Bruno was a gas pipeline controlled by SCADA software that used the Internet as its communications backbone. On Sept. 9, 2010, a short circuit caused the operations room to read a valve as open when it had actually closed, spiking the readings coming from pipeline pressure sensors in different parts of the system. Unbeknownst to the families returning home from ballet and soccer practice, technicians were frantically trying to isolate and fix the problem. At 6:11 pm, a corroded segment of pipe ruptured in a gas-fueled fireball. The resulting explosion ripped apart the neighborhood. Eight people died. Seventeen homes burned down. The utility, PG&amp;E, was hit with a $1.6 billion fine.\nThe accident investigation report blamed the disaster on a sub-standard segment of pipe and technical errors; there was no suggestion that the software error was intentional, no indication that malicious actors were involved. &ldquo;But that&rsquo;s just the point,&rdquo; Joe Weiss argues. &ldquo;The Internet of Things introduces new vulnerabilities even without malicious actors.&rdquo;&nbsp;The Internet of Things introduces new vulnerabilities even without malicious actors.&nbsp;\nJoe Weiss is a short, bespectacled engineer in his sixties. He has been involved in engineering and automation for four decades, including fifteen years at the respected Electric Power Research Institute. He has enough initials after his name to be a member of the House of Lords&mdash;PE, CISM, CRISC, IEEE Senior Fellow, ISA Fellow, etc., all of which speak to his expertise and qualifications as an engineer. For instance, he wrote the safety standards for the automated systems at nuclear power plants.\nThe problem, Weiss claims, is using the internet to control devices that it was never intended to control. Among these are industrial systems in power plants or factories, devices that manage the flow of electricity through the energy grid, medical devices in hospitals, smart-home systems, and many more.\nThe quintessential icon of the Internet of Things (IoT) and the darling of Silicon Valley techies and entrepreneurs is a round, wall-mounted gadget called Nest. Invented by two former Apple engineers, Nest was bought by Google for $3.2 billion in cash. Essentially a thermostat connected to the internet, Nest also has software that learns your behavior and adjusts the temperature in your house on its own. It also checks the internet for the weather in your zip code and adapts accordingly. More recent models of Nest are linked to door locks, lights, window shades, and cameras. Unlike most of the IoT, which is hidden from consumers inside of machines, whirring in factories and office buildings, Nest occupies a prominent place on the wall of the home; indeed, it controls the home, and it has become quite popular within the consumer electronics industry in recent years.\nHowever, in mid-January 2016, there was a little problem with a software update from the month before. New York Times reporter Nick Bilton described his personal experience, &ldquo;The Nest Learning Thermostat is dead to me, literally. Last week, my once-beloved &lsquo;smart&rsquo; thermostat suffered from a mysterious software bug that drained its battery and sent our home into a chill in the middle of the night.&rdquo;\n&ldquo;Although I had set the thermostat to 70 degrees overnight, my wife and I were woken by a crying baby at 4 a.m.&rdquo; His Nest had died, its battery depleted by the software glitch. Thousands of other Nest users also woke in the cold because when the Nest died, it shut off the heat. Other users complained that their home alarm systems had triggered in the middle of the night for no apparent reason, ripping them from deep sleep into a state of panic. Nest apologized and suggested that users perform a complex nine-step process to revive their home-control systems.\nThe bug had taken advantage of an existing computer network. This computer network, transparent to most of us, is a critical part of the global infrastructure. It is known as the Internet of Things, the IoT. &ldquo;The Internet of Things is just a marketing term that somebody thought up long after millions of machines were already networked,&rdquo; Weiss explained to us, &ldquo;And most of them are networked in ways that can be accessed, perhaps indirectly, from the public internet.&rdquo; It is that understanding, that everything is connected, that keeps Joe Weiss up at night.\nJoe Weiss&rsquo;s concerns were confirmed in Oct. 2016, when over 100,000 video surveillance cameras connected to the internet were compromised by a hacking group, turned into a botnet, and then used to launch a flood of internet traffic&mdash;a distributed denial of service (DDoS) attack&mdash;on one of the largest internet address lookup sites, the Domain Name System servers. The result was that hundreds of large internet sites were unavailable until the attackers turned off the flood. The cameras lacked a firewall to protect from malicious software. Often, devices similar to those cameras require a password to access them, but equally often the manufacturer writes its own password in the source code so that it can always get in. Once this so-called hard coded password becomes known on the internet black market, the devices are easily enslaved for malicious use. With billions of such devices going online in the latter half of this decade, the potential number of bots is enough to disrupt the internet itself, and any site or network on it.\nOne market where the Internet of Things purveyors are pressing for widespread adoption is medical care. According to one estimate, the IoT-medical market could reach $117 billion by the end of the decade. The device types that are or will soon be netted into the IoT include pacemakers, implantable cardiac defibrillators, insulin pumps, IV pumps (including those for prescription painkillers), and heart-lung machines. The advantages seem obvious. These devices could detect medical problems and perhaps even administer treatment without the help of a doctor.\nThe problem is that the healthcare industry, which is rushing headlong into the IoT, has a bad track record when it comes to cyber security. BitSight, a Boston firm that ranks companies for their level of cybersecurity, compared five industries: health care, finance, retail, utilities, and federal agencies. Health care, represented by 2,500 companies in the survey, placed dead last. Veracode, another Boston cyber company also looked at five industries, but with a different metric. It asked what percentage of known vulnerabilities in software were fixed. In manufacturing, over 80 percent of the problems had been addressed. In medicine, it was half that number. In fact, more than three quarters of all medical software applications currently in use have a known vulnerability.\nThese vulnerabilities in the healthcare sector were highlighted in a big way when the UK&rsquo;s National Health Service (NHS) was struck by the &ldquo;WannaCry&rdquo; ransomware in May 2017. Thousands upon thousands of computers had their contents encrypted, and operators could only regain access by paying the creators of the malware hundreds of dollars. In the wake of the malware&rsquo;s proliferation, the NHS had to cancel thousands of scheduled operations and appointments, putting lives at risk and creating an enormous disruption of medical services in the U.K. This problem is driven in large part by the nature of healthcare technology itself, which often discourages administrators from upgrading their systems. Medical devices regularly run on software so old that the manufacturers no longer issue new &ldquo;firmware&rdquo; upgrades for them, essentially meaning that the devices don&rsquo;t know how to speak to newer, more secure operating systems. Thus, if administrators were to upgrade the op…",
                "fallback": "Quartz Link: The &#8220;Internet of Things&#8221; is way more vulnerable than you think—and not just to hackers",
                "from_url": "https:\/\/qz.com\/1000272\/its-not-just-the-nhs-in-the-internet-of-things-everything-is-more-hackable-than-you-think\/",
                "service_icon": "https:\/\/app.qz.com\/img\/icons\/touch_144.png",
                "id": 1
            }
        ],
        "ts": "1497913641.873579"
    }
]