[
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "Some thoughts on voice \/ Alexa \/ retention and market share: <https:\/\/www.recode.net\/2017\/1\/23\/14340966\/voicelabs-report-alexa-google-assistant-echo-apps-discovery-problem>",
        "attachments": [
            {
                "service_name": "Recode",
                "title": "Alexa and Google Assistant have a problem: People aren’t sticking with voice apps they try",
                "title_link": "https:\/\/www.recode.net\/2017\/1\/23\/14340966\/voicelabs-report-alexa-google-assistant-echo-apps-discovery-problem",
                "text": "Discovery and retention issues are both challenge and opportunity.",
                "fallback": "Recode: Alexa and Google Assistant have a problem: People aren’t sticking with voice apps they try",
                "image_url": "https:\/\/cdn.vox-cdn.com\/thumbor\/PE33QaGm13zpCLAQ8FNQjQr0-zc=\/0x0:1200x675\/1600x900\/cdn.vox-cdn.com\/uploads\/chorus_image\/image\/52869357\/amazon-echo-1.0.jpg",
                "image_width": 444,
                "image_height": 250,
                "ts": 1485169202,
                "from_url": "https:\/\/www.recode.net\/2017\/1\/23\/14340966\/voicelabs-report-alexa-google-assistant-echo-apps-discovery-problem",
                "image_bytes": 167749,
                "service_icon": "https:\/\/cdn1.vox-cdn.com\/uploads\/chorus_asset\/file\/6397047\/recode_favicon-180.0.png",
                "id": 1
            }
        ],
        "ts": "1497380393.083057"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "<https:\/\/techcrunch.com\/2017\/05\/08\/amazon-to-control-70-percent-of-the-voice-controlled-speaker-market-this-year\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "Amazon to control 70 percent of the voice-controlled speaker market this year",
                "title_link": "https:\/\/techcrunch.com\/2017\/05\/08\/amazon-to-control-70-percent-of-the-voice-controlled-speaker-market-this-year\/",
                "author_name": "Sarah Perez",
                "thumb_url": "https:\/\/i0.wp.com\/tctechcrunch2011.files.wordpress.com\/2017\/05\/echo_and_echo_dot.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 199,
                "thumb_height": 112,
                "text": "Amazon is dominating the voice-controlled speaker market, according to a new forecast from eMarketer out this morning. The maker of the Echo-branded speakers will&nbsp;have 70.6 percent of all voice-enabled speaker users in the U.S. this year &ndash; well ahead of Google Home&rsquo;s 23.8 percent and other, smaller players like Lenovo, LG, Harmon Kardon, and Mattel, who combined only account for 5.6 percent of users.\nThe new report backs up another from VoiceLabs released in January, which also found that Amazon was leading the voice-first device market, thanks to Echo&rsquo;s popularity.\nWhile the market itself is not expected to be a winner-take-all scenario, competitors like Amazon and Google will win entire homes, as most consumers have said they wouldn&rsquo;t consider buying a competing device once they already own one voice-controlled speaker.\n\nEmarketer says&nbsp;Amazon&rsquo;s share will&nbsp;fall somewhat as Google gets its Home devices into more consumers&rsquo; hands, but Amazon will lead the market for the &ldquo;foreseeable future.&rdquo;\nThis year, 35.6 million Americans will use a voice-activated device at least once per month, the firm estimates &ndash; a 128.9 percent over 2016. (The company is not counting voice assistants on smartphones in this part of its forecast&nbsp;&ndash; only those digital assistants on standalone voice-enabled speakers.)\nHowever, the wider voice assistant market &ndash; which includes Siri, Alexa, Google Now and Microsoft&rsquo;s Cortana operating on any device &ndash; &nbsp;is expected to grow 23.1 percent this year, eMarketer says. In 2017, 60.5 million U.S. users will use one of these assistants at least once per month. That&rsquo;s over a quarter (27.5%) of smartphone users, or nearly one in five Americans, the report notes.\n\nUsage is heaviest among a younger demographic &ndash; those between 25 and 34, make up 26.3 percent of virtual assistant users. In addition, more than one-third of millennials (33.5%) will use virtual assistants in 2017.\n&ldquo;Older millennials are the core users of virtual assistants, mainly due to their demand for functionality over entertainment,&rdquo;&nbsp;eMarketer&rsquo;s VP of Forecasting, Mart&iacute;n Utreras, says.\nAmazon doesn&rsquo;t disclose Echo sales figures, but said in February that Echo family sales are up over 9x compared to last season. VoiceLabs estimated&nbsp;in January&nbsp;there are over 7 million devices in customers&rsquo; homes; Consumer Intelligence Research Partners (CIRP) around the same time put it higher at 8.2 million; and Morgan Stanley believes it was over 11 million&nbsp;before the 2017 holidays.\nAmazon&rsquo;s strategy with Alexa is to allow the assistant to extend beyond just voice-controlled speakers it manufacturers. The company has also included the assistant in its Amazon mobile shopping app, and has made it available to third-parties for use in their own hardware and software applications.\nWith its dominant market share, Amazon&rsquo;s Alexa could bring in $10 billion in revenue&nbsp;by 2020, RBC Capital Markets had also estimated in March. This figure included Alexa device sales, voice shopping sales, and platform revenue. The firm forecasted there will be 60 million Alexa devices sold in 2020, bringing the install base to 128 million.",
                "fallback": "TechCrunch Link: Amazon to control 70 percent of the voice-controlled speaker market this&nbsp;year",
                "from_url": "https:\/\/techcrunch.com\/2017\/05\/08\/amazon-to-control-70-percent-of-the-voice-controlled-speaker-market-this-year\/",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/techcrunch-2013\/assets\/images\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1497380398.084810"
    }
]