[
    {
        "type": "message",
        "user": "U0H4SJN11",
        "text": "hmm didn't realize how easy it was to powdercoat.",
        "ts": "1480233458.000004"
    },
    {
        "type": "message",
        "user": "U0H4SJN11",
        "text": "<http:\/\/hackaday.com\/2015\/10\/25\/diy-powder-coating\/>",
        "attachments": [
            {
                "service_name": "Hackaday",
                "service_url": "http:\/\/hackaday.com",
                "title": "DIY Powder Coating",
                "title_link": "http:\/\/hackaday.com\/2015\/10\/25\/diy-powder-coating\/",
                "author_name": "Brian Benchoff",
                "author_link": "https:\/\/hackaday.com\/author\/brianbenchoff\/",
                "thumb_url": "https:\/\/i0.wp.com\/hackadaycom.files.wordpress.com\/2015\/10\/masked_truck.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 69,
                "text": "If you don&rsquo;t yet have a toaster oven you can&rsquo;t use with food, here&rsquo;s yet another reason: DIY powder coating. Powder coating is much harder and more durable than paint &ndash; a property imbued to it by the fact that it&rsquo;s baked on to a part. [Thomas] had a go at powder coating some skateboard trucks, and with the right tools, found the process downright easy.\n[Thomas] only needed a few things to powder coat his parts, the first and most important being a powder coat gun. A few years ago, Craftsman produced a powder coat gun that&rsquo;s still available on Amazon and eBay for about $50. Powders are plentiful and cheap in small quantities. The only other tools needed were an N95 or better respirator, some high temperature tape for masking off the part and a toaster oven. If you want to coat&nbsp;big parts, there are DIY oven options for that.\nAfter the part was sandblasted down to bare metal, [Thomas] masked off all the holes and threads of the part with polyimide tape. Any tape that&rsquo;s capable of withstanding high temperatures will do, and most of us have a roll of Kapton sitting next to a 3D printer, anyway.\nThe part is coated with powder via an electrostatic charge, and this means attaching a ground lead from the gun to the part. After that, it&rsquo;s just filling the gun with powder, putting it in the oven set at 450&deg;F, and letting the powder liquefy.\nIn the video below, you can see [Thomas] sandblasting, powdering, and baking a set of aluminum skateboard trucks using his method. Compared to other methods of finishing metal parts &ndash; anodizing or plating, for instance, powder coating is remarkably easy and something anyone can do in a garage.\nThanks [Tyler] for sending this one in.",
                "fallback": "Hackaday Link: DIY Powder Coating",
                "from_url": "http:\/\/hackaday.com\/2015\/10\/25\/diy-powder-coating\/",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/hackaday-2\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1480233458.000005"
    },
    {
        "type": "message",
        "user": "U0H4SJN11",
        "text": "Essentially just need a big enough oven to cook whatever you do.",
        "ts": "1480233480.000007"
    }
]