[
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "<http:\/\/hackaday.com\/2017\/03\/25\/mrrf-17-e3d-introduces-combination-extruder-and-hotend\/>",
        "attachments": [
            {
                "service_name": "Hackaday",
                "service_url": "http:\/\/hackaday.com",
                "title": "MRRF 17: E3D Introduces Combination Extruder And Hotend",
                "title_link": "http:\/\/hackaday.com\/2017\/03\/25\/mrrf-17-e3d-introduces-combination-extruder-and-hotend\/",
                "author_name": "Brian Benchoff",
                "author_link": "https:\/\/hackaday.com\/author\/brianbenchoff\/",
                "thumb_url": "https:\/\/i1.wp.com\/hackadaycom.files.wordpress.com\/2017\/03\/aero.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 97,
                "text": "Since the beginning of time, or 2006, the &lsquo;hot glue gun&rsquo; part of our CNC hot glue guns have had well-defined parts. The extruder is the bit that pushes plastic through a tube, and the hot end is where all the melty bits are. These are separate&nbsp;devices, even though a shorter path from the extruder to hotend&nbsp;is always better. From Wade&rsquo;s gear extruder to a nozzle made from an acorn nut, having the hotend&nbsp;and extruder as separate&nbsp;devices has become the standard.\nThis week at the Midwest RepRap Festival, E3D unveiled the Titan Aero. It&rsquo;s an extruder and hotend&nbsp;rolled into one that provides better control over the filament, gives every printer more build height, and reduces the mass of a 3D printer toolhead.\n\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\tThe Titan + V6 hotend. This is significantly longer than the Titan Aero\n\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\tThe Titan Aero extruder + hotend\n\t\t\t\t\n\nThe Titan Aero, revealed on the E3D blog yesterday, is the next iteration of E3D&rsquo;s entry into the extruder market. It&rsquo;s a strange mashup of their very popular V6 hotend, with the heat break coupled tightly to the extruder body. A large fan provides the cooling, and E3D&rsquo;s thermal simulations show this setup will work well.\nThe aluminum thermal block of the Titan AeroThe core component of the Aero extruder is a fancy and complex piece of milled aluminum. This is the heatsink for the extruder and provides the shortest path possible between the hobbed gear and the nozzle. This gives the Aero better control over the extrusion of molten plastic and makes this the perfect extruder and hotend setup for hard to print materials.\nCombine the Aero with a smaller &lsquo;pancake&rsquo; stepper motor, and you have a very small, very light hotend and extruder. This makes it perfect for the small printers we&rsquo;re so fond of and for printers built for fast acceleration. I can easily see a few end effectors for Delta-style printers built around this extruder in the near future.\nE3D&rsquo;s Volcano nozzle sockAlso at the E3D booth were a few prototypes of nozzle socks. Late last year, E3D released silicone nozzle covers &ndash; we&rsquo;re calling them nozzle socks &ndash; for their V6 hotend. These are small silicone covers designed to keep that carbonized crap off of your fancy, shiny hotend. It&rsquo;s not something that&rsquo;s necessary for a good print, but it does keep filament from sticking to your hotend, and you get the beautiful semantic satiation of saying the words nozzle socks.\nE3D&rsquo;s&nbsp;other hotend, the Volcano, a massive and powerful hotend designed to push a lot of plastic out fast, did not get its own nozzle sock at the time. Now, the prototypes are out, and the E3D guys expect them to be released, &lsquo;in about a month&rsquo;.",
                "fallback": "Hackaday Link: MRRF 17: E3D Introduces Combination Extruder And Hotend",
                "from_url": "http:\/\/hackaday.com\/2017\/03\/25\/mrrf-17-e3d-introduces-combination-extruder-and-hotend\/",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/hackaday-2\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1490510091.903002"
    }
]