[
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U02918BKW>: update for ya - rob honed in on some specific hair cuts and tweaks to the approach that he’s gonna review with the creative team.  still coming in at 91k full 200 hr\/rate that feels true to project.  haven’t heard back from lue yet so on the AM front, want me to ping him again or do you wanna call him directly [with or without me]?",
        "ts": "1456432191.000002"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Elena shot me a call about 15 minutes ago. I deferred pick up until we had a bit more clarity on how we want to proceed. I need to set up creative review with Ivan and Ewald, but at this point, do we feel comfortable moving forward with the Orange haircut and Uncorked support approach at approx. 90k?",
        "ts": "1456444255.000003"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "i understand what you're calling a haircut to be more \"the right plan\" than about reducing cost as a matter of responding to budget pressure. if that is true, then i feel comfortable working with Elena to spell that out and get her feedback. if at any point we are reducing the work for the sake of anticipated client reaction, it bears asking whether it is time yet.",
        "ts": "1456449021.000004"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": ":thumbsup: ",
        "ts": "1456449110.000005"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U02918BKW>: loving these articulations. ",
        "ts": "1456449789.000006"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Ion down to call like with ya tomorrow it helps. ",
        "ts": "1456449812.000007"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Luke*",
        "ts": "1456449824.000008"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "I'll try again now ",
        "ts": "1456449871.000009"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Just ran the hours proposal by Ivan. Decreased interview hours and increased kickoff hours. Talking over with him, he feels it’s in a good spot.",
        "ts": "1456450581.000010"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "K caught Luke. He's caught up with 6 fig 6 week engagement. Tomorrow he's meeting with SDc to push the new universe of scope, since it was news to Chronos that SDC wanted them to own the product and effort. So tomorrow EOD he can comment. He has been sitting on replying.",
        "ts": "1456450677.000011"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "No alarms.",
        "ts": "1456450689.000012"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Great! Thanks for the update. On the “haircuts”. The few areas we might be asking Elena to ease up on are specifically around the hours needed for recruitment (those are pass through costs and MDC will be handling most of that). Developing research protocol (12 hrs. is still a lot) and secondary research (16 hrs. should be sufficient for that too)",
        "ts": "1456450727.000013"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Good to note that we won’t have a comment until EOD tomorrow. I’m setting up a call with Elena for Monday, so it’ll be nice to have a bit more information from Luke by then. Hopefully, we’ll be in a good place to push forward.",
        "ts": "1456450785.000014"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "This is great. A true team effort. ",
        "ts": "1456450865.000015",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U02918BKW",
                    "U026NB2U2",
                    "U0B9N0HF0"
                ],
                "count": 3
            }
        ]
    }
]