[
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "[for your future, morning self] hey <@U0B9N0HF0> i know you started working on a draft for luke last night but you cool if i send this?  anything to add or do you want me to hold off on kick off details?",
        "ts": "1456237118.000002"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "[moving Marcelino to BCC]\n\nHey Luke,\n\nThanks for the call.  It's great when we can jump right in to the context and some of the substance and history behind the venture.  Got the team and I thinking through some ideas.  \n\nAs of now, we're still regrouping but initial feelings are that this process may extend to ~6 weeks, thus having some impact on the budget.  We're still assessing but If you have any concerns or questions about the specifics at this point, let me know. We hope to circle back with an update tomorrow and hopefully some paperwork quickly after that.\n\nA couple logistics - \nIn looking at team schedules, somewhere between 3\/3-3\/10 may work best for our team.  Would a PDX kick off with representatives from Chronos, Uncorked and SDC be possible?  Would love to have ya here.  \nIs there any way we can gain access to the Chronos platform to acquaint ourselves a bit?\nThanks.  Looking forward to taking the next step.",
        "ts": "1456237134.000003"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "<@U0ML49XU0>: great email! Captures everything I wanted to say. Thanks! Only open questions I would like answered before pushing on the dates  a.) who is facilitating? AND b.) what is their availability? However, I think getting a specific answer from client on availability in that suggested range will probably help us answer those questions :)",
        "ts": "1456242493.000004"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "word, i can fire the note off",
        "ts": "1456243036.000005"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Awesome! Thanks! Also on that above note, intuitively I would think Elena as facilitator, but I'd like to confirm",
        "ts": "1456243074.000006"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "im with ya; chase her on the approach, she said she’d send through today",
        "ts": "1456243137.000007"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "also trello board was set up (but no content added).  you can do NAS, Float, Harvest whenever makes sense.  <https:\/\/trello.com\/b\/34B3ACnh\/chronos-pendant>",
        "ts": "1456243177.000008"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "see ya at a decent time :simple_smile: enjoy your morning",
        "ts": "1456243187.000009"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": ":+1:",
        "ts": "1456243332.000010"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Just spoke with Elena and got her estimates of what the project will take from them. Much larger than anticipated, but fair. Seems like the largest delta from our proposal to hers is the inclusion of a 2nd researcher.  She’s going to send out to the rest of the team in a few.",
        "ts": "1456267125.000002"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "I said we’ll regroup internally, discuss her proposal and gauge the price sensitivity of the client.",
        "ts": "1456267180.000003"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "roger that <@U0B9N0HF0>.  wanna book a regroup for the necessary parties here?",
        "ts": "1456269799.000002"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": ":+1:",
        "ts": "1456269829.000003"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "did you already ask about a fallback position if price gets too steep? good to have in pocket.",
        "ts": "1456274207.000004"
    }
]