[
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "<!channel> shipping deck now!",
        "ts": "1500332289.251909",
        "reactions": [
            {
                "name": "raised_hands::skin-tone-4",
                "users": [
                    "U0XJFPSRL",
                    "U0914MEN7",
                    "U0EL0GLEL"
                ],
                "count": 3
            }
        ]
    },
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "<!channel> great job everyone! ",
        "ts": "1500341511.255206"
    },
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "\"It looks like you were all very busy on Friday. This is great information and I will continue to review it.  The training content creation flows are great and the visuals with multiple projectors installed in a restaurant really demonstrate the potential for multiple units in a single restaurant. If we can really deliver on the concepts you outlined I can really see this improving training systems to the point of everyone being trained the same way at every restaurant which would have huge benefits in consistency across brands.  I’m getting more and more excited about this project.  Thanks for your hard work.\"",
        "ts": "1500341518.256537"
    },
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "That's exciting! And he's completely right about consistency. That's something i heard repeated constantly when working in that environment. :+1: ",
        "ts": "1500346114.075511"
    },
    {
        "type": "message",
        "user": "U0DCXC37U",
        "text": "<@U07KCCF0V> <@U02918BKW> <@U0914MEN7>  - as far as next steps from this - they are planning to use this output to gain Japan buy-in on August 1st still? Also, full budget is still around $200-250K for making a real POC? Have we done any scoping to work out a back-napkin of what it would take to make what we showed?",
        "ts": "1500352787.122861"
    },
    {
        "user": "U02918BKW",
        "inviter": "U0DCXC37U",
        "text": "<@U02918BKW|john> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1500352793.123706"
    }
]