[
    {
        "type": "message",
        "user": "U1ZG1UCAK",
        "text": "I don’t know how I am only now just seeing this but…\nomg Kristen Stewart cowrote a paper on style transfer! What a dreamboat :heart: :heart: :heart: :heart: :heart:",
        "ts": "1491418666.216554"
    },
    {
        "type": "message",
        "user": "U1ZG1UCAK",
        "text": ":heart:",
        "ts": "1491418671.218336"
    },
    {
        "type": "message",
        "user": "U1ZG1UCAK",
        "text": "<https:\/\/techcrunch.com\/2017\/01\/19\/kristen-stewart-co-authored-a-paper-on-style-transfer-and-the-ai-community-lost-its-mind\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "Kristen Stewart co-authored a paper on style transfer and the AI community lost its mind",
                "title_link": "https:\/\/techcrunch.com\/2017\/01\/19\/kristen-stewart-co-authored-a-paper-on-style-transfer-and-the-ai-community-lost-its-mind\/",
                "author_name": "John Mannes",
                "thumb_url": "https:\/\/i0.wp.com\/tctechcrunch2011.files.wordpress.com\/2017\/01\/screen-shot-2017-01-19-at-2-09-56-pm.png?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 113,
                "text": "Hollywood and the academic artificial intelligence community have an interesting relationship, to say the least. Many people interested in the field, myself included, love science fiction, but regularly end up being the obnoxious commentator on family movie night pointing out that Johnny Depp&rsquo;s Transcendence is more anti-intelligence than artificial intelligence. So it wasn&rsquo;t all that surprising that researchers were&nbsp;a bit perplexed when actress and director&nbsp;Kristen Stewart appeared as an author on a machine learning paper.\n\n\nTo be someone in Hollywood, you've got to put your ML papers on Arxiv and you better use TensorFlow&hellip; \n&mdash; Fran&ccedil;ois Chollet (@fchollet) January 19, 2017\n\n\n\nI used to tell Twilight jokes in my Intro to AI class. I take it all back.\n&mdash; Mark Riedl &#128551; (@mark_riedl) January 19, 2017\n\n\n\nI used to tell Twilight jokes in my Intro to AI class. I take it all back.\n&mdash; Mark Riedl &#128551; (@mark_riedl) January 19, 2017\n\nStewart directed Come Swim, a short film about a man&rsquo;s day told through both&nbsp;impressionism and realism. The film features the&nbsp;use of the so-called &ldquo;style transfer&rdquo; technique to build its story.\nStyle transfer is the fun&nbsp;technique that involves using convolutional neural networks to artistically alter&nbsp;video in real time. To do this, you basically show your algorithm an image (say a painting by van Gogh) and then teach it to&nbsp;apply the same painting technique to any regular photo.\nThe short, three-page paper, entitled&nbsp;Bringing Impressionism to Life with Neural Style Transfer in Come Swim, is really just a high-level case study about what it&rsquo;s like to apply style-transfer techniques to cinema.\nIn addition to Stewart,&nbsp;Bhautik Joshi and&nbsp;David Shapiro of Adobe and Starlight Studios, respectively, speak to the challenges of trying to reign in style transfer for controlled use. The team&rsquo;s approach comes off a bit like blindfolded dart-throwing, but, to be fair, the&nbsp;trial and error process and dealing with trade-offs is pretty much what machine learning research is like at all levels.\nOne would almost expect that artists and movie-makers would be more comfortable with improvisation than researchers, but this doesn&rsquo;t seem to be the case. &ldquo;In a production setting, however, a great deal of creative control is needed to tune the result, and a rigid set of algorithmic constraints run counter to the need for this creative exploration,&rdquo; note the authors of the paper.\n\n\n\n\nThis isn&rsquo;t the first time that style transfer has been used for artistically expressive purposes. Some in the research&nbsp;community were quick to point out that a paper was written recently about the movie Interstellar. And on the other side of the table, style-transfer techniques have been used&nbsp;for lower-profile&nbsp;artistic videos in the past.\nThe prospect is none-the-less interesting and it&rsquo;s likely we will see more of style transfer and machine learning in general in film making. Machines&nbsp;have already produced music, movie trailers&nbsp;and scripts. So while it seems like humans still remain on top, just ask yourself, how long is it until machines can create something better than [insert your favorite bad movie here].",
                "fallback": "TechCrunch Link: Kristen Stewart co-authored a paper on style transfer and the AI community lost its&nbsp;mind",
                "from_url": "https:\/\/techcrunch.com\/2017\/01\/19\/kristen-stewart-co-authored-a-paper-on-style-transfer-and-the-ai-community-lost-its-mind\/",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/techcrunch-2013\/assets\/images\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1491418681.221802"
    },
    {
        "type": "message",
        "user": "U1ZG1UCAK",
        "text": "<https:\/\/arxiv.org\/pdf\/1701.04928v1.pdf>",
        "ts": "1491418701.228941"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "<https:\/\/www.wired.com\/2017\/04\/building-ai-chip-saved-google-building-dozen-new-data-centers\/>",
        "attachments": [
            {
                "service_name": "WIRED",
                "title": "Building an AI Chip Saved Google From Building a Dozen New Data Centers",
                "title_link": "https:\/\/www.wired.com\/2017\/04\/building-ai-chip-saved-google-building-dozen-new-data-centers\/",
                "text": "Google has detailed its TPU---and the tremendous savings that came with it.",
                "fallback": "WIRED: Building an AI Chip Saved Google From Building a Dozen New Data Centers",
                "image_url": "https:\/\/www.wired.com\/wp-content\/uploads\/2017\/04\/GoogleChipHP-660x1014.jpg",
                "image_width": 163,
                "image_height": 250,
                "from_url": "https:\/\/www.wired.com\/2017\/04\/building-ai-chip-saved-google-building-dozen-new-data-centers\/",
                "image_bytes": 157737,
                "service_icon": "https:\/\/www.wired.com\/wp-content\/themes\/Phoenix\/assets\/images\/apple-touch-icon.png",
                "id": 1
            }
        ],
        "ts": "1491454841.991452"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "This speaks to evans' \"in the lifetime of a human\" comment from today's all hands",
        "ts": "1491454889.996178"
    }
]