[
    {
        "type": "message",
        "user": "U2DTF0B6Y",
        "text": "For those of you who have not taken Strength finders (the design team should not take this again, I will pull your results for the next pitch class). Please follow the directions below!",
        "ts": "1500590535.316385"
    },
    {
        "type": "message",
        "user": "U2DTF0B6Y",
        "text": "Please follow the instructions below to take the Clifton StrengthsFinder assessment and discover your strengths.\n\n1. Visit <https:\/\/www.gallupstrengthscenter.com\/Register\/en-US\/Index>\n2. Copy and paste the access code XD85KM32ES88CT55 into the available field, and then click Continue.\n3. Follow the onscreen instructions to create a Gallup Strengths Center account.\n4. Once registered, you will be able to take the Clifton StrengthsFinder assessment. Please give yourself 45 minutes of uninterrupted time to complete it. \n\nAfter you complete the assessment, I will be able to view your results to coach you in strengths development.",
        "attachments": [
            {
                "title": "Gallup Strengths Center",
                "title_link": "https:\/\/www.gallupstrengthscenter.com\/Register\/en-US\/Index",
                "text": "Everybody has strengths -- their unique combination of talents, knowledge, and skills. Strengths are the innate traits and abilities people use in their daily lives to complete their work, to relate with others, and to achieve their goals.",
                "fallback": "Gallup Strengths Center",
                "from_url": "https:\/\/www.gallupstrengthscenter.com\/Register\/en-US\/Index",
                "service_icon": "https:\/\/www.gallupstrengthscenter.com\/favicon.ico",
                "service_name": "gallupstrengthscenter.com",
                "id": 1
            }
        ],
        "ts": "1500590536.316727"
    },
    {
        "type": "message",
        "user": "U2DTF0B6Y",
        "text": "This will be great discussion for the next class.",
        "ts": "1500590560.323385"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "The questions change when I look at them without deciding for a bit... that is very interesting :dizzy_face:",
        "ts": "1500591640.626261"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "I'm excited to announce that AVERY has agreed to be our guest expert for our next class discussion on Teamwork. We should be kicking off the discussion around 8:40-9ish next class. Check out the blog post in the program doc and also the MBTI: <https:\/\/en.wikipedia.org\/wiki\/Myers%E2%80%93Briggs_Type_Indicator>",
        "attachments": [
            {
                "image_url": "https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/1\/1f\/MyersBriggsTypes.png\/1200px-MyersBriggsTypes.png",
                "image_width": 1200,
                "image_height": 675,
                "image_bytes": 488283,
                "title": "Myers–Briggs Type Indicator",
                "title_link": "https:\/\/en.wikipedia.org\/wiki\/Myers%E2%80%93Briggs_Type_Indicator",
                "author_name": "Wikipedia",
                "author_link": "http:\/\/en.wikipedia.org\/",
                "text": "The Myers–Briggs Type Indicator (MBTI) is an introspective self-report questionnaire claiming to indicate psychological preferences in how people perceive the world around them and make decisions.\nThe MBTI was constructed by Katharine Cook Briggs and her daughter Isabel Briggs Myers. It is based on the typological theory proposed by Carl Jung, who had speculated that there are four principal psychological functions by which humans experience the world – sensation, intuition, feeling, and thinking – and that one of these four functions is dominant for a person most of the time. The MBTI was constructed for normal populations and emphasizes the value of naturally occurring differences. \"The underlying assumption of the MBTI is that we all have specific preferences in the way we construe our experiences, and these preferences underlie our interests, needs, values, and motivation.\"\nAlthough popular in the business sector, the MBTI exhibits significant psychometric deficiencies, notably including poor validity (i.e. not measuring what it purports to measure) and poor reliability (giving different results for the same person on different occasions). The four scales used in the MBTI have some correlation with four of the Big Five personality traits, which are a more commonly accepted framework.",
                "fallback": "wikipedia: Myers–Briggs Type Indicator",
                "service_icon": "https:\/\/a.slack-edge.com\/bfaba\/img\/unfurl_icons\/wikipedia.png",
                "id": 1
            }
        ],
        "ts": "1500595381.549423"
    },
    {
        "type": "message",
        "user": "U02F8TTPU",
        "text": "Can't wait to hear your thoughts next week! :pray::skin-tone-2:",
        "edited": {
            "user": "U02F8TTPU",
            "ts": "1500596273.000000"
        },
        "ts": "1500595479.571212"
    }
]