[
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "Drizly unveils 'industry first' data hub\n \nSource: The Spirits Business\nby Annie Hayes\n26th July, 2017\n \nOn-demand alcohol delivery service Drizly has created an online hub that provides \"unprecedented intelligence\" on emerging trends, pricing and product movement, called Drizly Data Distillery.\n \nLaunched today, Drizly Data Distillery presents aggregated e-commerce data from transactions facilitated by Drizly's platform over the past four years, along with relevant insights and analysis, \"to better inform strategy and marketing decision-making\".\n \nBy analysing raw data from millions of orders in 70 cities across the US and Canada, suppliers will be able to compare the price of their products neighbourhood by neighbourhood and assess the effectiveness of their promotional campaigns with ease.\n \n\"The pace of change now is faster than ever before,\" Justin Robinson, Drizly co-founder, told The Spirits Business. \"Without relentlessly analysing customer data, companies in every industry will cease to exist in five years.\n \n\"We spend every day analysing our early adopter, trend-setting customer base to quickly adapt our product to meet their needs. We think it's important that we share those insights with all three tiers of the industry so they too understand how the consumers of tomorrow operate today.\"\n \nInsights from the website, which is accessible to everyone, will be relevant for \"the largest multi-national distillers, the smallest craft brewers, and everyone in-between\", Robinson said .\n \n\"The information contained in the Data Distillery shows category trends that could inspire an up-and-coming distillery as they think about a new product to develop and could assist in any supplier's pricing strategy, big or small,\" he explained.\n \nThe Data Distillery also enables suppliers to discover consumers' preferences first hand, enabling suppliers to keep up-to-date with continuously-evolving trends.\n \n\"Consumers vote with their wallets, and what they buy in terms of alcohol is directly represented in the Data Distillery's insights and findings,\" Robinson said.\n \n\"Because of the three-tiered system, suppliers rarely have visibility into the buying habits of consumers, specifically early adopting millennial consumer, on the ground.\n \n\"This access to the preferences of the trend-setting customer base will help suppliers innovate and adapt to what the consumer wants. This is increasingly important as e-commerce is the fastest growing channel in the industry.\"\n \nUltimately, he said, the Data Distillery will help the industry \"become even more customer-centric\" as it presents \"a 360 degree view\" of consumers buying habits.\n \n \"Instead of relying on survey data, we are excited to see the industry embrace the idea of understanding the consumer's actual purchase frequency, their bundles, their preferences, and their price-sensitivity based off of actual transactions,\" he added.\n \n\"The hope is for the industry to move toward making more data-driven decisions based on consumer preferences that will ultimately benefit the consumer.\"\n \nNicole Portwood, VP brand marketing at Tito's Handmade Vodka, added: \"Drizly not only brings us closer to the consumer point of purchase than ever before, it also opens up a rich trove of data that helps us understand our fans in a way we never have before.\n \n\"Through our partnership, we've discovered new and exciting opportunities in both sales and marketing. Unlike some other research products, the Drizly offering is highly actionable and has led to some first-of-its-kind programming for our brand.\"",
        "ts": "1501169840.297845"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "i shamefully adore their name.",
        "ts": "1501171918.556971"
    },
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "Fo shizly",
        "ts": "1501174096.757300"
    }
]