[
    {
        "type": "message",
        "user": "U07KCCF0V",
        "text": "Diageo  (DGE LN):  50% Upside from Being More Like Reckitt\n \nSource: Jefferies International Limited\nEdward Mundy, ACA\nJune 19, 2017\n \nRating  BUY\nPrice Target 2,800.00p (from  2,600.00p)\nPrice 2,341.50p\nADR Rating BUY\nADR Price Target $142.25 (from  $134.00)\nADR Price $121.74\n \nKey Takeaway\nDiageo is a change story with catalysts provided by new chairman Javier Ferran and by the perceived threat of 3G. If Ferran truly wants Diageo to be best-in-class then he needs to make it more like Reckitt. Our scenario analysis suggests 50% upside if he succeeds. Trading on 10% discount to global consumer, the market is ascribing zero value for a change story. Reiterate BUY.\n \nReckitt provides an interesting case study: Both operate in the most attractive sub-categories within staples but RB 12 year TSR is more than double DGE. We believe Ferran's vision is to nurture Diageo's existing strength in marketing and creativity while bringing in some RB-like best practice around costs, agility and incentives. Under this scenario we see £36 a share as possible, or 50% upside to the current share price.\n \nWhy Change? Ferran and 3G: 1) Javier Ferran is the primary catalyst. He is an energetic, hands-on industry heavyweight with spirits and private equity experience, and great ambition, we believe, for Diageo. 2) Greater urgency is provided by the perception that 3G are lurking in the shadows. From 3G we detect an increasing focus on top-line potential to marry with their abilities to run a business harder. See p. 62 - 66.\n \nHow to Change? Learnings from RB: We see Ferran targeting 1) costs 2) agility 3) incentives. Important to deliver a more aggressive cost agenda, increasing speed of decision-making and local accountability through delayering, accompanied by a more aggressive RB-like incentivisation structure so they move from merely 'acting like owners' to actually BEING owners. See p. 39 - 61.\n \nValue from Change. 800p additional value: If Diageo can close the performance gap vs RB, we estimate incremental upside of 800p p\/share, over and above our 2800p PT. This is split 400p from stronger revenue growth and 400p from stronger margin improvement.This is 50% ahead of the current share price. See p. 11 - 38 for detailed financial and non-financial benchmarking.\n \nWhat's changed? We increase our PT from 2600p to 2800p. This reflects a 1% upgrade due to FX and faster med-term growth in our DCF. At 2800p, the stock would trade at a modest premium to global staples, a premium we believe would start to build as the change story becomes visible.\n \nValuation\/Risks\nOur 2800p PT is derived from a 10-year DCF. The stock currently trades at a 10% discount to global consumer at (19.5x vs 21.8x) and we believe the market is ascribing zero value for a change story. Risks 1) macro 2) fx 3) excise \/regulation.",
        "ts": "1497973409.817714"
    }
]