[
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Another change in direction for winter lights <@U02F8LF2X> and <@U02E3CRMA> are you around to discuss today?",
        "ts": "1481734920.000031"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "I'll be in around 10.",
        "ts": "1481734967.000032"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Tl;dr DuPont already marketed their involvement with wlf and zgf now feels we have to do _something_.  We can discuss. ",
        "ts": "1481734973.000033"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "Oh snap",
        "ts": "1481734980.000034"
    },
    {
        "type": "message",
        "user": "U0H4SJN11",
        "text": "I'll be around for sure. Interested in what's going on. ",
        "ts": "1481734981.000035"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "I think it'd be cleanest if <@U02F8LF2X> could join us. I'll schedule around his avail (he's ooo) as he's got the best understanding of what he was planning to do against any potential pivots or reductions. ",
        "ts": "1481735042.000036"
    },
    {
        "type": "message",
        "user": "U02F8LF2X",
        "text": "Schedule something and I'll come in",
        "ts": "1481735500.000037"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<@U02F8LF2X> = rockstar. Will FWD something for digestion in adv",
        "ts": "1481735579.000038"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "COntext for group.  We’l discuss in our meeting:\n\nDuPont wants us to do something – anything – they’ve already marketed our collaboration… I talked with them yesterday afternoon after they responded to my email informing our decision to hold off on the project until after PWLF.\nWe’re scrambling to understand what we might be able to do and respond appropriately. I do think we had wanted to prototype the interactivity system – touch, light animation, sound modulation, etc, and to do that we would be providing you a series of Corian touch pods. If we can make those this year (!) and have January to prototype the interaction they I do think a much simpler, paired down version of the installation could take form in time for the Light Festival. Conceptually I could imagine it being a series of mostly vertical Corian ribbon pieces with LED strips behind them, maybe 15-20 of them ranging in size from 2’ to 6’ tall, with the ones on either end having a bend at the top and an encapsulation of the touch pod at podium level (ie, obvious you should touch it) – Everything could be staked into the ground.\n \nLove you and your teams thoughts. If we think this is doable, and affords the motivation we need to have a fully prototyped demo of the interaction, then we could consider this an ideal ‘teaser’ to the larger fabrication initiative that would incorporate the same basic electronic system with (hopefully) only minor retrofitting. I would think the larger system would just use more LEDs and obviously constitute a much larger construction – which would happen through us after the light festival.",
        "ts": "1481736074.000039"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "yo lets meet in library instead",
        "ts": "1481743552.000040"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "<!here|@here> my synthsis of what we discussed:",
        "ts": "1481747220.000041"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "Our primary contribution remains the same in that we'll work with the Corian touch panels to trigger light\/sound affects\nLight would be handled by ddd.  We'd communicate via OCP communication.\nSound provided by Megan\nWe'd look to ZGF to update the design (though we get what you're describing conceptually) as a stating point.  I think for feasibility and experiential reasons it'd be best to limit the touch points to 2-4 total.  Can you incorporate these into the design?\n\nWith 2-4 points for interaction, perhaps it's best to think about the music and light affects divided into four layers that allow for amplification as guests interact.  To help ground this conversation, maybe Elise from our team can write some rules around the interaction to craft the music and light experience around.  \n\nSound good? \n\nIf so assumptions and dependencies include:\nUCS to talk to ddd about OCP communication and ensure our touch registration triggers their lighting animation +music.  We're not planning to write software that triggers that animation we're just passing the touch registration along\nZGF to produce the touch panels\nZGF to design the structure\nZGF to work with PPP to craft the music\nIn person team re-group w\/o Jan 2\nPlan to meet weekly",
        "ts": "1481747220.000042"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "accurate\/fair?",
        "ts": "1481747226.000043"
    },
    {
        "type": "message",
        "user": "U0XJFPSRL",
        "text": "Sounds great to me. I’ve been working on Compass stuff today and yesterday so haven’t done that write up yet, but goal is by EOW",
        "ts": "1481749700.000044"
    },
    {
        "type": "message",
        "user": "U0ML49XU0",
        "text": "appreciate that",
        "ts": "1481750039.000045"
    }
]