[
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "RE: tweaking the animations for the tower in the ZGF office, I would love to explore how hard would it be to give them an interface to “design” their own animations. Could be as simple as a web app running on a RPI with basic tweening controls or something of that sort.",
        "ts": "1455910686.000012"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Interesting thought. What do you think an “out of thin air” estimate for something like that might be?",
        "ts": "1455911015.000013"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Can’t speak for Miguel’s part but it shouldn’t take more than 1-2 days to do a quick implementation for my side of things.",
        "edited": {
            "user": "U02618EV1",
            "ts": "1455911309.000000"
        },
        "ts": "1455911228.000014"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Cool! That’d be pretty rad.  Before we offer something like that up, we should probably gauge whether we would be down for a small engagement to do it or some form of trade?",
        "ts": "1455911395.000016"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "Absolutely, I know that for now we want to hear what their creative would like us to do and see it’s going to be a quick update.",
        "ts": "1455911507.000017"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "Awesome!",
        "ts": "1455911539.000018"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Ooh. I didn't realize we'd have one in lobby moving forward. That's awesome. ",
        "ts": "1455912865.000019"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Selfishly because I also want a controlled environment to shoot in. ",
        "ts": "1455912901.000020"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "And in March we'll be able to shoot 4k ",
        "ts": "1455912934.000021"
    },
    {
        "type": "message",
        "user": "U02618EV1",
        "text": "What? WOW!",
        "ts": "1455912945.000022"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Area idea: we have one in our office",
        "ts": "1455912962.000023"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "New toys coming in March. ",
        "ts": "1455912984.000024"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Maybe awful idea, but might a light sculpture look nice above 3rd floor hole? Have ability to be solid continued light vs all animated ",
        "ts": "1455913105.000025"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Or could be the best idea! Who knows? ",
        "ts": "1455913158.000026"
    },
    {
        "type": "message",
        "user": "USLACKBOT",
        "text": "¯\\_(ツ)_\/¯",
        "ts": "1455913158.000027"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "<@U0265G76F>: already brainstorming a wall-mounted art piece, and then talked with someone last week who is a glass artist who had played with LEDs inside blown glass tubing. We could partner with a local glass artist to build a piece, then illuminate with a system that could take lighting modes from and Interactive Spaces stack.",
        "ts": "1455913430.000028"
    },
    {
        "type": "message",
        "user": "U0H4SJN11",
        "text": "I am able to deploy code whenever. Just would be good to get everyone together. ",
        "ts": "1455913434.000029"
    },
    {
        "type": "message",
        "user": "U02E3CRMA",
        "text": "Would give us a chance to show off some of the stuff we’re going to do for BrandLab without having to disclose it.",
        "ts": "1455913465.000030"
    }
]