[
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "<https:\/\/techcrunch.com\/2017\/06\/16\/object-detection-api\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "Google releases new TensorFlow Object Detection API",
                "title_link": "https:\/\/techcrunch.com\/2017\/06\/16\/object-detection-api\/",
                "author_name": "John Mannes",
                "thumb_url": "https:\/\/i2.wp.com\/tctechcrunch2011.files.wordpress.com\/2017\/06\/image1.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 133,
                "text": "Google is releasing a new TensorFlow object detection API to make it easier for developers and researchers to identify objects within images. Google is trying to offer the best of simplicity and performance &mdash; the models being released today have performed well in benchmarking and have become regularly used in research.\nThe handful of models included in the detection API include heavy duty inception-based convolutional neural networks and streamlined models designed to operate on less sophisticated machines &mdash; a MobileNets single shot detector comes optimized to run in real-time on a smartphone.\nEarlier this week Google announced its MobileNets family of lightweight computer vision models. These models can handle tasks like object detection, facial recognition and landmark recognition.\nToday&rsquo;s smartphones don&rsquo;t possess the computational resources of larger scale desktop and server-based setups, leaving developers with two options. Machine learning models can run in the cloud, but that adds latency and requires an internet connection &mdash; non-starters for a lot of common use cases. The alternative approach is simplifying the models themselves, making a trade-off in the interest of more ubiquitous deployment.\nGoogle, Facebook and Apple have been pouring resources into these mobile models. Last fall, Facebook announced its Caffe2Go framework for building models to run on smartphones &mdash; the first big implementation of this was Facebook&rsquo;s Style Transfer. This spring at I\/O, Google released TensorFlow lite, it&rsquo;s version of a streamlined machine learning framework. And most recently at WWDC, Apple pushed out CoreML, its attempt to reduce the difficulty of running machine learning models on iOS devices.\nOf course Google&rsquo;s public cloud offerings give it differentiated positioning with respect to both Facebook and Google, and it&rsquo;s not new to delivering computer vision services at scale vis-&agrave;-vis its Cloud Vision API.\nToday&rsquo;s TensorFlow object detection API can be found here. Google wants to make it extra easy to play with and implement so the entire kit comes prepackaged with weights and a Jupyter notebook.",
                "fallback": "TechCrunch Link: Google releases new TensorFlow Object Detection&nbsp;API",
                "from_url": "https:\/\/techcrunch.com\/2017\/06\/16\/object-detection-api\/",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/techcrunch-2013\/assets\/images\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1497644267.058151",
        "reactions": [
            {
                "name": "nail_care",
                "users": [
                    "U13GPDA1F"
                ],
                "count": 1
            }
        ]
    }
]