[
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "<http:\/\/lewisandquark.tumblr.com\/post\/159363915392\/new-dd-magic-spells-designed-by-neural-network>",
        "attachments": [
            {
                "service_name": "Postcards from the Frontiers of Science",
                "title": "New D&amp;D magic spells, designed by neural network",
                "title_link": "http:\/\/lewisandquark.tumblr.com\/post\/159363915392\/new-dd-magic-spells-designed-by-neural-network",
                "text": "I’ve trained this open-source neural network framework on a variety of datasets, including recipes, Pokemon, knock-knock jokes, and pick up lines.  Here’s the latest: a list of 365 different spells you can cast in Dungeons and Dragons.  It’s a really small dataset, actually - so small that in almost no time at all, it learned to reproduce the original input data verbatim, in order. But by setting the “temperature” flag to a really high value (i.e. it has a higher chance of NOT going with its best guess for the next character in the phrase), I can at least induce spelling mistakes. Then the neural network has to try to recover from these, with often entertaining results. I give you: D&amp;D magic spells, designed by neural network Moss Healing Word Hold Mouse Barking Sphere Heat on Farm True Steake Finger of Enftebtemang Fomend’s Beating Sphere Purping Lightsin Farming Wrathful Hound Q’s Invisibility Cow of Auraly Mind Blark Stone Share Puijune Magic Furs Grove of Plants Conjure Velemert Vicious Markers End Wall Mous of Farts Cursing Gland Growth",
                "fallback": "Postcards from the Frontiers of Science: New D&amp;D magic spells, designed by neural network",
                "from_url": "http:\/\/lewisandquark.tumblr.com\/post\/159363915392\/new-dd-magic-spells-designed-by-neural-network",
                "service_icon": "http:\/\/68.media.tumblr.com\/avatar_87ba58d63414_128.png",
                "id": 1
            }
        ],
        "ts": "1494448085.522970"
    }
]