[
    {
        "type": "message",
        "user": "U0MKH0BE0",
        "text": "<http:\/\/nerdist.com\/see-the-game-of-thrones-intro-made-entirely-of-paper\/>",
        "attachments": [
            {
                "service_name": "Nerdist",
                "title": "See the GAME OF THRONES Intro Made Entirely of Paper | Nerdist",
                "title_link": "http:\/\/nerdist.com\/see-the-game-of-thrones-intro-made-entirely-of-paper\/",
                "text": "The recognizable opening of Game of Thrones just got a makeover, as Moleskine commemorates the premiere of the sixth season with their own version of the riveting title sequence. Westeros comes to life as a paper version of King’s Landing is recreated with more than 7,600 individual paper cutouts, complete with turning cogs and gears. Delicate turrets and spires magically start to move until the fortress retreats, leaving you with a peek of the new Game of Thrones Limited Edition Collection notebooks from Moleskine. Paper Epicness. Moleskine &amp; Game of Thrones from Moleskine ® on Vimeo. Designed by Levente Szabò, the notebooks give homage to the Stark, Lannister, and Targaryen families, and are also available with a collector’s edition box featuring the Iron Throne. A Targaryen offering made of paper seems like a dangerous one. Those house dragons have awfully fiery tempers. A Lannister always pays his debts, and these hardcover notebooks are a good place to keep track of who is on",
                "fallback": "Nerdist: See the GAME OF THRONES Intro Made Entirely of Paper | Nerdist",
                "image_url": "http:\/\/nerdist.com\/wp-content\/uploads\/2016\/04\/GoT-Moleskine-04142016.jpg",
                "ts": 1461236433,
                "from_url": "http:\/\/nerdist.com\/see-the-game-of-thrones-intro-made-entirely-of-paper\/",
                "image_width": 485,
                "image_height": 250,
                "image_bytes": 100201,
                "service_icon": "http:\/\/nerdist.com\/wp-content\/themes\/Legendary_Network\/img\/appletouch-114x114.jpg",
                "id": 1
            }
        ],
        "ts": "1467854310.000002"
    }
]