[
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "My buddy Ryan is organizing a series of concerts that will benefit a number of progressive non-profits in the coming months. First show is at Bunk Bar on 1\/20. <https:\/\/showuppdx.com\/blog\/2016\/12\/17\/announcing-show-up-pdx>",
        "attachments": [
            {
                "service_name": "SHOW UP PDX",
                "title": "Announcing SHOW UP PDX",
                "title_link": "https:\/\/showuppdx.com\/blog\/2016\/12\/17\/announcing-show-up-pdx",
                "text": "Portland, Oregon - Wednesday, January 4, 2017 - As America braces for a disastrous new administration to take power in Washington, D.C., Portland artists are banding together to raise money through a series of benefit shows for non-profit organizations and legal defense funds that will fight the oppressive, ignorant policies being planned at the federal level. Calling the series SHOW UP PDX, each month a special benefit show will donate 100% of ticket sales to a select organization. The first of these shows is planned for Friday, January 20 (Inauguration Day) with Candace and SKULL DIVER at Bunk Bar benefiting the Center for Reproductive Rights. Future shows include Natasha Kmeto, Genders, Maze Koroma, and Paper Brain and will benefit organizations like NAACP Legal Defense and Education Fund, ACLU Oregon, Lambda Legal and others. \"Seeing so many talented artists want to be a part of this series has been encouraging,\" says organizer Ryan Stively. \"Community support is more important now than ever. We know it's a small effort and that so much more needs to be done, but hope our contributions will help resist the bigotry coming from the the far-right.\" SHOW UP PDX is sponsored by Banana Stand, Bunk Bar, and Eleven PDX Magazine. Tickets for each concert are just $10 and available in advance at <http:\/\/showuppdx.com|showuppdx.com> or at Bunk Bar on the day of the show. Media contact: Aaron Colter; <mailto:aaron@bananastandmedia.com|aaron@bananastandmedia.com> ###",
                "fallback": "SHOW UP PDX: Announcing SHOW UP PDX",
                "from_url": "https:\/\/showuppdx.com\/blog\/2016\/12\/17\/announcing-show-up-pdx",
                "service_icon": "https:\/\/showuppdx.com\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1483638267.000002",
        "reactions": [
            {
                "name": "heart",
                "users": [
                    "U0J6TE0CA"
                ],
                "count": 1
            }
        ]
    }
]