[
    {
        "type": "message",
        "user": "U030TQFR3",
        "text": "<!channel>: Team, Matt is going to kick out a version of the deck that should account for all current changes in the google doc. This deck will be our new master -- please base all feedback off of it, and from here on out any edits should be sent via email to Matt (cc me, please).",
        "ts": "1421270615.000002"
    },
    {
        "type": "message",
        "subtype": "file_share",
        "text": "A file was shared",
        "file": null,
        "upload": false,
        "ts": "1421273191.000003"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Still need: \nPage 21: Content Phase summary paragraph\nPage 24: Bios for partners\nPhoto for Ben!",
        "ts": "1421273247.000004"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "shit - forgot ben photo",
        "ts": "1421273347.000005"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "i'm on that",
        "ts": "1421273353.000006"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "<http:\/\/payload40.cargocollective.com\/1\/1\/45400\/3100954\/2012-03-11-161552.gif>",
        "attachments": [
            {
                "from_url": "http:\/\/payload40.cargocollective.com\/1\/1\/45400\/3100954\/2012-03-11-161552.gif",
                "fallback": "468x560px image",
                "image_url": "http:\/\/payload40.cargocollective.com\/1\/1\/45400\/3100954\/2012-03-11-161552.gif",
                "image_width": 468,
                "image_height": 560,
                "image_bytes": 906387,
                "id": 1
            }
        ],
        "ts": "1421273392.000007"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "will work on 21 and 24 after this call",
        "ts": "1421273508.000009"
    },
    {
        "type": "message",
        "subtype": "file_comment",
        "text": "A file was commented on",
        "file": null,
        "comment": null,
        "ts": "1421277138.000010"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "you can post here",
        "ts": "1421277149.000011"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "On page one, an edit for better flow:",
        "ts": "1421277389.000012"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "lay it on me",
        "ts": "1421277584.000013"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "I'm working on it, sorry.  Give me a few mins.",
        "ts": "1421277637.000014"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Uncorked Studios is a collective of creators. We build devices, systems, experiences, and the stories of the brands we partner with, and we do it for non-profits, startups and innovation teams at the world’s largest companies. \nThis range of skills means we use everything from code to industrial design to strategy to brand identity when bringing a technology concept to life. It’s also what makes us feel that Point 97’s mission and request to us aligns perfectly with the element we value most - aspiring to use technology and design to further a purpose that is larger than ourselves. \nPoint 97 is incredibly unique because it sits at the intersection of a non-profit organization, a startup and an innovation team. That makes our experience across those three industries incredibly relevant for the task ahead.",
        "ts": "1421277866.000015"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Page two tweaking:",
        "ts": "1421280016.000016"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "In 2011, we co-founded Safecast, the world’s largest source of independent radiation data. That project taught us how to work in an ad hoc network of hardware, software, and open data volunteers for a purpose larger than ourselves, fundamentally shaping our company’s process and fueling our ambitions.\nTrapit, a content curation startup from Palo Alto, first approached our team to design and build a consumer-facing iPad app. That launch, along with business strategy, product development, and brand development, solidified a long term relationship with Trapit that has since seen Series B funding, an acquisition, and a full pivot to a B2B curation platform. Being part of all these phases has taught us how to build for short term needs while adapting for long term goals that may shift over time – hallmarks of every startup’s growth.\nMore recently, we partnered with the Bezos Family Foundation on an early childhood learning initiative. That project started with research from leading neurobiologists and child behavioral psychologists. <http:\/\/IDEO.org|IDEO.org> transformed that research into a set of guiding principles, upon which we built a product called Vroom. Earlier this year, the app was demoed at the White House as part of their effort to foster education amongst disadvantaged communities. \nLast, and the opposite of least, is Samsung whose Product Innovation Team first worked with us in 2012 to design the interface of an internet-connected future camera. Since then, we have designed and built a number of projects, ranging from home automation products to smart kitchens to wearable tech. In building prototypes for these products, Uncorked has led the industrial design, hard and software design, prototype development, and the integration of the overall system into the daily lives of their intended audience.",
        "ts": "1421280019.000017"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Page 11 tweak:",
        "ts": "1421280418.000018"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "We believe Point 97 is faced with a need to create a well-designed, disruptive product based upon a rock solid business strategy, then tell that story to the world. We also recognize that this project requires a careful balance between short term startup needs and the considered thoughtfulness and measured growth that is often the hallmark of work within the non-profit space. \nWith that in mind, we’ve structured an engagement that can be flexible and pivot as Point 97’s needs inevitably change over time.",
        "ts": "1421280644.000019"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Random comment - I don't know how intentional the fishing iconography is (like the lighthouse icon for the \"discovery\" section or the rope photo for \"modes of engagement) but I noticed it and liked it.  I only bring it up because I was thrown by the use of the image of a life preserver ring on page 31 for \"appendix.\"  But maybe I just smoked too much week in HS.",
        "ts": "1421281325.000020"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Last thing from me is my \"bio\" sentence (it's long, but it is one sentence): Rob has spent 15+ years in America’s most celebrated advertising agencies creating award-winning work for Apple, Volkswagen, Nike, Netflix, Coca Cola, HP, Burger King, Target and dozens of other respected and admired brands.",
        "ts": "1421281950.000021"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Modest, I know.",
        "ts": "1421281965.000022"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Marce wrote something for everyone's bio that speaks to the possible roles of the project, so we're covered. Also, I wish I could've come up with fishing stuff for every icon. Maybe for the final draft. ",
        "ts": "1421282787.000023"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "But ropes for Modes of Engagement was the most intentional. ",
        "ts": "1421282852.000024"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Hi everyone.  Apologies for going dark all night.  I only had one section I was hoping to do some editing on - Concept.  Do you want that within the Google doc or here?   Or do you even care?  For the record. I'm writing it in Word anyway, so I'll cut and paste wherever you want.",
        "ts": "1421304935.000002"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "hey Rob - sorry missed this earlier",
        "ts": "1421305380.000003"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "i've been putting any copy edits in the doc in red",
        "ts": "1421305389.000004"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "so cut and paste away",
        "ts": "1421305393.000005"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Saw that.  I'll cut and paste too, but in a another color.  Because I can.  And you can't stop me.  Well, until you make it whatever color you want in the PDF.  I'll have it pasted in there by the stroke of midnight (if not much sooner).",
        "ts": "1421305474.000006"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": ":fist:",
        "ts": "1421305500.000007"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": ":fish::tropical_fish::fish:",
        "ts": "1421305569.000008"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Or: :ship:+:fish:+:computer:=:heavy_dollar_sign:",
        "ts": "1421305759.000009"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "I lied.  I'm not gonna add my edits to the Google doc.  Too complicated.  Here's what I did with that copy (which I will put in a comment on the Google doc, so as not to overwrite the document that exists).  Here it is:",
        "ts": "1421306975.000010"
    },
    {
        "type": "message",
        "user": "U02F90CRQ",
        "text": "Our most successful product\/brand launch projects have one thing in common: the company narrative is seamlessly interwoven with the product narrative to create a single, strong brand identity.  Creating this synergy involves a few steps.\n\nTo start, we will work with the Point 97 team to refine the product messaging, the pitch, and the investment ask. As part of this “Brand Bootcamp” we’ll create the necessary design assets for collateral such as business cards, pitch decks, and style guides.\n\nAs the actual product is iterated upon, tested, and approaches its launch, we’ll revisit the branding components armed with an inevitably fresh perspective.  At this point we will collaboratively decide what communication elements need to be refined and optimized.\n\nDuring both phases, we will capture photos, videos, and other intermediary assets that will document the process of building the product and the brand simultaneously. Some of these may make their way to the website or to a case study video. Others might become the foundation to a unique concept that builds upon those assets. We will set aside resources to focus on the brand narrative and storytelling aspects to Point 97 and provide concepts for documentary video shoots, branding video, or other collateral. Many of these assets will prove useful as part of the go-to-market strategy for Point 97.",
        "ts": "1421306977.000011"
    }
]