[
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "*WHY*\nBecause the world reefs are dying, creating significant ecological and social impact to our world. In order to help create change, people need to be aware, engaged, and empowered with tools to help them move toward action. \n\nAlso… Autodesk is in the business of people understanding how 3-D rendering software can impact the world. In order to succeed as a business, they need to let the world know that their software has a greater purpose, and that can enable ALL PEOPLE to make a difference.\n\nFrom the Autodesk Foundation Design Principles:\n\nMASSIVE COLLABORATION - OPENING THE PROCESS\nCustomers, communities, suppliers, government, and other groups not traditionally involved at the design stage have valuable insights that can lead to better design outcomes. Today’s design tools make collaborating far more efficient, so sharing ideas and cocreating is easier than ever. Designers arrive at better solutions by opening up the process to include more voices at an early stage.\n\n\n*WHO*\nAt Uncorked Studios, we know how hard it is to educate, to engage, and to inspire people. We’ve dedicated our lives to it. We are not scientists, we are product people. We are not able to solve all of the world’s problems - and that's OK. But we can use our skills to help. \n\nSo let's do what we do best - we know how to understand how people use technology… and potentially empower them to change the world.\n\nBecause people are curious by nature. They are motivated to do good things, particularly if they are given good tools to do so.\n\n\n*HOW*\nAs a product company,  it is not for us to solve the world’s coral problem. There are people who have dedicated their careers to this pursuit. \n\nBut we can make products that make it possible for others to begin to tackle this challenge. And I’m pretty sure we can partner with Autodesk to make this happen.\n\nWe know (from an article last fall) that they have a challenge around enabling everyone with an iPhone\/Android\/GoPro\/etc to change the world by documenting the evolution of coral. They believe this is a software problem. Guess what? We are great at software problems! There is the technical challenge, but there is also an engagement challenge - getting people to understand, and motivate people to take action.\n\nIn addition, why don't we build and ‘productize’ a make-your-own-coral-kit - from concept to brand to execution! It could be used in classrooms, museums, maker spaces, and even homes… This is a really great way to engage kids (young and old) in the most wonderful kind of STEM!  Maybe it’s just a cool thing that goes on a shelf.  Maybe it’s a cool thing that people put in an aquarium.  Maybe it can be used in a science project for kids.  And maybe - just maybe - someday people drop them in the ocean, and coral polyps attach themselves to help renew our oceans and fishing ecosystems.\n\nIn addition… as a side benefit... we could help our potential client bring up a new generation of 3-D software nuts, who love the challenges and opportunities that this new technology provides.\n\n*NEXT STEPS*\n\nYou guys respond to this and tell me if it’s good\/useful\/horrible\/silly\n\nWork with client to see if that software challenge is still a challenge\n\nJames to synthesize our work from yesterday more formally, to help get us to a proposal phase.  (but all of your thoughts made the above possible.\n\nFigure out the ins\/outs of 3D Coral Making - material challenges\/opportunities.  Can we focus on the PNW or Cuban Reefs as a starting point (or maybe a contrast of them both) - to give us a framework to model both the technical challenges, assess impact (environmental\/economic), and give us a fun story to tell, whether or not it turns into a ‘thing’ ?",
        "ts": "1467306671.000002"
    },
    {
        "user": "U0DCXC37U",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U0DCXC37U|avery> has joined the channel",
        "ts": "1467307091.000003"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "^^ by the way, this language is not to be used for anything official. writing just helps me wrap my brain around things. it was how i synthesized the ideas i heard yesterday",
        "ts": "1467307729.000004"
    },
    {
        "type": "message",
        "user": "U1A1A9L7N",
        "text": "The write-up feels good <@U0914MEN7>! Covers the points",
        "ts": "1467308078.000005"
    },
    {
        "type": "message",
        "user": "U1HKQRLMR",
        "text": "This is a great synthesis! Really like the idea of the software solution and kits.",
        "ts": "1467309140.000006"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "I dig as well. ",
        "ts": "1467327407.000007"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "<https:\/\/www.instagram.com\/p\/BGCgfWryST5\/>",
        "attachments": [
            {
                "service_name": "Instagram",
                "title": "Instagram photo by Fishbit • May 30, 2016 at 5:07pm UTC",
                "title_link": "https:\/\/www.instagram.com\/p\/BGCgfWryST5\/",
                "text": "See this Instagram photo by @getfishbit • 37 likes",
                "fallback": "Instagram: Instagram photo by Fishbit • May 30, 2016 at 5:07pm UTC",
                "image_url": "https:\/\/scontent.cdninstagram.com\/t51.2885-15\/e35\/13257023_1025027660914749_1737154246_n.jpg?ig_cache_key=MTI2MTcxMzczNzc2NjIxNjk1Mw%3D%3D.2",
                "from_url": "https:\/\/www.instagram.com\/p\/BGCgfWryST5\/",
                "image_width": 200,
                "image_height": 250,
                "image_bytes": 200341,
                "service_icon": "http:\/\/instagramstatic-a.akamaihd.net\/h1\/images\/ico\/apple-touch-icon-76x76-precomposed.png\/932e4d9af891.png",
                "id": 1
            }
        ],
        "ts": "1467327411.000008"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "For the focus part - Florida Keys are likely more accessible and a proxy for Cuba (same species) and more accessible. ",
        "ts": "1467327471.000010"
    },
    {
        "type": "message",
        "user": "U0DCXC37U",
        "text": "Have you guys been to <http:\/\/www.calacademy.org|www.calacademy.org>",
        "ts": "1467340120.000011"
    },
    {
        "type": "message",
        "user": "U0DCXC37U",
        "text": "Was there a few years ago during a cool techy exhibit on deep reef sustainability",
        "ts": "1467340168.000012"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "I have not. Field trip?",
        "ts": "1467340433.000013"
    },
    {
        "type": "message",
        "user": "U026NB2U2",
        "text": "(or virtual field trip?)",
        "ts": "1467340440.000014"
    }
]