[
    {
        "type": "message",
        "user": "U2H61EJSG",
        "text": "<@U0U9WJB7F> There are still a few refinements I can make without having all of those questions answered and I still need to research a bit more as to what information can be shared with other others (such as photos, etc). I can probably also help Oliver with the user auth stuff or Midori with landscape layout changes, but if anything else pops up let me know!",
        "ts": "1496679467.052132"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "okay awesome, thanks Summer.",
        "ts": "1496679530.074231"
    },
    {
        "type": "message",
        "user": "U1ZG1UCAK",
        "text": "Is there a Sketch license key I could use? My trial expired",
        "ts": "1496692909.936130"
    },
    {
        "type": "message",
        "user": "U1ZG1UCAK",
        "text": "thanks melissa",
        "ts": "1496693603.174181"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": ":thumbsup::skin-tone-4:",
        "ts": "1496693611.176774"
    },
    {
        "type": "message",
        "user": "U13GPDA1F",
        "text": "oh hey team - looking through the notifications deck and realized that those notification mock ups 5-7 were done as placeholder by kat (not ustwo) :upside_down_face: this was her brief to us so re the question of if we should match these - these are for sure FPO (i know we had been thinking that already, but its probably worth noting that ustwo didnt miss the boat on this)",
        "ts": "1496710535.949788"
    },
    {
        "type": "message",
        "user": "U13GPDA1F",
        "text": "(similarly page 13 - just a kat mock up)",
        "ts": "1496710595.957069"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "yes we've been keeping that in mind!! wanted them to confirm when designs are 100% done ",
        "ts": "1496710997.011611"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "thank you for pointing it out ",
        "ts": "1496711011.013823"
    },
    {
        "type": "message",
        "user": "U13GPDA1F",
        "text": "okay - didnt realize they were working on designs for the notifications. im not sure we need more than what we have, as we talked about leveraging the default os notifications - but highly likely im missing something",
        "ts": "1496711282.048192"
    },
    {
        "type": "message",
        "user": "U13GPDA1F",
        "text": "(im just getting to look at this now so apologies if im late to the party)",
        "ts": "1496711316.052742"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "I'm definitely wanting to understand exactly what they are needing to be done to wrap this up and hoping to get that clairity tomorrow ",
        "ts": "1496712602.212246"
    }
]