[
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "FYI as a reminder I am OOO on vacation tomorrow. See y'all on Tuesday around 1pm.",
        "ts": "1497231754.576199"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "I’m confused about one of your ticket comments, but i’ll discuss it there",
        "ts": "1497233304.710501"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "I deleted it! Shouldn't be showin' up for ya",
        "ts": "1497233329.712509"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "I needed to re word it, sorry for the confusion.",
        "ts": "1497233350.714327"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "basically Andres (ustwo) is saying that the checkmark is animating correctly and that we are likely just looping it? He also gave us the background colors for each generator since they're different which was why you noticed that the most recent one was blue in stead of black... does that make sense?",
        "ts": "1497233856.757412"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "wait no",
        "ts": "1497234791.840787"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "the screen isn’t a stable color across generators?",
        "ts": "1497234804.842036"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "also, is there any way he can detail whats different _literally each time they send us an asset_",
        "ts": "1497235005.859094"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "Yeah it's making me feel a little crazy. I didn't realize that either and not sure that it's what we implemented or if we even knew that. Can I tell them we need to keep it one color?",
        "ts": "1497238798.196231"
    },
    {
        "type": "message",
        "user": "U0U9WJB7F",
        "text": "When I look at our deck that goes through each onboarding it looks the same, feeling a bit frustrated with them atm.",
        "ts": "1497238847.200560"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "we can discuss when you’re back, they’re just making no sense and if those screen colors aren’t consistent, then fuck it, bring the bg color back, i guess",
        "ts": "1497239120.224802"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": ":)",
        "ts": "1497239123.225084"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "Huge stack of crash reports just came in. ",
        "ts": "1497243391.608573"
    }
]