[
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<!channel> Hey folks! Canceling standup today because it feels a little overkill for this moment in the project. For now, the deck is in Care's hands and we're still waiting on a time we can call in to the board meeting on Thurs. other than that, having a tech call today to walk through dashboard logic. \n\nIf you have any questions, concerns, or status you'd like to share do so here or DM me. Thanks! ",
        "ts": "1497973654.348515",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U1S5GKTHQ",
                    "U4VTSDW7P",
                    "U0260V1BX"
                ],
                "count": 3
            }
        ]
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "<!channel> - Hey Team…  AMAZING NEWS… all of our hard work paid off, and now we get to build the thing(s)! It is obvious that the Care team has faith in the team here at Uncorked and we have all of you to thank for that. Over the coming couple of weeks we are going to be working hard to understand the scope of the work, the resources we will need, and the way we work with them moving forward!",
        "ts": "1497998936.874817",
        "reactions": [
            {
                "name": "raised_hands::skin-tone-3",
                "users": [
                    "U0914MEN7",
                    "U07KCCF0V",
                    "U026103R3",
                    "U026NB2U2",
                    "U4VTSDW7P",
                    "U06DFL7BP"
                ],
                "count": 6
            }
        ]
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "We may be pulling some of you in as we get organized for this next bit of work. We will be sharing with the studio more broadly on Friday when we have our Care 3.0 Launch celebration.  Holler with any questions you have, congrats, and thank you!",
        "ts": "1497998940.875532",
        "reactions": [
            {
                "name": "champagne",
                "users": [
                    "U0914MEN7",
                    "U07KCCF0V",
                    "U0XCJ372R",
                    "U026103R3",
                    "U4VTSDW7P",
                    "U1S5GKTHQ"
                ],
                "count": 6
            }
        ]
    }
]