[
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "hello friends. we heard back. (sigh)",
        "ts": "1471991110.000002"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "Hi James,\n\nThe delta was about $100k.  However  last week I learned that we now have a GTM partner for PAM and the current plan is that they will do the design refinement.  I am just back from vacation and working through the details so if gaps remain – I’ll be sure to reach out.  We are just kicking off discussions so if there are pieces we do need help with – I’ll be sure to reach out.  As Aaren said, we loved your team’s ideas and enthusiasm for the project.\n\nThanks to you, Lynsey and the team for the proposal and effort to date.  I hope we get the opportunity to work together in the future.\nKatie",
        "ts": "1471991113.000003"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "^^ cheers to all of you and thanks for your hard work, even if owls was not meant to be. :slightly_smiling_face:",
        "ts": "1471991143.000004"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "“design refinement\"",
        "ts": "1471991346.000005"
    },
    {
        "type": "message",
        "user": "U0K8ZSHN0",
        "text": "while this wasn’t meant to be, I believe we can all look back at work and feel proud of what we did for this proposal",
        "ts": "1471991376.000006"
    },
    {
        "type": "message",
        "user": "U13GPDA1F",
        "text": "i can’t wait to work with this team on something that is a better fit!",
        "ts": "1471993127.000007"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "bummer though, you all did a great job. loved that visual proposal. I just hope they keep these toys   s m a l l   !",
        "ts": "1471995861.000008"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "i still want to see the scary 3 foot wolf.",
        "ts": "1471996192.000009"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "But honestly will always have <@U0GN0A9EV>’s impersonation of it in my head, which is probably better anyway.",
        "ts": "1471996210.000010"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Bummed about the outcome though - and agree it was an extremely well-done pitch.",
        "ts": "1471996237.000011"
    }
]