[
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "<https:\/\/techcrunch.com\/2016\/08\/03\/intel-shows-off-mystery-depth-sensing-virtual-reality-accessory\/>",
        "attachments": [
            {
                "service_name": "TechCrunch",
                "service_url": "http:\/\/techcrunch.com",
                "title": "Intel shows off mystery depth-sensing virtual reality accessory",
                "title_link": "https:\/\/techcrunch.com\/2016\/08\/03\/intel-shows-off-mystery-depth-sensing-virtual-reality-accessory\/",
                "author_name": "Lucas Matney",
                "thumb_url": "https:\/\/i2.wp.com\/tctechcrunch2011.files.wordpress.com\/2016\/08\/screen-shot-2016-08-03-at-3-31-31-pm.png?fit=200%2C150&ssl=1",
                "thumb_width": 114,
                "thumb_height": 150,
                "text": "An Intel engineer just tweeted out a photo of a new VR sensor prototype and suggested that VR would play a large role in the company&amp;rsquo;s developer conference late this month.\nIn the since-deleted tweet, Dimitri&amp;nbsp;Diakopoulos, a senior prototyping engineer at Intel, showed off what he referred to as a depth-sensing prototype attachment for the HTC Vive. \nAt least visually, the sensor seems somewhat similar to the designs of previous Intel RealSense developer kits&amp;nbsp;that&amp;rsquo;s symmetrically designed with&amp;nbsp;six sensors tracking the area in front of the headset.\n\nIn a conversation with Upload VR,&amp;nbsp;Diakopoulos referenced possible use cases for the mystery device which was designed specifically for the HTC Vive virtual reality headset.\nHe told us an accessory like this could track hand movement as well as IR-tracked controllers. The system could also scan the environment in real-time. This opens up the potential to detect obstacles automatically.\nDepth-sensing as a tool for not running into things while in VR is interesting. The HTC Vive already has a small camera built into the headset which outlines objects in your immediate vicinity as a semi-transparent 2D image, but a sensor like this&amp;nbsp;could theoretically allow you to have a more AR-like&amp;nbsp;experience with the headset.\nThe other clear&amp;nbsp;use case would be tracking as a means of input. Leap Motion already has a developer kit out there which helps devs mount their sensor to the Vive and track user hand movement. It&amp;rsquo;s pretty great but there are some limitations with the scope of capture which works best when the hands are generally positioned right in front of the user.\nWe haven&amp;rsquo;t seen a ton of an emphasis on VR\/AR tech from Intel outside of a few RealSense developer kits so it&amp;rsquo;s interesting to see the company working directly with integrating their sensors onto consumer head-mounted displays.\nIntel was not immediately available for comment.",
                "fallback": "TechCrunch Link: Intel shows off mystery depth-sensing virtual reality&nbsp;accessory",
                "from_url": "https:\/\/techcrunch.com\/2016\/08\/03\/intel-shows-off-mystery-depth-sensing-virtual-reality-accessory\/",
                "service_icon": "https:\/\/s0.wp.com\/wp-content\/themes\/vip\/techcrunch-2013\/assets\/images\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1470266331.000031"
    },
    {
        "type": "message",
        "user": "U0914MEN7",
        "text": "heh",
        "ts": "1470266955.000033"
    },
    {
        "type": "message",
        "user": "U0B9N0HF0",
        "text": "<@U0914MEN7> you should talk to <@U026PHQ3J> about the prototype he is building for IDF. Could be a good conversation piece :) ",
        "ts": "1470267090.000034"
    }
]