[
    {
        "user": "U026PHQ3J",
        "text": "<@U026PHQ3J|evans> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1468377287.000002"
    },
    {
        "user": "U026PHQ3J",
        "purpose": "Virtual Inanity",
        "text": "<@U026PHQ3J|evans> set the channel purpose: Virtual Inanity",
        "type": "message",
        "subtype": "channel_purpose",
        "ts": "1468377287.000003"
    },
    {
        "user": "U051P3FPY",
        "inviter": "U026PHQ3J",
        "text": "<@U051P3FPY|kaitlyn> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1468377287.000004"
    },
    {
        "user": "U0914MEN7",
        "inviter": "U026PHQ3J",
        "text": "<@U0914MEN7|james> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1468377287.000005"
    },
    {
        "user": "U026E0ZNR",
        "inviter": "U026PHQ3J",
        "text": "<@U026E0ZNR|trent> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1468377287.000006"
    },
    {
        "user": "U0260V4K1",
        "inviter": "U026PHQ3J",
        "text": "<@U0260V4K1|justin> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1468377287.000007"
    },
    {
        "user": "U0265G76F",
        "inviter": "U026PHQ3J",
        "text": "<@U0265G76F|iamewald> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1468377287.000008"
    },
    {
        "user": "U1A1A9L7N",
        "inviter": "U026PHQ3J",
        "text": "<@U1A1A9L7N|leah> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1468377287.000009"
    },
    {
        "user": "U0EL0GLEL",
        "inviter": "U026PHQ3J",
        "text": "<@U0EL0GLEL|peter.bliss> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1468377287.000010"
    },
    {
        "user": "U0B9N0HF0",
        "inviter": "U026PHQ3J",
        "text": "<@U0B9N0HF0|rob> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1468377287.000011"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "Hello everyone. Welcome to the weird group I thought might want to shoot the shit on the coming trend of VR ",
        "ts": "1468377318.000012"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "It's not at our doorstep yet but it's on the block. ",
        "ts": "1468377331.000013"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "Please invite ppl or whatever. I'm gonna be posting links here ",
        "ts": "1468377362.000014"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": " <http:\/\/amzn.to\/29vUMpK>",
        "attachments": [
            {
                "title": "Amazon.com: Cardboard VR Projects for Android eBook: Jonathan Linowes, Matt Schoen: Kindle Store",
                "title_link": "http:\/\/amzn.to\/29vUMpK",
                "text": "Buy Cardboard VR Projects for Android: Read Books Reviews - <http:\/\/Amazon.com|Amazon.com>",
                "fallback": "Amazon.com: Cardboard VR Projects for Android eBook: Jonathan Linowes, Matt Schoen: Kindle Store",
                "from_url": "http:\/\/amzn.to\/29vUMpK",
                "service_icon": "https:\/\/www.amazon.com\/favicon.ico",
                "service_name": "amazon.com",
                "id": 1
            }
        ],
        "ts": "1468377377.000015"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "<@U0GN0A9EV>, <@U1A1A9L7N>, <@U0HPGQ4KH>",
        "ts": "1468378025.000017"
    },
    {
        "user": "U0HPGQ4KH",
        "inviter": "U0265G76F",
        "text": "<@U0HPGQ4KH|felix> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1468378034.000018"
    },
    {
        "user": "U0GN0A9EV",
        "inviter": "U0265G76F",
        "text": "<@U0GN0A9EV|ivan> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1468378034.000019"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "<@U02F8LF2X>",
        "ts": "1468379037.000020"
    },
    {
        "type": "message",
        "user": "U1A1A9L7N",
        "text": "Mmmm VR",
        "ts": "1468379057.000021"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "The daydream platform from Google seems to have a very good set of docs on 3d sound design ",
        "ts": "1468379105.000022"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "Will cough up link when nearer a computer ",
        "ts": "1468379116.000023"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "<https:\/\/developers.google.com\/vr\/>",
        "attachments": [
            {
                "service_name": "Google Developers",
                "title": "Google VR  |  Google Developers",
                "title_link": "https:\/\/developers.google.com\/vr\/",
                "text": "Google's suite of various VR platforms, aimed at allowing everyone to enjoy VR in a simple, fun, and natural way.",
                "fallback": "Google Developers: Google VR  |  Google Developers",
                "from_url": "https:\/\/developers.google.com\/vr\/",
                "service_icon": "https:\/\/developers.google.com\/_static\/373305fd95\/images\/touch-icon.png",
                "id": 1
            }
        ],
        "ts": "1468379347.000024"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "It's in there somewhere. (I didn't wait)",
        "ts": "1468379357.000026"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "I'm reading a lot about importing blender models to VR frameworks ",
        "ts": "1468379383.000027"
    },
    {
        "user": "U1HKQRLMR",
        "inviter": "U0914MEN7",
        "text": "<@U1HKQRLMR|megan.bauer> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1468379530.000028"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "Which is interesting. Most of my knowledge at this point stems from the opengl work that's happening on live case. It's all 2D at the moment, but the concepts for programming are similar ",
        "ts": "1468380017.000029"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "So I read and used the above linked book while on vacation to write some VR apps from scratch and they're ok! ",
        "ts": "1468380053.000030"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "So my head is near VR right now even tho I don't like\/trust it yet ",
        "ts": "1468380156.000031",
        "reactions": [
            {
                "name": "clap",
                "users": [
                    "U1HKQRLMR"
                ],
                "count": 1
            }
        ]
    },
    {
        "user": "U06DFL7BP",
        "text": "<@U06DFL7BP|charlesv> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1468380644.000032"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Crosspost but <http:\/\/aframe.io|aframe.io>",
        "ts": "1468380672.000033"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "I've been on the lookout for guides on moving from WebGL prototypes to full native implementations or at least frameworks that will support WebGL style shaders ",
        "ts": "1468380857.000034"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "gdx might do it with extensions. For shadertoy anyway. ",
        "ts": "1468380879.000035"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "A-frame seems neat cause its markup based god",
        "edited": {
            "user": "U026PHQ3J",
            "ts": "1468380911.000000"
        },
        "ts": "1468380893.000036"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Yeah I think more for prototyping or content only stuff ",
        "ts": "1468380957.000039"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "<http:\/\/blog.highfidelity.com\/blog\/2016\/6\/16\/keeping-vr-human>\n",
        "attachments": [
            {
                "service_name": "High Fidelity Blog",
                "title": "Keeping VR Human",
                "title_link": "http:\/\/blog.highfidelity.com\/blog\/2016\/6\/16\/keeping-vr-human",
                "text": "Howdy folks, Caitlyn Meeks here with the High Fidelity content team. Last night, I had the pleasure of sharing a presentation at NVIDIA with the Silicon Valley AR\/VR Women meetup to discuss some of the higher level challenges in VR, in general. To prepare, I spent a lot of time thinking about what I considered to be important for the future of virtual reality, and how High Fidelity fits into this vision. I think it might be interesting enough to warrant an abridged version here on our blog. It's a bit more media-theoretical than usual, so put on your Marshall McLuhan hat and read on. Initial interest in the art of computer graphics was driven more by novelty than content.. Reality is something that unfolds organically. Virtual reality needs to unfold in the same way. All of us--we are SO lucky. Lucky because we’re here at the right time and place, we get to be the ones who define the language, tone and purpose of a completely new medium. If we look back to some new media of the last century and a half, we see the emergence of photography, cinema, electronic music, computer animation. At first, these media are appreciated more for their novelty than form or content. Many media theorists credit Edwin Porter for creating the vocabulary and grammar of modern film making in his 1903 silent film, The Great Train Robbery.  The language of modern cinema was invented around 1903, some say, when Edison Studios director Edwin Porter made The Great Train Robbery. Some of this language spread into the public consciousness, and other artists began to experiment and set examples in storytelling through composition, editing, cinematic photography and dramatic sequencing. In The Battleship Potemkin, the great Sergei Eisenstein introduced sophisticated montage editing that you'll recognize in modern cinema.   The great opportunity that stands before us is that nobody, really, has nailed down the grammar of Virtual Reality. Sure, we’ve seen VR depicted in popular media, fiction and the news to the degree that some believe it has already happened. In these fictional worlds, VR is a masculine high-tech place where elite hacking wizards battle, compete, and courting ladies. With hard edges, weapons, megalomaniacal technical overlord antagonists. Usually VR is a secret alternative escape from a dark and shadowy dystopia. Does the adage ‘A map is not the territory it represents’ still hold true in VR? But it’s all make believe. Total fiction. The incredible reality is that this is OUR story. We get to write it. We get to author the truth of virtual reality. It’s us! How amazing is that? What an exciting time! To treat this opportunity with respect it deserves, we need to recognize our awesome responsibility: to make deep, beautiful, profoundly human VR experiences. We need to ask ourselves questions about this nature of this new medium. Questions that philosophers, media theorists, poets and thinkers have been asking for millennia about humanness, art, meaning, semantics.. Profound philosophical questions. Example: Alfred Korzbyski once wrote, \"A map is not the territory it represents\". For someone immersed in VR, is that is true anymore? With deep VR immersion, the line between the signifier and signified, the symbol and physical object, gets completely blurred in a way that is unique to other media. Perhaps it is this blurriness that promises the most profound medium in the history of humanities, for artists, poets, storytellers, educators. Presently, most new VR content is staged and rule-bound games. While they are immersive and can be terrific fun, are games are too constrained to put the reality in Virtual Reality? The 21st century’s first wave of VR content is largely producing numerous variants of existing, contemporary game mechanics. VR games. Some will be phenomenal fun. Others mediocrities. But one thing VR games will have in common, though, is a prescribed and staged interactive experience. While staged media like games can be terrific fun, they are tightly bounded and controlled worlds. By necessity, game designers set the boundaries and rules that define the terms of play. Games are micromanaged by a handful of clear cut rules. While a case can be made that reality is deterministic, to a degree, it is certainly far more wide open than any game. With openness, extensibility, and prioritizing human communication first, High Fidelity is perhaps one of the most human VR platforms today. The human spirit is a profoundly slippery, playful, shining entity which, although it may be entertained by occasional games as a diversion, dwells in an ocean of thought. We humans dance, appreciate beauty, argue, love, share, create, pretend, solve problems and tell stories. We are surprised, delighted, frightened, disappointed, shocked. We experience self deceit and introspection. These things are innately living and human. We do these things, we act this out, in reality. If we want to be human in VR, we need the space and scope to do the same. As I see it, the most important thing we must keep in mind while designing the future of VR is to facilitate humanness. Virtual Reality needs to be the place where we get to be more human, by lifting numerous constraints of the physical world, such as distance, visual perception, scale and economy.   The unique architecture behind High Fidelity is designed to facilitate both physical and verbal subtleties of human communication in a virtual world. We at High Fidelity are designing a VR platform to facilitate humanness from its very core. Instead of adding VR to a game engine or make a 3D chat room, we’ve written an extensible, distributed, completely open-source avatar-mediated multi-user virtual reality platform. Designed to accommodate any number of people in a distributed, decentralized, user operated universe of domains. Where the subtleties of body language, voice and human presence can be streamed together in real time. Together, with an HMD and hand controllers, we can dance, we can share objects and space together, we can talk, whisper, joke, explore and just be human together. Reality is something that unfolds organically. Virtual reality needs to unfold in the same way. We’re motivated by the changes we can make, the ways we can contribute and how we can touch other people. Similarly, we feel VR needs to be just as open. If you can’t change, manipulate and impress yourself upon the fabric of a reality, it’s not really much of a reality.   A painting by the great Chinese muralist, Wu Daozii There is a Daoist anecdote that sums up what we should be seeking in creating virtual reality. In the seventh century, during the Tang dynasty, the Chinese muralist Wu Daozi was hired by Emperor Xuanzong to paint a mural on his palace wall. The masterpiece was set in an idyllic Chinese countryside, with verdant mountains and meadows. At the foot of one of the mountains, he painted a cave with a temple gate.  The day the mural was revealed to the public, it was so beautiful that Daozi stepped into it, walked through the temple gate into the cave, where he chose to live surrounded by beauty.    ",
                "fallback": "High Fidelity Blog: Keeping VR Human",
                "thumb_url": "http:\/\/static1.squarespace.com\/static\/56d4f1beb6aa60b1224f5dc7\/56d4f31ce6515939a661bb1b\/5762ea9e03596e8dcd9684b6\/1467405388967\/Davinci-Human-Sketch.jpg?format=1000w",
                "from_url": "http:\/\/blog.highfidelity.com\/blog\/2016\/6\/16\/keeping-vr-human",
                "thumb_width": 1000,
                "thumb_height": 699,
                "service_icon": "http:\/\/blog.highfidelity.com\/favicon.ico",
                "id": 1
            }
        ],
        "ts": "1468381156.000040"
    }
]