[
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "<https:\/\/www.eventbrite.com\/e\/non-gaming-virtual-reality-meetup-6-ft-facebook-dolby-dysonics-subpac-tickets-27899271472?utm_source=eb_email&amp;utm_medium=email&amp;utm_campaign=order_confirmation_email&amp;utm_term=eventname&amp;ref=eemailordconf>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "Non-Gaming Virtual Reality Meetup #6 ft Facebook, Dolby, Dysonics &amp; Subpac",
                "title_link": "https:\/\/www.eventbrite.com\/e\/non-gaming-virtual-reality-meetup-6-ft-facebook-dolby-dysonics-subpac-tickets-27899271472?utm_source=eb_email&utm_medium=email&utm_campaign=order_confirmation_email&utm_term=eventname&ref=eemailordconf",
                "text": "Come for a night of demos and conversation at our sixth Non-Gaming VR meet-up. This will be an event for VR audio enthusiasts! If you're interested in demoing please sign-up via this link!Menu for the Evening 7:00-7:30- Doors open &amp; mingling7:30-8:30- Presentations from Facebook, Dolby, Subpac &amp; Dysonics8:30-9:30 PM - Explore demos!Exit space and continue at Forgery, the bar below UploadVR’s officeLight snacks and refreshments provided.Join the Non-Gaming VR Meetup here for notification of future events.DemosWe have 3 demo rooms with HTC Vives and Oculus CV1s for experiencing demos. If you’d like to bring and share a demo please sign up here and plan to arrive atleast 30 minutes early.SpeakersVarun Nair has spent over a decade in the audio industry and has worked on hundreds of projects across television, film, games and interactivity. He co-founded Two Big Ears, where he led development of spatial audio technology and tools and has been a frequent speaker VR and audio conferences. Two Big Ears was acquired by Facebook, where he is a technical lead on the 360 audio team.Ryan Origin - Head of Gaming and Interactive Audio (Presenting)\"Ryan Origin has forged a very unique path in audio and interactive technology since a very early age. Since experiencing the legendary Dactyl Nightmare over two decades ago, Ryan has been fascinated with Virtual Reality. His experience in the area of audio begun with experiments with analog synthesizers and MIDI in the 90s, followed by his work in video game production &amp; development, digital cinema, boutique professional audio technology, sound design and production, and as an Ableton Certified Trainer. This history and passion portrays that he is uniquely suited to help drive SubPac's work in the world of spatial audio for VR &amp; AR.\"DysonicsBob Dalton, Co-founder &amp; CTO of Dysonics, a company leading the way in immersive audio technology for VR and 360 media. Mr. Dalton received a Masters in Electrical Engineering from U.C. Davis where he researched various aspects of 3D sound capture and reproduction over headphones. He has over 15 years of experience managing and leading hardware and software engineering teams. Called the “future of sound technology” by Gizmodo, Dysonics is the first company to bring to market Bluetooth Smart motion sensors for enabling interactive 3D audio applications over headphones. In addition to building industry leading 360 binaural microphones, Dysonics develops software for spatial audio content creation, live broadcasting, and playback.Thank you to our hosts: UploadVR!",
                "fallback": "Eventbrite: Non-Gaming Virtual Reality Meetup #6 ft Facebook, Dolby, Dysonics &amp; Subpac",
                "image_url": "https:\/\/img.evbuc.com\/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F24507520%2F167526606504%2F1%2Foriginal.jpg?w=1000&rect=0%2C246%2C1000%2C500&s=b2bbfa25df5148eef4110567feb1b186",
                "fields": [
                    {
                        "title": "Where",
                        "value": "1535 Mission Street, San Francisco, CA 94103",
                        "short": true
                    },
                    {
                        "title": "When",
                        "value": "Tue, Oct 11, 2016 at 7:00 PM",
                        "short": true
                    }
                ],
                "from_url": "https:\/\/www.eventbrite.com\/e\/non-gaming-virtual-reality-meetup-6-ft-facebook-dolby-dysonics-subpac-tickets-27899271472?utm_source=eb_email&utm_medium=email&utm_campaign=order_confirmation_email&utm_term=eventname&ref=eemailordconf",
                "image_width": 500,
                "image_height": 250,
                "image_bytes": 467268,
                "service_icon": "https:\/\/cdn.evbstatic.com\/s3-build\/perm_001\/1aab42\/django\/images\/touch_icons\/apple-touch-icon-57x57.png",
                "id": 1
            }
        ],
        "ts": "1476121677.000073"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "i want 2 go 2 sf",
        "ts": "1476121682.000075"
    },
    {
        "type": "message",
        "user": "U0H4SJN11",
        "text": "+1",
        "ts": "1476121743.000076"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "<@U0H4SJN11> carpool?",
        "ts": "1476121763.000077"
    },
    {
        "type": "message",
        "user": "U0H4SJN11",
        "text": "why not",
        "ts": "1476121785.000078"
    }
]