[
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "I brought my oculus setup, and gaming laptop in. If anyone wants to check it out. We can set it up somewhere. It is unreal. Was playing a while last night and completely amazing by how immersive it is. Kept having to remember those things on the floor i wont trip over, or the counter i can't lean on. The touch controllers work really well. Got the rick and morty game and theres these puzzles where you do some rhythm simon type thing turning dials and pushing buttons. And it was impressive how much it was like you were really doing that and how responsive the movements were",
        "ts": "1500395750.927815"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "Can you get google blocks set up on it ?",
        "ts": "1500396053.102926"
    },
    {
        "type": "message",
        "user": "U3M4RRNQ5",
        "text": "also Tilt Brush",
        "ts": "1500396110.135627"
    },
    {
        "type": "message",
        "user": "U3M4RRNQ5",
        "text": "I watched an illustrator friend experience Tilt Brush as the first VR app she had used and it was sort of revelatory",
        "ts": "1500396178.174026"
    },
    {
        "type": "message",
        "user": "U3M4RRNQ5",
        "text": "that and Google Earth are the most compelling demos I’ve seen so far",
        "ts": "1500396205.189741"
    },
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "I can install blocks, tilt brush is $20 tho",
        "ts": "1500396336.264917"
    },
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "Super hot is incredible, was playing that last night and its very physically demanding. it has you dodging bullets and hiding behind stuff",
        "ts": "1500396383.292410"
    },
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "and robo recall is great too",
        "ts": "1500396396.299349"
    },
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "i have quill and medium installed think those are similar to tilt brush",
        "ts": "1500396530.379310"
    },
    {
        "type": "message",
        "user": "U3M4RRNQ5",
        "text": "I think Quill and Tilt Brush offer pretty different experiences but I haven’t used Quill to comment on how they differ",
        "ts": "1500396862.578125"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "peter i will expense tilt brush",
        "ts": "1500397879.182097"
    },
    {
        "type": "message",
        "user": "U06DFL7BP",
        "text": "i played superhot on non VR and i loved it so much",
        "ts": "1500397889.188523"
    },
    {
        "type": "message",
        "user": "U3M4RRNQ5",
        "text": "I think we should block off a conference room for a few hours to mirror the display on a big screen ",
        "ts": "1500397962.230908"
    },
    {
        "type": "message",
        "user": "U0EL0GLEL",
        "text": "super hot in vr is incredible it was one of the best things i tried last night. they really make you move around",
        "ts": "1500398678.642644"
    }
]