[
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "<https:\/\/kamsyn.com\/2016\/09\/26\/magnum-photographers-and-afac-in-lebanon-for-documentary-photography-workshop-at-linstitut-francais\/>\n\nRe: our <http:\/\/arabdocphotography.org|arabdocphotography.org> site.",
        "attachments": [
            {
                "service_name": "Kamsyn",
                "service_url": "http:\/\/kamsyn.com",
                "title": "MAGNUM Photographers and AFAC in Lebanon for Documentary Photography Workshop at l’Institut Français",
                "title_link": "https:\/\/kamsyn.com\/2016\/09\/26\/magnum-photographers-and-afac-in-lebanon-for-documentary-photography-workshop-at-linstitut-francais\/",
                "author_name": "kamsyn",
                "author_link": "https:\/\/kamsyn.com\/author\/kamsyn\/",
                "thumb_url": "https:\/\/i1.wp.com\/kamsyn.files.wordpress.com\/2016\/09\/susan-meiselas-magnum-foundation-present-tanya-405-v22n7-body-image-1436550512.jpg?fit=200%2C150&ssl=1",
                "thumb_width": 200,
                "thumb_height": 133,
                "text": "&nbsp;\n&nbsp;\nFrom the 26th to the 29th of August at the French Institute of Beirut, the Arab Documentary Photography Program 2016 (ADPP) held its first workshop to allow 10 selected young documentary photographers to work with the four mentors of the program. An occasion as well for&nbsp;Randa Shaath, Tanya Habjouqa, Eric Gottesman and Peter Van Agmael, to meet with their regional audience. Kamsyn also was thrilled to meet with Internationally Famous Magnum Photographer Susan Meiselas.\nSusan Meiselas \nMeiselas has had one-woman exhibitions in Paris, Madrid, Amsterdam, London, Los Angeles, Chicago, and New York, and her work is included in collections around the world. She has received the Robert Capa Gold Medal for her work in Nicaragua (1979); the Leica Award for Excellence (1982); the Engelhard Award from the Institute of Contemporary Art (1985); the Hasselblad Foundation Photography prize (1994); the Cornell Capa Infinity Award (2005) and most recently was awarded the Harvard Arts Medal (2011). In 1992, she was named a MacArthur Fellow.\n\nIn Beirut at the Institut Fran&ccedil;ais, Susan gave an inspiring opening talk to all the Photography Fans &amp; Pros in the audience.\n\nThe ADPP&nbsp;was jointly&nbsp;launched in 2014 by the Prince Claus Fund and the Arab Fund for Art and Culture (AFAC), with the help of Magnum Foundation, in order to grant selected creative documentary photographers with a financial, technical and professional support to complete their own projects during two years. One of the founders of this initiative, AFAC, is an independent regional initiative that offers financial and professional support to emerging and established artists from the Arab region and to cultural institutions engaged in the contemporary Arab art and culture scene. Since 2007, the organization provides in all Arab countries special creative programs aiming to develop individual improvement as well as acts towards sustainability in the arts and culture sector.\n\nAccording to Cathy Khattar, grants manager for AFAC, the purpose of one of these programs is the ADPP, allowing to introduce &ldquo;young photography talents to documentary photography, an important but under-developed genre in the Arab World&rdquo;. Cathy&nbsp;explains it targets &ldquo;young photographers aiming at documenting important social issues in a non-stereotypical and unconventional way, with the help of Magnum Foundation, the leading institution working on documentary photography with respect of high standards in journalism and art&nbsp;with the support &amp; co-funding of the Prince Claus Fund who believed in the importance of this program in the Arab region in this very critical period&rdquo;.\n\nAccording to the dynamic&nbsp;Cathy, the first workshop was held in Beirut because the city &ldquo;is a culturally thriving Arab city. Exhibitions, performances, cultural talks and conferences and many other cultural activities are running during all the year&rdquo;, she added. &ldquo;AFAC is also based there, which makes the logistics of hosting workshops easier. We always look at creating and maintaining partnerships as well as&nbsp;collaborations with other institutions working in the cultural and artistic fields in Lebanon, the Arab region and all over the world&rdquo;. They chose to partner with the French Institute for its involvement in Culture in the country.\nA part from&nbsp;the focus it brings to Documentary Photography in the region, the question of Social Issues is of major importance&nbsp;for the ADPP. &ldquo;Documentary photography deals with major social issues. Some of these subjects are still taboo, like sexual harassment for example. Other subjects have political aspects, making it difficult&nbsp;for photographers to work easily in their societies. The main challenge for this program is to offer young photographers with the ability&nbsp;to tackle important subjects, get access to the right resources, and presenting the final deliverable in an innovative but deep approach.&rdquo;\nOussama Rifahi, Susan Meiselas,Tanya Habjouqa, Eric Gotteman &amp; Randa Shaath\nSince 2014, the program supported 29 young photographers, whose works are displayed on this online platform. &ldquo;Many&nbsp;participated in International Exhibitions like Omar Imam and Nathalie Naccache in Photoville 2015 in New York, in regional exhibitions like Reem Falaknaz in Gulf Photo, Dubai, and appeared in well-known national, international and online magazines. The photographers have been nominated and received prestigious awards, like Sima Diab with the James Foley Award in 2016. On the personal level, the workshops, meetings and mentoring process have been life-changing experiences for the grantees, allowing them to have an in-depth look on their work from the beginning, and also introducing them to different styles of photography and presentations.&rdquo;\nAmong the four mentors present for the workshop, Peter Van Agmael and Tanya Habjouqa&nbsp;sat with&nbsp;Kamsyn to answer a few questions.\nPeter Van Agmael\nBorn in Washington DC, Peter Van Agmael studied History and Yale and became famous by covering the 9\/11 wars and consequences, in Iraq, Afghanistan and the USA. Full member of Magnum since 2013, he has won the Eugene Smith Grant, the ICP Infinity Award for Young Photographer, the Lumix Freelens Award, as well as awards from World Press Photo, American Photography Annual, The Pulitzer Center, The Center for Documentary Studies at Duke University and Photo District News.\nPhoto Peter Van Agmael\nHis choice to cover the 9\/11 issue is not accidental. &ldquo;I was a university student during 9\/11 and had only just begun taking photographs&rdquo;, he explained. &ldquo;I was intrigued by war, as many young men are, but it was also very abstract to me.&rdquo; An interest that led him to question his own country&rsquo;s policies. &ldquo;After 9\/11 and the invasion of Iraq I wanted to understand my country and its choices. I found it very difficult to find a complex and thoughtful historical narrative of the chain of events that led to 9\/11. Of course there are many ways I could have accomplished learning this knowledge, but I felt a very strong kind of primal draw towards photography, journalism, and conflict. In retrospect I think many of my reasons for covering conflict have been meaningful but it has also been a dark and selfish choice.&rdquo; Peter&nbsp;then followed America soldiers to Iraq, for the first time in 2006, at the time he described being &ldquo;a young man with little experience&rdquo;, a choice that was driven by practical reasons: &ldquo;It was very dangerous to work without embedding and I did not have sufficient resources or experience to work on my own. I was only 24 and had just started my professional life&rdquo;.\nPhoto&nbsp; Peter Van Agmael\nThe photographer also covered the &ldquo;other side&rdquo;, the American one, following soldiers back from the war. &ldquo;Over time, as I developed in my work, there were more opportunities to work independently. I also felt I&rsquo;d seen enough of the military perspective.&nbsp; Although people could tend to give him the &ldquo;journalism&rdquo; or &ldquo;art&rdquo; label, Peter Van Agmael refuses to be branded and&nbsp;adds &ldquo;the best work has qualities that transcend&rdquo;. &nbsp;&ldquo;Photography is profoundly democratic, and the best way to look at it is holistically&rdquo;, he concluded.\nTanya Habjouqa\nTanya Habjouqa was born in Jordan, educated in Texas and is based now in East Jerusalem after studies in Global Media and Middle East Politics in London. Known for covering sensitive gender, Social and Human rights stories in the Middle East, she won the 2014 World Press Award for Daily Life Stories and co-founded the Rawiya photo collective, the first All-Female Photo collective of the Middle East. She is represented by East Wing, an international platform for photography, founded in Doha.\nPhoto Tanya Habjouqa\nAbout the Rawiya photo collective, …",
                "fallback": "Kamsyn Link: MAGNUM Photographers and AFAC in Lebanon for Documentary Photography Workshop at l&rsquo;Institut Français",
                "from_url": "https:\/\/kamsyn.com\/2016\/09\/26\/magnum-photographers-and-afac-in-lebanon-for-documentary-photography-workshop-at-linstitut-francais\/",
                "service_icon": "https:\/\/s0.wp.com\/i\/webclip.png",
                "id": 1
            }
        ],
        "ts": "1475030129.000052"
    }
]