[
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<@U0MKH0BE0> Hey Melodee - sounds like we're good to go on the main conference room signage front and Ally and Matt are going to handle the ordering &amp; install. \n\nIs there any update on the new wayfinding? Is that up for folks to check out?",
        "ts": "1497893432.129399"
    },
    {
        "type": "message",
        "user": "U0MKH0BE0",
        "text": "Perfect timing. Just about to print and put up",
        "ts": "1497893533.167003"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Awesome thanks!",
        "ts": "1497893573.182224"
    },
    {
        "type": "message",
        "user": "U0H4SJN11",
        "text": "<@U026PHQ3J> Tagging you in",
        "ts": "1497901766.204080"
    },
    {
        "user": "U026PHQ3J",
        "inviter": "U0H4SJN11",
        "text": "<@U026PHQ3J|evans> has joined the channel",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1497901769.205345"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "? ",
        "ts": "1497902110.323766"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<@U0MKH0BE0> can you let us know if\/when all the new wayfinding signage is up? ",
        "ts": "1497902294.389844"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "the “you are here” signs are up. i saw them. i’d like to talk about them but i dont know if this is the right forum for it",
        "ts": "1497902436.443241"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": ":)",
        "ts": "1497902439.444091"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "This is not a bad option. Another option is talking to Matt directly with feedback. ",
        "ts": "1497902646.520876"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "will do!",
        "ts": "1497902708.542995"
    },
    {
        "type": "message",
        "user": "U0MKH0BE0",
        "text": "Sure thing.\nHad some typos and such so getting those reprinted. Other than that way finding is up",
        "ts": "1497902750.557577"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Cool thanks ",
        "ts": "1497902783.568918"
    },
    {
        "type": "message",
        "user": "U0MKH0BE0",
        "text": "I’d also like to hear your feedback <@U026PHQ3J>",
        "ts": "1497902789.570971"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "ok! its just that the “you are here” ones are a little disorienting because when you’re looking at the 3d representation of the building, you’re facing the north wall (physically), but in the map, the north wall points down on the page",
        "edited": {
            "user": "U026PHQ3J",
            "ts": "1497902866.000000"
        },
        "ts": "1497902852.593164"
    },
    {
        "type": "message",
        "user": "U0MKH0BE0",
        "text": "hey <@U026PHQ3J> thanks for your feedback. I also questioned whether that was the best orientation of the map with type. I have another map facing the opposite that I’ll put up shortly and see if that’s working better",
        "ts": "1497903215.719578"
    },
    {
        "type": "message",
        "user": "U026PHQ3J",
        "text": "cool cool! i am but one man, and also please dont discount the (very high) likelihood that i am just bad at navigating :)",
        "ts": "1497903329.758836"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "i have same feedback; sign should match real world cardinal directions. and wayfinding arrow shapes should match the rough movement of the person following the instructions, so the directions from the west stairs to Iron, for example, seem weird.",
        "ts": "1497905929.666231"
    },
    {
        "type": "message",
        "user": "U0MKH0BE0",
        "text": "Alright signage team, take a look at way finding when you get a chance. There are two perspectives of the map near the elevators. Still not sure which feels right directionally but one has all the room names towards the front of the map while the other has the names towards the back of the map. Please let me know if you all prefer legend or no legend. There’s also way finding signs up in front of stairways on both floors.",
        "ts": "1497905930.666630"
    },
    {
        "type": "message",
        "user": "U0HPGQ4KH",
        "text": "Thanks Melodee for the drafts. 'Would second what Evans and John said. Also numbering and looking for the number and explanation seems more work. Write into the map seems way easier. The map is now an isometric view (fake perspective) I personally get thrown off as the far corner seems to get wider. We could try 'real perspective' or a good old plain 'top view', also called 'plan view'. Please check the atrium stair lines. They might match the convention or they are actually reversed (shorter lines going upstairs or downstairs). I will stop by in person, probably easier to explain it 1to1 ",
        "ts": "1497913278.509200"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Thanks Felix - Matt, Ivan, and I also had an impromptu meeting in front of the signage and came to similar conclusions. Ivan is actually going to take a pass at marrying the wayfinding signage with the map a bit more, with a lot of what you just said here in mind.",
        "ts": "1497913390.531203"
    }
]