[
    {
        "type": "message",
        "user": "U0MKH0BE0",
        "text": "<@U026PLK4S> <@U0260V1BX>: Can I get a the final deck we presented to the execs for names? I know you both are busy with Care, but I wanted to start looking to that deck for reference.",
        "ts": "1494521275.225652"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "I think can get that for you Melodee, one sec",
        "ts": "1494521611.404846",
        "reactions": [
            {
                "name": "thanks",
                "users": [
                    "U0MKH0BE0"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "subtype": "file_share",
        "text": "<@U026103R3|abby> shared a file: <https:\/\/uncorked.slack.com\/files\/abby\/F5C6T4BK4\/aryasignage_pres_27mar2017__1_.pdf|AryaSignage_Pres_27Mar2017 (1).pdf>",
        "file": {
            "id": "F5C6T4BK4",
            "created": 1494521653,
            "timestamp": 1494521653,
            "name": "AryaSignage_Pres_27Mar2017 (1).pdf",
            "title": "AryaSignage_Pres_27Mar2017 (1).pdf",
            "mimetype": "application\/pdf",
            "filetype": "pdf",
            "pretty_type": "PDF",
            "user": "U026103R3",
            "editable": false,
            "size": 12105257,
            "mode": "external",
            "is_external": true,
            "external_type": "gdrive",
            "is_public": true,
            "public_url_shared": false,
            "display_as_bot": false,
            "username": "",
            "url_private": "https:\/\/drive.google.com\/open?id=0Bx4AgyarifjlNG9kZ0NfQzIwam8",
            "permalink": "https:\/\/uncorked.slack.com\/files\/abby\/F5C6T4BK4\/aryasignage_pres_27mar2017__1_.pdf",
            "channels": [
                "C46QQ778E"
            ],
            "groups": [],
            "ims": [],
            "comments_count": 0,
            "has_rich_preview": true
        },
        "user": "U026103R3",
        "upload": false,
        "display_as_bot": false,
        "username": "abby",
        "bot_id": null,
        "ts": "1494521653.427313"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Alright folks, next Wednesday afternoon for 30 min we'll have al the execs. Def doesn't have to be too formal but Melodee would be great if you can work on the deck and tap people as needed.",
        "ts": "1494522228.747519"
    },
    {
        "type": "message",
        "user": "U0MKH0BE0",
        "text": "Of course! I know Matt and Melissa are busy with Care but if you guys are able to meet up or DM me on what you like to see in this deck, that would be great",
        "ts": "1494522477.881787"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "<https:\/\/www.schick-toikka.com\/chap>",
        "attachments": [
            {
                "title": "Chap – Schick Toikka",
                "title_link": "https:\/\/www.schick-toikka.com\/chap",
                "text": "The history of the 20th-century Grotesk is a story of gradually diminishing stroke contrast. Sans serifs with visible contrast (also known as modulated, thick-thin, or stressed) were quite popular in the 1920s–50s when they were commonly used in advertising, architectural lettering, and logotypes. This typographic style fell out of fashion when late Modernism took over, and it effectively went into hiding for the next fifty years, reappearing only in the service of novelty or nostalgia. Initially designed for the Finnish Culture Institute in New York, Chap pays tribute to the contrasted sans tradition, but avoids direct references to any particular design. In fact, even its construction skirts convention. Its thicks and thins generally reference the broad nib pen, but not always in expected ways. There are unusual twists of stroke, and even moments where calligraphy yields to geometry. Chap is an attempt to show that a sans with contrast can be modern and current. It is type that feels at home in a variety of contemporary environments, and yet, it is not just a fashionable face. In lieu of chasing trends associated with display typography, Chap seeks a more timeless, functional aesthetic by drawing letters that can work together in readable passages of text in all sizes and lengths. This multipurpose aim is also reflected in the generous weight range (six plus italics), the figures for text, titling, and tables, and the Extended Latin character set. Chap is a mix of the smooth and the sharp, a sans serif with a new idea of contrast for the new century.",
                "fallback": "Chap – Schick Toikka",
                "image_url": "https:\/\/www.schick-toikka.com\/api\/images\/chap",
                "from_url": "https:\/\/www.schick-toikka.com\/chap",
                "image_width": 476,
                "image_height": 250,
                "image_bytes": 35127,
                "service_name": "schick-toikka.com",
                "id": 1
            }
        ],
        "ts": "1494522881.097181"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "I really want to outline why we chose Chap",
        "ts": "1494522889.101728"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "the type foundry has a nice paragraph about the typeface that we should reference",
        "ts": "1494522905.110138"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "&gt;Initially designed for the Finnish Culture Institute in New York, Chap pays tribute to the contrasted sans tradition, but avoids direct references to any particular design. In fact, even its construction skirts convention. Its thicks and thins generally reference the broad nib pen, but not always in expected ways. There are unusual twists of stroke, and even moments where calligraphy yields to geometry. Chap is an attempt to show that a sans with contrast can be modern and current. It is type that feels at home in a variety of contemporary environments, and yet, it is not just a fashionable face. In lieu of chasing trends associated with display typography, Chap seeks a more timeless, functional aesthetic by drawing letters that can work together in readable passages of text in all sizes and lengths.",
        "ts": "1494522930.124145",
        "reactions": [
            {
                "name": "thanks",
                "users": [
                    "U0MKH0BE0"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Cool. I know i'm peeking in on work in progress here, but admit for the one day i was actually in the new space, this was a curiosity i had. Nice to read more about it from the shop",
        "ts": "1494523901.649902"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Sounds good, and yes <@U0260V1BX> if you have thoughts please surface those. Otherwise Matt if you and Melodee could connect on that front that would be super helpful.",
        "ts": "1494523987.697256"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "<@U0MKH0BE0> not sure what tool you plan to use to make that deck but if it's collaborative (like google slides) that would be great to share with the team and see WIP as we go along.",
        "ts": "1494524439.945350"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "thinking specifically about me being able to add next steps slides, etc",
        "ts": "1494524450.952950"
    },
    {
        "type": "message",
        "user": "U0MKH0BE0",
        "text": "<@U026103R3> I’ve already started an InDesign document for the deck but I plan to share consistently… will that work? Or does this need to be in google?",
        "ts": "1494524725.103375"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "that works, no problem. i can always write up next steps closer to the date and have you add them in",
        "ts": "1494524747.115051"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "thanks!",
        "ts": "1494524748.115604"
    },
    {
        "type": "message",
        "user": "U0MKH0BE0",
        "text": "Thank you!",
        "ts": "1494525308.426883"
    }
]