[
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "<!channel> — \n\nAgain, thank you all for putting so much thought into the signage proposal. You all made the ask of the exec team today both really easy (we had all the information we could ever need to decide) and difficult (both directions exceptionally strong). \n\nWe had a discussion this morning about both directions, and came to the consensus that Materials felt like the direction we'd like to move forward with. Per our conversations yesterday, we felt that Materials struck a high note in all three criteria of sound, memory, and story. \n\nWe're super excited about the direction, but also that the team could create such cohesive and well-considered work for us to debate. \n\nLet me know if you need anything at all from us, including any non-execs-silently-debating version of our involvement. \n\nThanks again for everything. Looking forward to moving in!",
        "ts": "1490729993.326180"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Thank you Ewald, really appreciate the followup and decision.",
        "ts": "1490730097.378550"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Sure thing. Like I said, we're happy to help push things forward. Just let us know what you need.",
        "ts": "1490730137.397916"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Any additional feedback? Like how Evans hates \"Carrara\"?",
        "ts": "1490730241.448947"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "Still think the list could be tuned in a couple of spots. ",
        "ts": "1490730268.461907"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "For sure. If I'm being honest, we only got to the part where we made the initial decision.",
        "ts": "1490730351.503914"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Let's regroup as a more full team to discuss where improvements should fall",
        "ts": "1490730365.510608"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "And of course, if you have any areas that you already think need improvement as a team, storm forward!",
        "ts": "1490730403.530152"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Evans says carrera \"needs to change to marble\" just as an fyi in the meantime",
        "ts": "1490730615.636027"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "ol’ David “Carrara” Evans",
        "ts": "1490731554.112027"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": ":raised_hands::skin-tone-4:",
        "ts": "1490731561.115328"
    },
    {
        "type": "message",
        "user": "U026103R3",
        "text": "Hey folks! I just checked in with Matt and Melissa on this, but wanted to recap that the feedback items coming out of the exec decision include: \n\n1. Change carrera to marble\n2. Potentially change Gold, Silver, Bronze, Platinum to something else as they align a little too closely to SXSW badges (lol)\n\nIn the meantime, let's push forward on execution design! <@U0MKH0BE0> if you can go broad and start to sketch out lots of possible directions for Materials execution, that'd be great. Don't worry about polish\/fideltiy at this stage. <@U026PLK4S> is going to connect with Ally about getting back over to the space to measure, check out the glass, and get a good sense of the constraints. \n\nFYI I am OOO rest of this week for care, so please check in with each other and keep the ball moving. I'll schedule a check in for us next week some time where the goal will be to show progress so we can figure out next steps. Thanks!",
        "ts": "1490734164.392372",
        "reactions": [
            {
                "name": "raised_hands::skin-tone-2",
                "users": [
                    "U0HS41J3Y",
                    "U0HPGQ4KH"
                ],
                "count": 2
            }
        ]
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Thanks! And I'm happy to rep anything you all need from exec side. Let me know, loop me in as you see fit",
        "ts": "1490734216.417655"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "and for context… i think we all really like the original execution exploration that matt\/melodee were working on, but I just want to do our due diligence and go broad before converging on one direction. I do think that we should kick the tires a bit on that direction once we know the space constraints - i.e. what imagery would be used for each room, given the naming system - are there any materials that are challenging in terms of finding good \/ interesting imagery?",
        "ts": "1490734367.490701"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "there's some joking on blackops about naming the flex offices something after building block materials. i'd characterize it as an idea, not direction. think brick. (the jokes are now add sticks, straw, and piggies, so can't be too serious, right?)",
        "ts": "1490734416.514773"
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Let's leave the mechanics of what comes next in this <!channel>'s capable hands",
        "ts": "1490734465.538997",
        "reactions": [
            {
                "name": "raised_hands",
                "users": [
                    "U026103R3",
                    "U0260V1BX",
                    "U02918BKW"
                ],
                "count": 3
            }
        ]
    },
    {
        "type": "message",
        "user": "U0265G76F",
        "text": "Team: use me as conduit to all things exec. ",
        "ts": "1490734481.546843"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "too bad most precious metals have terrible names: <https:\/\/en.wikipedia.org\/wiki\/Precious_metal>",
        "edited": {
            "user": "U0260V1BX",
            "ts": "1490734565.000000"
        },
        "ts": "1490734560.585001"
    },
    {
        "type": "message",
        "user": "U0260V1BX",
        "text": "gemstones? <http:\/\/geology.com\/gemstones\/>",
        "edited": {
            "user": "U0260V1BX",
            "ts": "1490734578.000000"
        },
        "ts": "1490734573.591437"
    },
    {
        "type": "message",
        "user": "U026PLK4S",
        "text": "John: :hear_no_evil: :see_no_evil:",
        "ts": "1490735195.891094"
    },
    {
        "type": "message",
        "user": "U02918BKW",
        "text": "hooo hoo hoo!",
        "ts": "1490743389.686554"
    }
]